Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_cli_app.po
Languages: ko, pt_br, zh_cn

source: Java Client Library - Applications
ko: Java 클라이언트 라이브러리 - 애플리케이션
pt_br: Biblioteca do Cliente Java – Aplicativos
zh_cn: Java 客户机库 - 应用程序

source: Introduction
ko: 소개
pt_br: Introdução
zh_cn: 简介

source: This client library describes how to use applications with the Java ibmiotf client library. For help with getting started with this module, see `Java Client Library - Introduction <../java/javaintro.html>`__.
ko: 이 클라이언트 라이브러리는 Java ibmiotf 클라이언트 라이브러리와 함께 애플리케이션을 사용하는 방법에 대해 설명합니다. 이 모듈 시작에 대한 도움말은 `Java 클라이언트 라이브러리 - 소개 <../java/javaintro.html>`__를 참조하십시오.
pt_br: Esta biblioteca do cliente descreve como usar aplicativos com a biblioteca do cliente ibmiotf Java. Para obter ajuda sobre como iniciar este módulo, consulte `Biblioteca do cliente Java - Introdução <../java/javaintro.html>`__.
zh_cn: 此客户机库描述了如何将应用程序与 Java ibmiotf 客户机库配合使用。有关如何开始使用此模块的帮助，请参阅 `Java 客户机库 - 简介 <../java/javaintro.html>`__。

source: This client library is divided into three sections, all included within the library. This section contains information on how applications can use the Java ibmiotf Client Library to interact with devices.
ko: 이 클라이언트 라이브러리는 세 개의 절로 구성되며 모두 라이브러리에 포함되어 있습니다. 이 절에는 애플리케이션이 디바이스와 상호작용하는 데 Java ibmiotf 클라이언트 라이브러리를 사용할 수 있는 방법에 대한 정보가 포함됩니다.
pt_br: Esta biblioteca do cliente é dividida em três seções, todas incluídas na biblioteca. A seção Aplicativos contém informações sobre como os aplicativos podem usar a Biblioteca do Cliente Java ibmiotf para interagir com dispositivos.
zh_cn: 此客户机库分为三个部分，均包含在库中。此部分包含有关应用程序可如何使用 Java ibmiotf 客户机库与设备交互的信息。

source: The `Device section <../java/java_cli_devices.html>`__ contains information on how devices can publish events and handle commands using the Java ibmiotf Client Library.
ko: `디바이스 절 <../java/java_cli_devices.html>`__ 에는 디바이스가 Java ibmiotf 클라이언트 라이브러리를 통해 이벤트를 공개하고 명령을 처리할 수 있는 방법에 대한 정보가 포함됩니다.
pt_br: A `seção Dispositivo <../java/java_cli_devices.html>`__ contém informações sobre como os dispositivos podem publicar eventos e manipular comandos usando a Biblioteca do Cliente Java ibmiotf.
zh_cn: `设备部分 <../java/java_cli_devices.html>`__ 中包含有关设备如何使用 Java ibmiotf 客户机库发布事件和处理命令的信息。

source: The `Managed Device section <../java/java_deviceManagement.html>`__ contains information on how devices can connect to the Internet of Things Foundation Device Management service using Java ibmiotf Client Library and perform device management operations like firmware update, location update, and diagnostics update.
ko: `관리 디바이스 절 <../java/java_deviceManagement.html>`__에는 디바이스가 Java ibmiotf 클라이언트 라이브러리를 통해 Internet of Things Foundation 디바이스 관리 서비스에 연결하고 펌웨어 업데이트, 위치 업데이트 및 진단 업데이트와 같은 디바이스 관리 오퍼레이션을 수행할 수 있는 방법에 대한 정보가 포함됩니다.
pt_br: A `seção Dispositivo Gerenciado <../java/java_deviceManagement.html>`__ contém informações sobre como os dispositivos podem se conectar ao Internet of Things Foundation Connect de serviço usando a biblioteca do cliente Java ibmiotf e executar operações de gerenciamento de dispositivos, como atualizações de firmware, atualizações de local e atualizações de diagnóstico.
zh_cn: `受管设备部分 <../java/java_deviceManagement.html>`__ 包含的信息涉及设备如何使用 Java ibmiotf 客户机库连接到“Internet of Things Foundation 设备管理”服务，以及设备如何执行设备管理操作，如固件更新、位置更新和诊断更新。

source: Constructor
ko: 생성자
pt_br: Construtor
zh_cn: 构造方法

source: The constructor builds the client instance, and accepts a Properties object containing the following definitions:
ko: 생성자는 클라이언트 인스턴스를 빌드하고 다음 정의가 포함된 특성 오브젝트를 승인합니다.
pt_br: O construtor constrói a instância do cliente e aceita um objeto Propriedades contendo as seguintes definições:
zh_cn: 此构造方法用于构建客户机实例，并接受包含以下定义的属性对象：

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
ko: org - 조직 ID. (필수 필드입니다.) quickstart 플로우의 경우 org를 quickstart로 제공하십시오.
pt_br: org - O ID da organização. (Este é um campo obrigatório. No caso de fluxo de iniciação rápida, forneça org como iniciação rápida.)
zh_cn: org - 贵组织的标识。（这是必填字段。在 quickstart 流程中，将组织作为 quickstart 提供。）

source: id - The unique ID of your application within your organization.
ko: id - 조직 내 애플리케이션의 고유 ID.
pt_br: ID - O ID exclusivo de seu aplicativo dentro de sua organização.
zh_cn: id - 贵组织内应用程序的唯一标识。

source: auth-method - Method of authentication (the only value currently supported is “apikey”).
ko: auth-method - 인증 방법(현재 지원되는 유일한 값은 “apikey”임)
pt_br: auth-method – Método de autenticação (o único valor atualmente suportado é “apikey”).
zh_cn: auth-method - 认证方法（当前唯一支持的值为“apikey”）。

source: auth-key - API key (required if auth-method is “apikey”).
ko: auth-key - API 키(auth-method가 “apikey”인 경우 필수).
pt_br: auth-key - Chave da API (necessária se método de autenticação for “apikey”).
zh_cn: auth-key - API 密钥（如果 auth-method 为“apikey”，那么此项为必需项）。

source: auth-token - API key token (required if auth-method is “apikey”).
ko: auth-token - API 키 토큰(auth-method가 “apikey”인 경우 필수).
pt_br: auth-token - Token da chave de API (necessário se o método de autenticação for “apikey”).
zh_cn: auth-token - API 密钥令牌（如果 auth-method 为“apikey”，那么此项为必需项）。

source: enable-shared-subscription - true or false (required only if shared subscription needs to be enabled)
ko: enable-shared-subscription - true 또는 false(공유 구독을 사용으로 설정해야 하는 경우에만 필수)
pt_br: enable-shared-assinatura – true ou false (necessário apenas se assinatura compartilhada precisar ser ativada)
zh_cn: enable-shared-subscription - true 或 false（仅在启用共享的预订时需要）

source: One must set **enable-shared-subscription** to true to build scalable applications which will load balance messages across multiple instances of the application. Refer to the `scalable applications section <https://docs.internetofthings.ibmcloud.com/messaging/applications.html#/scalable-applications#scalable-applications>`__ for more information about the load balancing.
ko: **enable-shared-subscription**을 true로 설정하여 애플리케이션의 여러 인스턴스 간에 메시지를 로드밸런싱하는 확장 가능 애플리케이션을 빌드해야 합니다. 로드밸런싱에 대한 자세한 정보는 `확장 가능 애플리케이션 절 <https://docs.internetofthings.ibmcloud.com/messaging/applications.html#/scalable-applications#scalable-applications>`__의 내용을 참조하십시오.
pt_br: Deve-se definir **enable-shared-subscription** como true para construir aplicativos escaláveis que farão o balanceamento das cargas de mensagens em várias instâncias do aplicativo. Consulte a `seção aplicativos escaláveis <https://docs.internetofthings.ibmcloud.com/messaging/applications.html#/scalable-applications#scalable-applications>`__ para obter mais informações sobre o balanceamento de carga.
zh_cn: 必须将 **enable-shared-subscription­** 设置为 true 以构建可扩展应用程序，用于在应用程序的多个实例之间对消息进行负载均衡。请参阅 `可扩展应用程序部分 <https://docs.internetofthings.ibmcloud.com/messaging/applications.html#/scalable-applications#scalable-applications>`__，了解有关负载均衡的更多信息。

source: The Properties object creates definitions which are used to interact with the Internet of Things Foundation module. If no options are provided or organization is provided as quickstart, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device.
ko: 특성 오브젝트는 Internet of Things Foundation 모듈과 상호작용하는 데 사용되는 정의를 작성합니다. 옵션이 제공되지 않거나 조직이 quickstart로 제공되는 경우 클라이언트가 Internet of Things Foundation Quickstart에 연결하고 등록되지 않은 디바이스로 기본값을 설정합니다.
pt_br: O objeto Propriedades cria definições que são usadas para interagir com o módulo do Internet of Things Foundation. Se nenhuma opção ou organização for fornecida como iniciação rápida, o cliente irá conectar-se a Iniciação rápida do Internet of Things Foundation e tornar padrão um dispositivo sem registro.
zh_cn: 属性对象创建用于与 Internet of Things Foundation 模块进行交互的定义。如果没有提供任何选项或者组织作为 quickstart 提供，那么客户机将连接到 Internet of Things Foundation Quickstart，并缺省为未注册的设备。

source: The following code snippet shows how to construct the ApplicationClient instance in Quickstart mode,
ko: 다음 코드 스니펫은 Quickstart 모드에서 ApplicationClient 인스턴스를 생성하는 방법을 보여줍니다.
pt_br: O fragmento de código a seguir mostra como construir a instância ApplicationClient no modo de Iniciação rápida,
zh_cn: 以下代码片段显示了如何在 Quickstart 模式下构造 ApplicationClient 实例，

source: The following code snippet shows how to construct the ApplicationClient instance in registered flow,
ko: 다음 코드 스니펫은 등록된 플로우에서 ApplicationClient 인스턴스를 생성하는 방법을 보여줍니다.
pt_br: O fragmento de código a seguir mostra como construir a instância ApplicationClient no fluxo registrado,
zh_cn: 以下代码片段显示了如何在注册流程中构造 ApplicationClient 实例，

source: Using a configuration file
ko: 구성 파일 사용
pt_br: Usando um arquivo de configuração
zh_cn: 使用配置文件

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
ko: 특성 오브젝트를 직접 포함하는 대신 특성에 대한 이름 값 쌍이 포함된 구성 파일을 사용할 수 있습니다. 특성 오브젝트가 포함된 구성 파일을 사용 중인 경우 다음 코드 형식을 사용하십시오.
pt_br: Em vez de incluir um objeto Propriedades diretamente, você pode usar um arquivo de configuração contendo os pares nome-valor para Propriedades. Se você estiver usando um arquivo de configuração contendo um objeto Propriedades, use o formato de código a seguir.
zh_cn: 您可以使用包含属性的“名称/值”对的配置文件，而不是直接包含属性对象。如果使用的配置文件包含属性对象，请使用以下代码格式。

source: The application configuration file must be in the following format:
ko: 애플리케이션 구성 파일의 형식은 다음 형식이어야 합니다.
pt_br: O arquivo de configuração de aplicativo deve estar no seguinte formato:
zh_cn: 应用程序配置文件必须为以下格式：

source: Connecting to the Internet of Things Foundation
ko: Internet of Things Foundation에 연결
pt_br: Conectando-se ao Internet of Things Foundation
zh_cn: 连接到 Internet of Things Foundation

source: Connect to the Internet of Things Foundation by calling the *connect* function.
ko: *connect* 함수를 호출하여 Internet of Things Foundation에 연결하십시오.
pt_br: Conecte-se ao Internet of Things Foundation chamando a função *connect*.
zh_cn: 通过调用 *connect* 函数来连接到 Internet of Things Foundation。

source: After the successful connection to the IoTF service, the application client can perform the following operations, like subscribing to device events, subscribing to device status, publishing device events and commands.
ko: IoTF 서비스에 연결하는 데 성공하면 애플리케이션 클라이언트가 다음 오퍼레이션을 수행할 수 있습니다. 디바이스 이벤트 구독, 디바이스 상태 구독, 디바이스 이벤트 및 명령 공개
pt_br: Após a conexão bem-sucedida com o serviço do IoTF, o cliente de aplicativo pode executar as seguintes operações, como assinatura de eventos do dispositivo, o status do dispositivo de assinatura, a publicação de eventos de dispositivo e comandos.
zh_cn: 成功连接到 IoTF 服务后，应用程序客户机可以执行以下操作，如预订设备事件、预订设备状态以及发布设备事件和命令。

source: Subscribing to device events
ko: 디바이스 이벤트 구독
pt_br: Assinando eventos de dispositivo
zh_cn: 预订设备事件

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
ko: 이벤트는 디바이스가 Internet of Things Foundation에 데이터를 공개하는 데 사용하는 메커니즘입니다. 디바이스는 이벤트의 컨텐츠를 제어하고 전송하는 각 이벤트에 대해 이름을 지정합니다.
pt_br: Eventos são o mecanismo pelo qual os dispositivos publicam dados no Internet of Things Foundation. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_cn: 事件是设备用于将数据发布到 Internet of Things Foundation 的机制。设备控制事件的内容，并为其发送的每个事件分配名称。

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
ko: IoT Foundation이 이벤트를 수신하면 이벤트가 수신된 연결의 신임 정보를 사용하여 이벤트를 전송한 디바이스를 판별합니다. 이 아키텍처를 사용하면 한 디바이스가 다른 디바이스를 위장할 수 없습니다.
pt_br: Quando um evento é recebido pelo IoT Foundation, as credenciais da conexão na qual o evento foi recebido são usadas para determinar de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.
zh_cn: IoT Foundation 接收到事件时，将使用用于接收该事件的连接的凭证来确定是从哪个设备发送了该事件。由于使用这种体系结构，设备将无法模拟其他设备。

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
ko: 기본적으로 애플리케이션은 연결된 모든 디바이스의 모든 이벤트를 구독합니다. 유형, id, 이벤트 및 msgFormat 매개변수를 사용하여 구독의 범위를 제어하십시오. 단일 클라이언트가 여러 구독을 지원할 수 있습니다. 아래의 코드 샘플에서는 디바이스 유형, id, 이벤트 및 msgFormat 매개변수에 종속된 디바이스를 구독하는 방법에 대한 예제를 제공합니다.
pt_br: Por padrão, os aplicativos assinarão todos os eventos de todos os dispositivos conectados. Use os parâmetros de tipo, ID, evento e msgFormat para controlar o escopo da assinatura. Um único cliente pode suportar várias assinaturas. As amostras de código abaixo fornecem exemplos de como assinar os dispositivos dependendo dos parâmetros de tipo de dispositivo, ID, evento e msgFormat.
zh_cn: 缺省情况下，应用程序将预订来自所有已连接设备的所有事件。使用 type、id、event 和 msgFormat 参数来控制预订的作用域。单个客户机可支持多个预订。以下代码样本提供了示例，说明如何预订取决于设备的 type、id、event 和 msgFormat 参数的设备。

source: To subscribe to all events from all devices
ko: 모든 디바이스의 모든 이벤트 구독
pt_br: Para assinar todos os eventos de todos os dispositivos
zh_cn: 预订来自所有设备的所有事件

source: To subscribe to all events from all devices of a specific type
ko: 특정 유형의 모든 디바이스의 모든 이벤트 구독
pt_br: Para assinar todos os eventos de todos os dispositivos de um tipo específico
zh_cn: 预订来自特定类型的所有设备的所有事件

source: To subscribe to all events from a specific device
ko: 특정 디바이스에서 모든 이벤트 구독
pt_br: Para assinar todos os eventos de um dispositivo específico
zh_cn: 预订特定设备的所有事件

source: To subscribe to a specific event from two or more different devices
ko: 둘 이상의 다른 디바이스의 특정 이벤트 구독
pt_br: Para assinar um evento específico de dois ou mais dispositivos diferentes
zh_cn: 预订来自两个或更多不同设备的特定事件

source: To subscribe to events published by a device in json format
ko: json 형식으로 디바이스가 공개하는 이벤트 구독
pt_br: Para assinar os eventos publicados por um dispositivo no formato json
zh_cn: 预订设备发布的 json 格式事件

source: Handling events from devices
ko: 디바이스의 이벤트 처리
pt_br: Manipulando eventos a partir de dispositivos
zh_cn: 处理来自设备的事件

source: To process the events received by your subscriptions you need to register an event callback method. The messages are returned as an instance of the Event class which has the following properties:
ko: 구독에 의해 수신된 이벤트를 처리하려면 이벤트 콜백 메소드를 등록해야 합니다. 메시지는 다음 특성이 있는 이벤트 클래스의 인스턴스로 리턴됩니다.
pt_br: Para processar os eventos recebidos por suas assinaturas, é necessário registrar um método de retorno de chamada de evento. As mensagens são retornadas como uma instância da classe de Eventos que possui as seguintes propriedades:
zh_cn: 要处理您的预订接收的事件，需要注册事件回调方法。消息将作为 Event 类的实例返回，具有以下属性：

source: event.device - string (uniquely identifies the device across all types of devices in the organization)
ko: event.device - 문자열(조직에 있는 모든 유형의 디바이스에서 디바이스를 고유하게 식별함)
pt_br: event.device - sequência (identifica exclusivamente o dispositivo em todos os tipos de dispositivos na organização)
zh_cn: event.device - 字符串（在组织内所有类型的设备中唯一标识该设备）

source: event.deviceType - string
ko: event.deviceType - 문자열
pt_br: event.deviceType - sequência
zh_cn: event.deviceType - 字符串

source: event.deviceId - string
ko: event.deviceId - 문자열
pt_br: event.deviceId - sequência
zh_cn: event.deviceId - 字符串

source: event.event - string
ko: event.event - 문자열
pt_br: event.event - sequência
zh_cn: event.event - 字符串

source: event.format - string
ko: event.format - 문자열
pt_br: event.format - sequência
zh_cn: event.format - 字符串

source: event.data - dict
pt_br: event.data - dic
zh_cn: event.data - 字典

source: event.timestamp - datetime
ko: event.timestamp - 날짜/시간
pt_br: event.timestamp - data/hora
zh_cn: event.timestamp - 日期时间

source: A sample implementation of the Event callback,
ko: 이벤트 콜백의 샘플 구현
pt_br: Uma implementação de amostra do retorno de chamada de Eventos,
zh_cn: 事件回调的样本实现，

source: Once the event callback is added to the ApplicationClient, the processEvent() method is invoked whenever any event is published on the subscribed criteria, The following snippet shows how to add the Event call back into ApplicationClient instance,
ko: 이벤트 콜백이 ApplicationClient에 추가되면 이벤트가 구독된 기준에서 공개되는 경우 항상 processEvent() 메소드가 호출됩니다. 다음 스니펫은 ApplicationClient 인스턴스에 이벤트 콜백을 추가하는 방법을 보여줍니다.
pt_br: Uma vez que o retorno de chamada de evento é incluído ao ApplicationClient, o método processEvent() é chamado sempre que qualquer evento é publicado nos critérios assinados, O fragmento a seguir mostra como incluir o retorno de chamada de volta na instância ApplicationClient,
zh_cn: 一旦将事件回调添加到 ApplicationClient，只要根据预订条件发布任何事件，就会调用 processEvent() 方法，以下片段显示了如何将事件回调添加到 ApplicationClient 实例，

source: Similar to subscribing to device events, the application can subscribe to commands that are sent to the devices. Following code snippet shows how to subscribe to all commands to all the devices in the organization:
ko: 디바이스 이벤트 구독과 유사하게 애플리케이션이 디바이스에 전송된 명령을 구독할 수 있습니다. 코드 스니펫을 따르면 조직에서 모든 디바이스에 대해 모든 명령을 구독하는 방법을 보여줍니다.
pt_br: Semelhante à assinatura de eventos do dispositivo, o aplicativo pode assinar comandos que são enviados para os dispositivos. O fragmento de código a seguir mostra como assinar todos os comandos de todos os dispositivos na organização:
zh_cn: 与预订设备事件类似，应用程序可以预订发送到设备的命令。以下代码片段显示了如何预订指向组织内所有设备的所有命令：

source: Overloaded methods are available to control the command subscription. The processCommand() method is called when a command is sent to the device that matches the command subscription.
ko: 명령 구독을 제어하는 데 과부하된 메소드를 사용할 수 있습니다. 명령 구독에 맞는 디바이스에 명령이 전송되면 processCommand() 메소드가 호출됩니다.
pt_br: Os métodos sobrecarregados estão disponíveis para controlar a assinatura do comando. O método processCommand() é chamado quando um comando é enviado para o dispositivo que corresponde à assinatura do comando.
zh_cn: 重载方法可用于控制命令预订。向与命令预订匹配的设备发送命令时会调用 processCommand() 方法。

source: Subscribing to device status
ko: 디바이스 상태 구독
pt_br: Assinando o status do dispositivo
zh_cn: 预订设备状态

source: Similar to subscribing to device events, applications can subscribe to device status, like device connect and disconnect to Internet of Things Foundation. By default, this will subscribe to status updates for all connected devices. Use the Device Type and Device Id parameters to control the scope of the subscription. A single ApplicationClient can support multiple subscriptions.
ko: 디바이스 이벤트 구독과 유사하게 애플리케이션이 Internet of Things Foundation에 대한 디바이스 연결 및 연결 끊기와 같은 디바이스 상태를 구독할 수 있습니다. 기본적으로 이는 연결된 모든 디바이스에 대한 상태 업데이트를 구독합니다. 디바이스 유형 및 디바이스 ID 매개변수를 사용하여 구독의 범위를 제어하십시오. 단일 ApplicationClient가 여러 구독을 지원할 수 있습니다.
pt_br: Semelhante à assinatura de eventos do dispositivo, os aplicativos podem assinar o status do dispositivo, como o dispositivo se conectar e desconectar ao Internet of Things Foundation. Por padrão, este assinará as atualizações de status para todos os dispositivos conectados. Utilize os parâmetros do Tipo de Dispositivo e ID do Dispositivo para controlar o escopo da assinatura. Um ApplicationClient único pode suportar várias assinaturas.
zh_cn: 与预订设备事件类似，应用程序可以预订设备状态，如设备与 Internet of Things Foundation 连接和断开连接。缺省情况下，这将预订所有已连接设备的状态更新。使用设备类型和设备标识参数控制预订的作用域。单个 ApplicationClient 可支持多个预订。

source: Subscribe to status updates for all devices
ko: 모든 디바이스에 대한 상태 업데이트 구독
pt_br: Assinar as atualizações de status para todos os dispositivos
zh_cn: 预订所有设备的状态更新

source: Subscribe to status updates for all devices of a specific type
ko: 특정 유형의 모든 디바이스에 대한 상태 업데이트 구독
pt_br: Assinar as atualizações de status para todos os dispositivos de um tipo específico
zh_cn: 预订特定类型的所有设备的状态更新

source: Subscribe to status updates for two different devices
ko: 두 개의 다른 디바이스에 대한 상태 업데이트 구독
pt_br: Assinar as atualizações de status para dois dispositivos diferentes
zh_cn: 预订两种不同设备的状态更新

source: Handling status updates from devices
ko: 디바이스의 상태 업데이트 처리
pt_br: Manipulando atualizações de status a partir de dispositivos
zh_cn: 处理来自设备的状态更新

source: To process the status updates received by your subscriptions you need to register an status event callback method. The messages are returned as an instance of the Status class which contains the below mentioned properties:
ko: 구독에 의해 수신된 상태 업데이트를 처리하려면 상태 이벤트 콜백 메소드를 등록해야 합니다. 메시지는 아래에 언급된 특성이 포함된 상태 클래스의 인스턴스로 리턴됩니다.
pt_br: Para processar as atualizações de status recebidas por suas assinaturas, é necessário registrar-se um método de retorno de chamada de evento de status. As mensagens são retornadas como uma instância da classe Status, que contém as propriedades a seguir:
zh_cn: 要处理您的预订接收的状态更新，就需要注册状态事件回调方法。消息将作为 Status 类的实例返回，包含以下提及的属性：

source: The following properties are set for both "Connect" and "Disconnect" status events:
ko: "연결" 상태 이벤트와 "연결 끊기" 상태 이벤트 모두에 대해 다음과 같은 특성이 설정됩니다.
pt_br: As propriedades a seguir são configuradas para os eventos de status "Connect" e "Disconnect":
zh_cn: 为“连接”和“断开连接”状态事件设置了以下属性：

source: status.clientAddr - string
ko: status.clientAddr - 문자열
pt_br: status.clientAddr - sequência
zh_cn: status.clientAddr - 字符串

source: status.protocol - string
ko: status.protocol - 문자열
pt_br: status.protocol - sequência
zh_cn: status.protocol - 字符串

source: status.clientId - string
ko: status.clientId - 문자열
pt_br: status.clientId - sequência
zh_cn: status.clientId - 字符串

source: status.user - string
ko: status.user - 문자열
pt_br: status.user - sequência
zh_cn: status.user - 字符串

source: status.action - string
ko: status.action - 문자열
pt_br: status.action - sequência
zh_cn: status.action - 字符串

source: status.port - integer
ko: status.port - 정수
pt_br: status.port - número inteiro
zh_cn: status.port - 整数

source: The following properties are only set when the action is "Disconnect":
ko: 다음과 같은 특성은 조치가 "연결 끊기"인 경우에만 설정됩니다.
pt_br: As propriedades a seguir são configuradas apenas quando a ação é "Disconnect":
zh_cn: 仅当操作为“断开连接”时，才会设置以下属性：

source: status.writeMsg - integer
ko: status.writeMsg - 정수
pt_br: status.writeMsg - número inteiro
zh_cn: status.writeMsg - 整数

source: status.readMsg - integer
ko: status.readMsg - 정수
pt_br: status.readMsg - número inteiro
zh_cn: status.readMsg - 整数

source: status.reason - string
ko: status.reason - 문자열
pt_br: status.reason - sequência
zh_cn: status.reason - 字符串

source: status.readBytes - integer
ko: status.readBytes - 정수
pt_br: status.readBytes - número inteiro
zh_cn: status.readBytes - 整数

source: status.writeBytes - integer
ko: status.writeBytes - 정수
pt_br: status.writeBytes - número inteiro
zh_cn: status.writeBytes - 整数

source: A sample implementation of the Status callback,
ko: 상태 콜백의 샘플 구현
pt_br: Uma implementação de amostra do retorno de chamada de Status,
zh_cn: 状态回调的样本实现，

source: Once the status callback is added to the ApplicationClient, the processDeviceStatus() method is invoked whenever any device is connected or disconnected from Internet of Things Foundation that matches the criteria, The following snippet shows how to add the status call back instance into ApplicationClient,
ko: 상태 콜백이 ApplicationClient에 추가되면 디바이스가 기준에 맞는 Internet of Things Foundation에서 연결되거나 연결이 끊기는 경우 항상 processDeviceStatus() 메소드가 호출됩니다. 다음 스니펫은 ApplicationClient에 상태 콜백 인스턴스를 추가하는 방법을 보여줍니다.
pt_br: Uma vez que o status de retorno de chamada é incluído no ApplicationClient, o método processDeviceStatus() chamado sempre que qualquer dispositivo está conectado ou desconectado da Internet of Things Foundation que corresponde aos critérios, O fragmento a seguir mostra como incluir a instância de retorno de chamada de status no ApplicationClient,
zh_cn: 一旦将状态回调添加到 ApplicationClient，只要任何设备与匹配条件的 Internet of Things Foundation 连接或与之断开连接，就会调用 processDeviceStatus() 方法，以下片段显示了如何将状态回调实例添加到 ApplicationClient，
