Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: es, ja, pt_br, zh_cn, zh_tw

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a device action request from Internet of Things Foundation Connect.
es: El manejador creado se debe añadir a la instancia ManagedDevice para que la biblioteca de cliente ibmiotf invoque el método correspondiente cuando se produzca una solicitud de acción del dispositivo desde Internet of Things Foundation Connect.
ja: Internet of Things Foundation Connect からデバイス操作リクエストが出されたときに ibmiotf クライアント・ライブラリーが対応するメソッドを呼び出すように、作成されたハンドラーを ManagedDevice インスタンスに追加する必要があります。
pt_br: O manipulador criado deve ser incluído na instância ManagedDevice para que a biblioteca do cliente ibmiotf chame o método correspondente quando o Internet of Things Foundation Connect fizer uma solicitação de ação de dispositivo.
zh_cn: 已创建的处理程序需要添加到 ManagedDevice 实例，以便在收到来自“Internet of Things Foundation 连接”的设备操作请求时 ibmiotf 客户机库会调用相应的方法。
zh_tw: 已建立的處理程式需要新增至 ManagedDevice 實例，以便 ibmiotf 用戶端程式庫在「Internet of Things Foundation 連接」發出裝置動作要求時，呼叫對應的方法。

source: Refer to `this page <../device_mgmt/operations/device_actions.html>`__ for more information about the Device Action.
es: Consulte `esta página <../device_mgmt/operations/device_actions.html>`__ para obtener más información sobre la acción del dispositivo.
ja: デバイス・アクションについて詳しくは、`このページ <../device_mgmt/operations/device_actions.html>`__ を参照してください。
pt_br: Consulte `esta página <../device_mgmt/operations/device_actions.html>`__ para obter mais informações sobre a ação de dispositivo.
zh_cn: 有关设备操作的更多信息，请参阅 `本页面 <../device_mgmt/operations/device_actions.html>`__。
zh_tw: 如需「裝置動作」的相關資訊，請參閱 `此頁面 <../device_mgmt/operations/device_actions.html>`__。

source: Listen for Device attribute changes
es: Escuchar cambios de los atributos del dispositivo
ja: デバイス属性の変更の listen
pt_br: Atender às mudanças de atributo do dispositivo
zh_cn: 侦听设备属性更改
zh_tw: 接聽裝置屬性變更

source: This ibmiotf client library updates the corresponding objects whenever there is an update request from the Internet of Things Foundation Connect, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the Internet of Things Foundation Connect ReST API. Apart from updating these attributes, the library provides a mechanism where the device can be notified whenever a device attribute is updated.
es: Esta biblioteca de cliente ibmiotf actualiza los objetos correspondientes cuando se produce una solicitud de actualización desde Internet of Things Foundation Connect, estas solicitudes son iniciadas por la aplicación de manera directa o indirecta (Actualización de firmware) a través de la API ReST de Internet of Things Foundation Connect. Además de actualizar estos atributos, la biblioteca proporciona un mecanismo donde se puede notificar el dispositivo cuando se actualice un atributo del dispositivo.
ja: この ibmiotf クライアント・ライブラリーは、Internet of Things Foundation Connect からの更新リクエストがあったときに、対応するオブジェクトを更新します。これらの更新リクエストは、アプリケーションによって、直接的にまたは Internet of Things Foundation Connect ReST API 経由で間接的に (ファームウェア更新) 開始されます。ライブラリーは、これらの属性を更新するだけでなく、デバイス属性の更新時にデバイスに通知できるようにするための機構も提供します。
pt_br: Esta biblioteca do cliente ibmiotf atualiza os objetos correspondentes sempre que o Internet of Things Foundation Connect faz uma solicitação de atualização; essas solicitações de atualização são iniciadas pelo aplicativo direta ou indiretamente (atualização de firmware) por meio da API ReST do Internet of Things Foundation Connect. Além de atualizar esses atributos, a biblioteca fornece um mecanismo que permite que o dispositivo seja notificado sempre que um atributo do dispositivo for atualizado.
zh_cn: 该 ibmiotf 客户机库会在收到来自“Internet of Things Foundation 连接”的更新请求时更新相应的对象，这些更新请求是由应用程序直接启动，或通过“Internet of Things Foundation 连接”ReST API 间接（固件更新）启动的。除更新这些属性外，该库还提供一种机制，使设备能够在其属性已更新时得到通知。
zh_tw: 只要「Internet of Things Foundation 連接」發出更新要求，此 ibmiotf 用戶端程式庫便會更新對應的物件，這些更新要求由應用程式透過「Internet of Things Foundation 連接」ReST API，直接或間接（韌體更新）起始。除了更新這些屬性之外，程式庫所提供的機制還包含在更新裝置屬性時通知裝置。

source: Attributes that can be updated by this operation are location, metadata, device information and firmware.
es: Los atributos que se pueden actualizar mediante esta operación son: ubicación, metadatos, información de dispositivo y firmware.
ja: この操作によって更新できる属性は、ロケーション、メタデータ、デバイス情報およびファームウェアです。
pt_br: Os atributos que podem ser atualizados por essa operação são local, metadados, informações do dispositivo e firmware.
zh_cn: 此操作可以更新的属性有位置、元数据、设备信息和固件。
zh_tw: 可透過這項作業更新的屬性包含位置、meta 資料、裝置資訊及韌體。

source: In order to get notified, the device needs to add a property change listener on those objects that it is interested.
es: Para recibir la notificación, el dispositivo debe añadir un escucha de cambio de propiedades a los objetos deseados.
ja: 通知を受けるには、デバイスは、対象となるオブジェクトに対するプロパティー変更リスナーを追加する必要があります。
pt_br: Para ser notificado, o dispositivo precisa incluir um listener de mudança de propriedade nos objetos que são de seu interesse.
zh_cn: 要获取通知，设备需要对感兴趣的对象添加属性更改侦听器。
zh_tw: 為了取得通知，裝置需要在其感興趣的物件上，新增內容變更接聽器。

source: Also, the device needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
es: Además, el dispositivo debe implementar el método propertyChange() en donde reciba la notificación. A continuación, se incluye una implementación de muestra:
ja: また、デバイスは、通知を受け取る propertyChange() メソッドを実装する必要もあります。サンプル実装は、次のとおりです。
pt_br: Além disso, o dispositivo precisa implementar o método propertyChange(), usado para receber a notificação. A seguir é mostrada uma implementação de amostra:
zh_cn: 另外，设备还需要实现 propertyChange() 方法，在此接收通知。样本实现如下：
zh_tw: 此外，裝置也需要在其接收通知的位置，實作 propertyChange() 方法。實作範例如下所示：

source: Refer to `this page <../device_mgmt/operations/update.html>`__ for more information about updating the device attributes.
es: Consulte `esta página <../device_mgmt/operations/update.html>`__ para obtener más información sobre la actualización de los atributos del dispositivo.
ja: デバイス属性の更新について詳しくは、`このページ <../device_mgmt/operations/update.html>`__ を参照してください。
pt_br: Consulte `esta página <../device_mgmt/operations/update.html>`__ para obter mais informações sobre como atualizar os atributos do dispositivo.
zh_cn: 有关更新设备属性的更多信息，请参阅 `本页面 <../device_mgmt/operations/update.html>`__。
zh_tw: 如需更新裝置屬性的相關資訊，請參閱 `此頁面 <../device_mgmt/operations/update.html>`__。

source: Examples
es: Ejemplos
ja: 例
pt_br: Exemplos
zh_cn: 示例
zh_tw: 範例

source: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - A sample agent code that shows how to perform various device management operations on Raspberry Pi.
es: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Código de agente de muestra que indica cómo realizar varias operaciones de gestión del dispositivo en Raspberry Pi.
ja: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Raspberry Pi でさまざまなデバイス管理操作を実行する方法を示すサンプル・エージェント・コード。
pt_br: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Um código do agente de amostras que mostra como executar várias operações de gerenciamento de dispositivo no Raspberry Pi.
zh_cn: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - 显示如何在 Raspberry Pi 中执行各种设备管理操作的样本代理程序代码。
zh_tw: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - 代理程式程式碼範例，顯示如何在 Raspberry Pi 上執行各種裝置管理作業。

source: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - A sample code that shows how one can perform both device operations and management operations.
es: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Código de muestra que indica cómo llevar a cabo operaciones de gestión y operaciones del dispositivo .
ja: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - デバイス操作と管理操作の両方を実行する方法を示すサンプル・コード。
pt_br: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Um código de amostra que mostra como é possível executar operações de dispositivo e operações de gerenciamento.
zh_cn: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - 显示用户如何同时执行设备操作和管理操作的样本代码。
zh_tw: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - 範例程式碼，顯示如何同時執行裝置作業和管理作業。

source: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - A sample agent code with custom MqttAsyncClient.
es: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Código de agente de muestra con MqttAsyncClient personalizado.
ja: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - カスタム MqttAsyncClient を使用するサンプル・エージェント・コード。
pt_br: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Um código do agente de amostras com MqttAsyncClient customizado.
zh_cn: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - 包含定制 MqttAsyncClient 的样本代理程序代码。
zh_tw: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - 含有自訂 MqttAsyncClient 的代理程式程式碼範例。

source: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - A sample agent code with custom MqttClient.
es: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Código de agente de muestra con MqttClient personalizado.
ja: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - カスタム MqttClient を使用するサンプル・エージェント・コード。
pt_br: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Um código de agente de amostras com MqttClient customizado.
zh_cn: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - 包含定制 MqttClient 的样本代理程序代码。
zh_tw: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - 含有自訂 MqttClient 的代理程式程式碼範例。

source: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler for Raspberry Pi.
es: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Implementación de muestra de FirmwareHandler para Raspberry Pi.
ja: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Raspberry Pi の FirmwareHandler のサンプル実装。
pt_br: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Uma implementação de amostra de FirmwareHandler para Raspberry Pi.
zh_cn: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Raspberry Pi 的 FirmwareHandler 的样本实现。
zh_tw: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Raspberry Pi 的 FirmwareHandler 實作範例。

source: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler
es: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Implementación de muestra de DeviceActionHandler
ja: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - DeviceActionHandler のサンプル実装
pt_br: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Uma implementação de amostra de DeviceActionHandler
zh_cn: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - DeviceActionHandler 的样本实现
zh_tw: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - DeviceActionHandler 的實作範例

source: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - A sample that shows how to send regular manage request with lifetime specified.
es: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Ejemplo que muestra cómo enviar una solicitud de gestión normal con el tiempo de vida especificado.
ja: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - 存続期間を指定して定期的な管理リクエストを送信する方法を示すサンプル。
pt_br: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Uma amostra que mostra como enviar uma solicitação de gerenciamento regular com o tempo de vida especificado.
zh_cn: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - 显示如何发送指定了生命周期的常规管理请求的样本。
zh_tw: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - 顯示如何傳送已指定生命期限的一般管理要求範例。

source: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - A sample listener code that shows how to listen for a various device attribute changes .
es: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Código de escucha de muestra que indica cómo escuchar cambios de atributos del dispositivo .
ja: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - さまざまなデバイス属性の変更を listen する方法を示すサンプル・リスナー・コード。
pt_br: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Um código de listener de amostra que mostra como atender a várias mudanças de atributo do dispositivo.
zh_cn: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - 显示如何侦听各种设备属性变更的样本侦听器代码。
zh_tw: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - 顯示如何接聽各種裝置屬性變更的接聽器程式碼範例。

source: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - A sample that shows how to add ErrorCode without waiting for response from the server.
es: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Ejemplo que muestra cómo añadir el ErrorCode sin esperar respuesta del servidor.
ja: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - サーバーからのレスポンスを待機せずに ErrorCode を追加する方法を示すサンプル。
pt_br: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Uma amostra que mostra como incluir um ErrorCode sem esperar por uma resposta do servidor.
zh_cn: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - 显示如何无需等待服务器响应即可添加 ErrorCode 的样本。
zh_tw: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - 顯示如何新增 ErrorCode 而不需等待伺服器回應的範例。

source: Recipe
es: Receta
ja: レシピ
pt_br: Fórmula
zh_cn: 诀窍
zh_tw: 配方

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ that shows how to connect the Raspberry Pi device as managed device to Internet of Things Foundation Connect to perform various device management operations in step by step using this client library.
es: Consulte `la receta <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ que muestra cómo conectar el dispositivo Raspberry Pi como dispositivo gestionado a Internet of Things Foundation Connect para llevar a cabo varias operaciones de gestión del dispositivo paso a paso utilizando la biblioteca de cliente.
ja: Raspberry Pi デバイスを管理対象デバイスとして Internet of Things Foundation Connect に接続し、このクライアント・ライブラリーを使用してさまざまなデバイス管理操作を段階的に実行する方法を示す、`レシピ <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ を参照してください。
pt_br: Consulte `a fórmula <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ que mostra passo a passo como conectar o dispositivo Raspberry Pi ao Internet of Things Foundation Connect como um dispositivo gerenciado para executar várias operações de gerenciamento de dispositivo usando essa biblioteca do cliente.
zh_cn: 请参阅 `诀窍 <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__，其中显示了如何将 Raspberry Pi 设备作为受管设备连接到“Internet of Things Foundation 连接”，以使用该客户机库逐步执行各种设备管理操作。
zh_tw: 請參閱 `配方 <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__，其顯示如何將作為受管理裝置的 Raspberry Pi 裝置連接至「Internet of Things Foundation 連接」，以使用此用戶端程式庫，逐步執行各種裝置管理作業。

source: Java Client Library - Managed Devices
ja: Java クライアント・ライブラリー - 管理対象デバイス
