Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: es, ja, pt_br, zh_cn, zh_tw

source: As the manage request informs the Internet of Things Foundation Connect about the firmware action support, manage() method needs to be called right after setting the firmware action support.
es: Dado que la solicitud de gestión informa a Internet of Things Foundation Connect sobre el soporte de la acción de firmware, tras configurar el soporte de dicha acción se debe invocar el método manage().
ja: 管理リクエストはファームウェア操作サポートについて Internet of Things Foundation Connect に通知するので、ファームウェア操作サポートを設定した直後に manage() メソッドを呼び出す必要があります。
pt_br: Quando a solicitação de gerenciamento informa o Internet of Things Foundation Connect sobre o suporte da ação de firmware, o método manage() precisa ser chamado logo após a configuração do suporte da ação de firmware.
zh_cn: 在管理请求向“Internet of Things Foundation 连接”发送有关固件操作支持的信息时，需要在设置固件操作支持后立即调用 manage() 方法。
zh_tw: 當管理要求通知「Internet of Things Foundation 連接」有關韌體動作支援時，需在設定韌體動作支援之後，立即呼叫 manage() 方法。

source: **3. Create the Firmware Action Handler**
es: **3. Crear el manejador de acciones de firmware**
ja: **3. ファームウェア操作ハンドラーの作成**
pt_br: **3. Criar o manipulador de ações de firmware**
zh_cn: **3. 创建固件操作处理程序**
zh_tw: **3. 建立韌體動作處理程式**

source: In order to support the Firmware action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
es: Para soportar la acción de firmware, el dispositivo debe crear un manejador y añadirlo a ManagedDevice. El manejador debe ampliar una clase DeviceFirmwareHandler e implementar los métodos siguientes:
ja: ファームウェア操作をサポートするために、デバイスでハンドラーを作成し、それを ManagedDevice に追加する必要があります。ハンドラーは DeviceFirmwareHandler クラスを拡張し、以下のメソッドを実装する必要があります。
pt_br: Para suportar a ação de firmware, o dispositivo precisa criar um manipulador e incluí-lo em ManagedDevice. O manipulador deve ampliar uma classe DeviceFirmwareHandler e implementar os seguintes métodos:
zh_cn: 为了支持固件操作，设备需要创建一个处理程序并将其添加到 ManagedDevice。该处理程序必须扩展 DeviceFirmwareHandler 类并实现以下方法：
zh_tw: 為了支援「韌體」動作，裝置需要建立一個處理程式，並將其新增至 ManagedDevice。處理程式必須擴充 DeviceFirmwareHandler 類別，並實作下列方法：

source: **3.1 Sample implementation of downloadFirmware**
es: **3.1 Implementación de muestra de downloadFirmware**
ja: **3.1 downloadFirmware のサンプル実装**
pt_br: **3.1 Implementação de amostra de downloadFirmware**
zh_cn: **3.1 downloadFirmware 的样本实现**
zh_tw: **3.1 downloadFirmware 實作範例**

source: The implementation must add logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
es: La implementación debe añadir una lógica al firmware e informar sobre el estado de la descarga a través del objeto DeviceFirmware. Si la operación Descarga de firmware se realiza correctamente, el estado del firmware se definirá en DOWNLOADED y UpdateStatus deberá definirse en SUCCESS.
ja: 実装では、ファームウェアをダウンロードして DeviceFirmware オブジェクト経由でダウンロードの状況を報告するロジックを追加する必要があります。ファームウェア・ダウンロード操作が正常に完了した場合、ファームウェアの状態を DOWNLOADED に設定する必要があり、UpdateStatus を SUCCESS に設定する必要があります。
pt_br: A implementação deve incluir uma lógica para fazer download do firmware e relatar o status do download por meio do objeto DeviceFirmware. Se a operação de download do firmware for bem-sucedida, o estado do firmware será configurado como DOWNLOADED e UpdateStatus será configurado como SUCCESS.
zh_cn: 该实现必须添加用于下载固件的逻辑，并且通过 DeviceFirmware 对象报告下载的状态。如果“固件下载”操作成功，那么固件的状态将会设置为 DOWNLOADED，UpdateStatus 应设置为 SUCCESS。
zh_tw: 實作必須新增邏輯以下載韌體，並透過 DeviceFirmware 物件報告下載的狀態。如果「韌體下載」作業順利完成，則韌體的狀態會設為 DOWNLOADED，而 UpdateStatus 應設為 SUCCESS。

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
es: Si se produce un error durante la Descarga de firmware, el estado deberá definirse en IDLE y updateStatus se debe definir en uno de los valores de estado de error:
ja: ファームウェア・ダウンロード中にエラーが発生した場合、状態を IDLE に設定する必要があり、updateStatus が以下のエラー状態値のいずれかになるように設定する必要があります。
pt_br: Caso ocorra um erro durante o download do firmware, o estado deve ser configurado como IDLE e updateStatus deve ser configurado como um dos valores de status de erro:
zh_cn: 如果“固件下载”期间出错，那么 state 应当设置为 IDLE，updateStatus 应当设置为以下某个错误状态值：
zh_tw: 如果「韌體下載」期間發生錯誤，則狀態應設為 IDLE，而 updateStatus 應設為其中一個錯誤狀態值：

source: A sample Firmware Download implementation for a Raspberry Pi device is shown below:
es: A continuación se incluye una muestra de implementación de la Descarga de firmware del dispositivo Raspberry Pi:
ja: Raspberry Pi デバイスのファームウェア・ダウンロードのサンプル実装を以下に示します。
pt_br: Uma amostra da implementação de download de firmware para um dispositivo Raspberry Pi é mostrada abaixo:
zh_cn: 下面显示了用于 Raspberry Pi 设备的样本“固件下载”实现：
zh_tw: 下方顯示 Raspberry Pi 裝置的「韌體下載」實作範例：

source: Device can check the integrity of the downloaded firmware image using the verifier and report the status back to Internet of Things Foundation Connect. The verifier can be set by the device during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
es: El dispositivo puede comprobar la integridad de la imagen del firmware descargado utilizando el verificador e informar sobre el estado a Internet of Things Foundation Connect. El verificador puede ser definido por el dispositivo durante el inicio (al crear el objeto DeviceFirmware) o como parte de la solicitud de Descarga de firmware de la aplicación. A continuación de indica un código de muestra para realizar la verificación:
ja: デバイスは、ベリファイヤーを使用してダウンロード済みファームウェア・イメージの整合性を検査できます。また、その状況を Internet of Things Foundation Connect に報告することができます。ベリファイヤーは、デバイスの開始時 (DeviceFirmware オブジェクトの作成中) にデバイスで設定することもできますし、アプリケーションでファームウェア・ダウンロード・リクエストの一部として設定することもできます。同一性を検証するサンプル・コードを以下に示します。
pt_br: O dispositivo pode verificar a integridade da imagem de firmware transferida por download usando o verificador e relatar o status para o Internet of Things Foundation Connect. O verificador pode ser configurado pelo dispositivo durante a inicialização (ao criar o objeto DeviceFirmware) ou como parte da solicitação de download de firmware feita pelo aplicativo. A seguir é mostrado um código de amostra para fazer essa verificação:
zh_cn: 设备可使用验证器检查已下载固件映像的完整性，并将状态报告给“Internet of Things Foundation 连接”。验证器可由设备在启动期间（创建 DeviceFirmware 对象时）设置，也可以作为“下载固件”请求的组成部分由应用程序设置。用于验证是否一致的样本代码如下：
zh_tw: 裝置可使用驗證器來檢查已下載韌體映像檔的完整性，並將狀態報告回「Internet of Things Foundation 連接」。驗證器可由裝置在啟動期間（建立「DeviceFirmware 物件」時）進行設定，或者由應用程式當作「下載韌體」要求的一部分進行設定。驗證相同的範例程式碼如下：

source: The complete code can be found in the device management sample `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
es: El código completo se puede encontrar en el ejemplo de gestión de dispositivo `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
ja: コード全体は、デバイス管理サンプル `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ にあります。
pt_br: O código completo pode ser encontrado na amostra de gerenciamento de dispositivo `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
zh_cn: 完整的代码可在设备管理样本 `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__中找到。
zh_tw: 完整的程式碼位於裝置管理範例 `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__。

source: **3.2 Sample implementation of updateFirmware**
es: **3.2 Implementación de muestra de updateFirmware**
ja: **3.2 updateFirmware のサンプル実装**
pt_br: **3.2 Implementação de amostra de updateFirmware**
zh_cn: **3.2 updateFirmware 的样本实现**
zh_tw: **3.2 updateFirmware 實作範例**

source: The implementation must add logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
es: La implementación debe añadir una lógica para instalar el firmware descargado e informar sobre el estado de la actualización a través del objeto DeviceFirmware. Si la operación Actualización de firmware se realiza correctamente, el estado del firmware se definirá en IDLE y UpdateStatus deberá definirse en SUCCESS.
ja: 実装では、ダウンロードされたファームウェアをインストールして DeviceFirmware オブジェクト経由で更新の状況を報告するロジックを追加する必要があります。ファームウェア更新操作が正常に完了した場合、ファームウェアの状態を IDLE に設定する必要があり、UpdateStatus を SUCCESS に設定する必要があります。
pt_br: A implementação deve incluir uma lógica para instalar o firmware transferido por download e relatar o status da atualização por meio do objeto DeviceFirmware. Se a operação de atualização de firmware for bem-sucedida, o status do firmware deve ser configurado como IDLE e UpdateStatus deve ser configurado como SUCCESS.
zh_cn: 该实现必须添加用于安装已下载固件的逻辑，并且通过 DeviceFirmware 对象报告更新的状态。如果“固件更新”操作成功，那么固件的状态应当设置为 IDLE，UpdateStatus 应当设置为 SUCCESS。
zh_tw: 實作必須新增邏輯以安裝已下載的韌體，並透過 DeviceFirmware 物件報告更新的狀態。如果「韌體更新」作業順利完成，則韌體的狀態應設為 IDLE，而 UpdateStatus 應設為 SUCCESS。

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
es: Si se produce un error durante la Actualización de firmware, updateStatus se debe definir en uno de los valores de estado de error:
ja: ファームウェア更新中にエラーが発生した場合、updateStatus が以下のエラー状態値のいずれかになるように設定する必要があります。
pt_br: Caso ocorra um erro durante a atualização de firmware, updateStatus deve ser configurado com um dos valores de status de erro:
zh_cn: 如果“固件更新”期间出错，那么 updateStatus 应当设置为以下某个错误状态值：
zh_tw: 如果「韌體更新」期間發生錯誤，則 updateStatus 應設為其中一個錯誤狀態值：

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
es: A continuación se incluye una muestra de implementación de la Actualización de firmware del dispositivo Raspberry Pi:
ja: Raspberry Pi デバイスのファームウェア更新のサンプル実装を以下に示します。
pt_br: Uma amostra da implementação de atualização de firmware para um dispositivo Raspberry Pi é mostrada abaixo:
zh_cn: Raspberry Pi 设备的样本“固件更新”实现如下所示：
zh_tw: 下面顯示 Raspberry Pi 裝置的「韌體更新」實作範例：

source: **4. Add the handler to ManagedDevice**
es: **4. Añadir el manejador a ManagedDevice**
ja: **4. ManagedDevice へのハンドラーの追加**
pt_br: **4. Incluir o manipulador em ManagedDevice**
zh_cn: **4. 向 ManagedDevice 添加处理程序**
zh_tw: **4. 新增處理程式至 ManagedDevice**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a Firmware action request from Internet of Things Foundation Connect.
es: El manejador creado se debe añadir a la instancia ManagedDevice para que la biblioteca de cliente ibmiotf invoque el método correspondiente cuando se produzca una solicitud de acción de firmware desde Internet of Things Foundation Connect.
ja: Internet of Things Foundation Connect からファームウェア操作リクエストが出されたときに ibmiotf クライアント・ライブラリーが対応するメソッドを呼び出すように、作成されたハンドラーを ManagedDevice インスタンスに追加する必要があります。
pt_br: O manipulador criado deve ser incluído na instância ManagedDevice para que a biblioteca do cliente ibmiotf chame o método correspondente quando o Internet of Things Foundation Connect fizer uma solicitação de ação de firmware.
zh_cn: 已创建的处理程序需要添加到 ManagedDevice 实例，以便在收到来自“Internet of Things Foundation 连接”的固件操作请求时 ibmiotf 客户机库会调用相应的方法。
zh_tw: 已建立的處理程式需要新增至 ManagedDevice 實例，以便 ibmiotf 用戶端程式庫在「Internet of Things Foundation 連接」發出「韌體」動作要求時，呼叫對應的方法。

source: Refer to `this page <../device_mgmt/operations/firmware_actions.html>`__ for more information about the Firmware action.
es: Consulte `esta página <../device_mgmt/operations/firmware_actions.html>`__ para obtener más información sobre la acción de firmware.
ja: ファームウェア操作について詳しくは、`このページ <../device_mgmt/operations/firmware_actions.html>`__ を参照してください。
pt_br: Consulte `esta página <../device_mgmt/operations/firmware_actions.html>`__ para obter mais informações sobre a ação de firmware.
zh_cn: 有关固件操作的更多信息，请参阅 `本页面 <../device_mgmt/operations/firmware_actions.html>`__。
zh_tw: 如需「韌體」動作的相關資訊，請參閱 `此頁面 <../device_mgmt/operations/firmware_actions.html>`__。

source: Device Actions
es: Acciones de dispositivo
ja: デバイス操作
pt_br: Ações do dispositivo
zh_cn: 设备操作
zh_tw: 裝置動作

source: The Internet of Things Foundation Connect supports the following device actions:
es: Internet of Things Foundation Connect soporta las siguientes acciones de dispositivos:
ja: Internet of Things Foundation Connect は、以下のデバイス操作をサポートしています。
pt_br: O Internet of Things Foundation Connect suporta as seguintes ações do dispositivo:
zh_cn: “Internet of Things Foundation 连接”支持以下设备操作：
zh_tw: 「Internet of Things Foundation 連接」支援下列裝置動作：

source: Reboot
es: Reinicio
ja: リブート
pt_br: Reinicialização
zh_cn: 重新引导
zh_tw: 重新開機

source: Factory Reset
es: Restablecimiento de fábrica
ja: ファクトリー・リセット
pt_br: Reconfiguração de Fábrica
zh_cn: 恢复工厂设置
zh_tw: 重設為原廠設定

source: The device needs to do the following activities to support Device Actions:
es: Para soportar las acciones del dispositivo, el dispositivo debe llevar a cabo las siguientes actividades:
ja: デバイスは、デバイス操作をサポートするために次のアクティビティーを行う必要があります。
pt_br: O dispositivo precisa executar as seguintes atividades para suportar ações do dispositivo:
zh_cn: 设备需要完成以下活动来支持设备操作：
zh_tw: 裝置需要執行下列活動，才能支援「裝置動作」：

source: **1. Inform server about the Device Actions support**
es: **1. Informar al servidor sobre el soporte de las acciones del dispositivo**
ja: **1. サーバーへのデバイス操作サポートの通知**
pt_br: **1. Informar o servidor sobre o suporte para ações de dispositivo**
zh_cn: **1. 向服务器发送有关设备操作支持的信息**
zh_tw: **1. 通知伺服器有關「裝置動作」支援**

source: In order to perform Reboot and Factory Reset, the device needs to inform the Internet of Things Foundation Connect about its support first. This can achieved by invoking a following method with a boolean value:
es: Para realizar el Rearranque y Restablecimiento de fábrica, antes el dispositivo debe informar a Internet of Things Foundation Connect sobre el soporte. Para ello se puede invocar el siguiente método con un valor booleano:
ja: リブートおよびファクトリー・リセットを実行するには、デバイスはまずそのサポート状況について Internet of Things Foundation Connect に通知する必要があります。これは、ブール値を指定して以下のメソッドを呼び出すことによって行えます。
pt_br: Para executar a reinicialização e a reconfiguração de fábrica, o dispositivo precisa primeiro informar o Internet of Things Foundation Connect sobre seu suporte. Isso pode ser feito chamando o método a seguir com um valor booleano:
zh_cn: 为了执行重新引导和恢复出厂设置操作，设备需要首先向“Internet of Things Foundation 连接”发送有关其支持的信息。可通过调用以下具有布尔值的方法来实现：
zh_tw: 為了執行「重新開機」和「重設為原廠設定」，裝置需要先通知「Internet of Things Foundation 連接」有關其支援。以布林值呼叫下列方法，便可達成此作業：

source: As the manage request informs the Internet of Things Foundation Connect about the device action support, manage() method needs to be called right after setting the device action support.
es: Dado que la solicitud de gestión informa a Internet of Things Foundation Connect sobre el soporte de la acción del dispositivo, tras configurar el soporte de dicha acción se debe invocar el método manage().
ja: 管理リクエストはデバイス操作サポートについて Internet of Things Foundation Connect に通知するので、デバイス操作サポートを設定した直後に manage() メソッドを呼び出す必要があります。
pt_br: Quando a solicitação de gerenciamento informa o Internet of Things Foundation Connect sobre o suporte da ação de dispositivo, o método manage() precisa ser chamado logo após a configuração do suporte da ação de dispositivo.
zh_cn: 在管理请求向“Internet of Things Foundation 连接”发送有关设备操作支持的信息时，需要在设置设备操作支持后立即调用 manage() 方法。
zh_tw: 當管理要求通知「Internet of Things Foundation 連接」有關裝置動作支援時，需要在設定裝置動作支援之後，立即呼叫 manage() 方法。

source: **2. Create the Device Action Handler**
es: **2. Crear el manejador de acciones del dispositivo**
ja: **2. デバイス操作ハンドラーの作成**
pt_br: **2. Criar o manipulador de ações de dispositivo**
zh_cn: **2. 创建设备操作处理程序**
zh_tw: **2. 建立裝置動作處理程式**

source: In order to support the device action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
es: Para soportar la acción del dispositivo, el dispositivo debe crear un manejador y añadirlo a ManagedDevice. El manejador debe ampliar una clase DeviceActionHandler e implementar los métodos siguientes:
ja: デバイス操作をサポートするために、デバイスでハンドラーを作成し、それを ManagedDevice に追加する必要があります。ハンドラーは DeviceActionHandler クラスを拡張し、以下のメソッドを実装する必要があります。
pt_br: Para suportar a ação de dispositivo, o dispositivo precisa criar um manipulador e incluí-lo em ManagedDevice. O manipulador deve ampliar uma classe DeviceActionHandler e fornecer a implementação dos seguintes métodos:
zh_cn: 为了支持设备操作，设备需要创建一个处理程序并将其添加到 ManagedDevice。该处理程序必须扩展 DeviceActionHandler 类并实现以下方法：
zh_tw: 為了支援裝置動作，裝置需要建立一個處理程式，並將其新增至 ManagedDevice。處理程式必須擴充 DeviceActionHandler 類別，並提供下列方法的實作：

source: **2.1 Sample implementation of handleReboot**
es: **2.1 Implementación de muestra de handleReboot**
ja: **2.1 handleReboot のサンプル実装**
pt_br: **2.1 Implementação de amostra de handleReboot**
zh_cn: **2.1 handleReboot 的样本实现**
zh_tw: **2.1 handleReboot 的實作範例**

source: The implementation must add a logic to reboot the device and report the status of the reboot via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because the successful operation reboots the device and the device code will not have a control to update the Internet of Things Foundation Connect). A sample reboot implementation for a Raspberry Pi device is shown below:
es: La implementación debe añadir una lógica para rearrancar el dispositivo e informar sobre el estado del rearranque a través del objeto DeviceAction. El dispositivo debe actualizar el estado junto con un mensaje opcional sólo cuando se produzca un error (ya que la operación correcta rearranca el dispositivo y el código del dispositivo no tendrá control para actualizar Internet of Things Foundation Connect). A continuación se incluye una muestra de implementación de rearranque para el dispositivo Raspberry Pi:
ja: 実装では、デバイスをリブートして DeviceAction オブジェクト経由でリブートの状況を報告するロジックを追加する必要があります。デバイスは、失敗した場合にのみ、状況を更新してオプションでメッセージを出す必要があります (操作が成功した場合、デバイスはリブートされ、デバイス・コードは Internet of Things Foundation Connect を更新するための制御権を持たないからです)。Raspberry Pi デバイスのリブートのサンプル実装を以下に示します。
pt_br: A implementação deve incluir uma lógica para reinicializar o dispositivo e relatar o status da reinicialização por meio do objeto DeviceAction. O dispositivo precisa atualizar o status, juntamente com uma mensagem opcional, apenas quando há uma falha (porque a operação bem-sucedida reinicializa o dispositivo e o código do dispositivo não terá um controle para atualizar o Internet of Things Foundation Connect). Uma amostra da implementação de reinicialização para um dispositivo Raspberry Pi é mostrada abaixo:
zh_cn: 该实现必须添加用于重新引导设备的逻辑，并且通过 DeviceAction 对象报告重新引导的状态。仅当发生故障时设备才需要更新状态以及可选消息（因为成功的操作会重新引导设备，且设备代码不会有所控制以更新“Internet of Things Foundation 连接”）。下面显示了 Raspberry Pi 设备的样本重新引导实现：
zh_tw: 實作必須新增邏輯以重新啟動裝置，並透過 DeviceAction 物件報告重新開機的狀態。只有在失敗（因為順利完成的作業重新啟動裝置，但裝置程式碼沒有控制項可以更新「Internet of Things Foundation 連接」）時，裝置才需要更新狀態以及選用訊息。下面顯示 Raspberry Pi 裝置的重新開機實作範例：

source: The complete code can be found in the device management sample `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
es: El código completo se puede encontrar en el ejemplo de gestión de dispositivo `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
ja: コード全体は、デバイス管理サンプル `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ にあります。
pt_br: O código completo pode ser encontrado na amostra de gerenciamento de dispositivo `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
zh_cn: 完整的代码可在设备管理样本 `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__中找到。
zh_tw: 完整的程式碼位於裝置管理範例 `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__。

source: **2.2 Sample implementation of handleFactoryReset**
es: **2.2 Implementación de muestra de handleFactoryReset**
ja: **2.2 handleFactoryReset のサンプル実装**
pt_br: **2.2 Implementação de amostra de handleFactoryReset**
zh_cn: **2.2 handleFactoryReset 的样本实现**
zh_tw: **2.2 handleFactoryReset 的實作範例**

source: The implementation must add a logic to reset the device to factory settings and report the status via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because as part of this process, the device reboots and the device will not have a control to update status to Internet of Things Foundation Connect). The skeleton of the Factory Reset implementation is shown below:
es: La implementación debe añadir una lógica para restablecer los valores de fábrica del dispositivo e informar sobre el estado a través del objeto DeviceAction. El dispositivo debe actualizar el estado junto con un mensaje opcional sólo cuando se produzca un error (ya que la operación correcta rearranca el dispositivo y el código del dispositivo no tendrá control para actualizar el estado de Internet of Things Foundation Connect). A continuación se muestra un resumen de la implementación del restablecimiento de los valores de fábrica:
ja: 実装では、デバイスを工場出荷時設定にリセットして DeviceAction オブジェクト経由で状況を報告するロジックを追加する必要があります。デバイスは、失敗した場合にのみ、状況を更新してオプションでメッセージを出す必要があります (このプロセスの一部としてデバイスはリブートし、デバイスは状況を Internet of Things Foundation Connect で更新するための制御権を持たないからです)。ファクトリー・リセット実装のスケルトンを以下に示します。
pt_br: A implementação deve incluir uma lógica para reconfigurar o dispositivo para as configurações de fábrica e relatar o status por meio do objeto DeviceAction. O dispositivo precisa atualizar o status, juntamente com uma mensagem opcional, apenas quando há uma falha (porque, como parte desse processo, o dispositivo é reinicializado e não terá um controle para atualizar o status do Internet of Things Foundation Connect). A estrutura básica da implementação da reconfiguração de fábrica é mostrada abaixo:
zh_cn: 该实现必须添加用于将设备恢复为出厂设置的逻辑，并且通过 DeviceAction 对象报告状态。仅当发生故障时设备才需要更新状态以及可选消息（因为作为该过程的一部分，设备将重新引导并且不会有所控制以更新“Internet of Things Foundation 连接”的状态）。下面显示了“恢复出厂设置”实现的框架：
zh_tw: 實作必須新增邏輯，將裝置重設為原廠設定，並透過 DeviceAction 物件報告狀態。只有在失敗（因為在此處理程序過程中，裝置重新啟動，但裝置沒有控制項可以向「Internet of Things Foundation 連接」更新狀態）時，裝置才需要更新狀態以及選用訊息。「重設為原廠設定」實作的架構如下所示：

source: **3. Add the handler to ManagedDevice**
es: **3. Añadir el manejador a ManagedDevice**
ja: **3. ManagedDevice へのハンドラーの追加**
pt_br: **3. Incluir o manipulador em ManagedDevice**
zh_cn: **3. 向 ManagedDevice 添加处理程序**
zh_tw: **3. 新增處理程式至 ManagedDevice**
