Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_cli_app.po
Languages: ko, pt_br, zh_cn

source: As similar to device status, the application can subscribe to any other application connect or disconnect status as well. Following code snippet shows how to subscribe to the application status in the organization:
ko: 디바이스 상태와 유사하게 애플리케이션은 기타 애플리케이션 연결 또는 연결 끊기 상태도 구독할 수 있습니다. 코드 스니펫을 따르면 조직에서 애플리케이션 상태를 구독하는 방법을 보여줍니다.
pt_br: Semelhante ao status de dispositivo, o aplicativo também pode assinar qualquer outro status de aplicativo como conectar ou desconectar. O fragmento de código a seguir mostra como assinar o status do aplicativo na organização:
zh_cn: 与设备状态类似，应用程序也可以预订其他任何应用程序的连接或断开连接状态。以下代码片段显示了如何预订组织内的应用程序状态：

source: Overloaded method is available to control the status subscription to a particular application. The processApplicationStatus() method is called whenever any application is connected or disconnected from Internet of Things Foundation that matches the criteria.
ko: 특정한 애플리케이션에 대한 상태 구독을 제어하는 데 과부하된 메소드를 사용할 수 있습니다. 애플리케이션이 기준에 맞는 Internet of Things Foundation에서 연결되거나 연결이 끊기는 경우 항상 processApplicationStatus() 메소드가 호출됩니다.
pt_br: O método sobrecarregado está disponível para controlar o status de assinatura para um aplicativo específico. O método processApplicationStatus() é chamado sempre que qualquer aplicativo estiver conectado ou desconectado da Internet of Things Foundation que corresponde aos critérios.
zh_cn: 重载方法可用于控制特定应用程序的状态预订。只要任何应用程序与匹配条件的 Internet of Things Foundation 连接或与之断开连接，就会调用 processDeviceStatus() 方法。

source: Publishing events from devices
ko: 디바이스의 이벤트 공개
pt_br: Publicando eventos a partir de dispositivos
zh_cn: 发布来自设备的事件

source: Applications can publish events as if they originated from a Device.
ko: 애플리케이션은 디바이스에서 시작된 것처럼 이벤트를 공개할 수 있습니다.
pt_br: Os aplicativos podem publicar eventos como se eles se originassem em um Dispositivo.
zh_cn: 应用程序可以将事件视为来自设备一样进行发布。

source: Publish events using HTTP(s)
ko: HTTP(s)를 통한 이벤트 공개
pt_br: Publicar eventos utilizando HTTP(s)
zh_cn: 使用 HTTP(s) 发布事件

source: Apart from MQTT, the application can publish device events to IBM Internet of Things Foundation using HTTP(s) by following 3 simple steps,
ko: MQTT 외에는 애플리케이션이 다음 3개의 간단한 단계에 따라 HTTP(s)를 통해 IBM Internet of Things Foundation에 디바이스 이벤트를 공개할 수 있습니다.
pt_br: Além de MQTT, o aplicativo pode publicar eventos de dispositivo para o IBM Internet of Things Foundation usando HTTP(s) seguindo 3 etapas simples,
zh_cn: 除了 MQTT 之外，应用程序可以通过以下 3 个简单步骤使用 HTTP(s) 将设备事件发布到 IBM Internet of Things Foundation。

source: Construct the ApplicationClient instance using the properties file
ko: 특성 파일을 통한 ApplicationClient 인스턴스 생성
pt_br: Construa a instância ApplicationClient utilizando o arquivo de propriedades
zh_cn: 使用属性文件构造 ApplicationClient 实例

source: Construct the event that needs to be published
ko: 공개되어야 하는 이벤트 생성
pt_br: Construa o evento que precisa ser publicado
zh_cn: 构造需要发布的事件

source: Specify the event name, Device Type, Device ID and publish the event using publishEventOverHTTP() method as follows,
ko: 이벤트 이름, 디바이스 유형, 디바이스 ID를 지정하고 다음과 같이 publishEventOverHTTP() 메소드를 통해 이벤트를 공개하십시오.
pt_br: Especifique o nome do evento, Tipo de Dispositivo, ID do dispositivo e publique o evento utilizando o método publishEventOverHTTP(), conforme a seguir,
zh_cn: 指定事件名称、设备类型和设备标识，并按照如下所示使用 publishEventOverHTTP() 方法发布事件，

source: The complete code can be found in the application example `HttpApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/HttpApplicationDeviceEventPublish.java>`__
ko: 전체 코드는 애플리케이션 예제 `HttpApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/HttpApplicationDeviceEventPublish.java>`__에서 찾을 수 있습니다.
pt_br: O código completo pode ser encontrado no exemplo de aplicativo `HttpApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/HttpApplicationDeviceEventPublish.java>`__
zh_cn: 完整的代码可在应用程序示例 `HttpApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/HttpApplicationDeviceEventPublish.java>`__ 中找到

source: Based on the settings in the properties file, the publishEventOverHTTP() method either publishes the event in Quickstart or in Registered flow. When the Organization ID mentioned in the properties file is quickstart, publishEventOverHTTP() method publishes the event to Internet of Things Foundation quickstart service and publishes the event in plain HTTP format. But when valid registered organization is mentioned in the properties file, this method always publishes the event in HTTPS (HTTP over SSL), so all the communication is secured.
ko: 특성 파일의 설정에 기반하여 publishEventOverHTTP() 메소드가 Quickstart 또는 등록된 플로우에서 이벤트를 공개합니다. 특성 파일에 언급된 조직 ID가 quickstart이면 publishEventOverHTTP() 메소드가 Internet of Things Foundation quickstart 서비스에 이벤트를 공개하고 일반 HTTP 형식으로 이벤트를 공개합니다. 그러나 유효한 등록된 조직이 특성 파일에 언급된 경우 이 메소드는 항상 HTTPS(HTTP over SSL)로 이벤트를 공개하여 모든 통신이 안전합니다.
pt_br: Com base nas configurações no arquivo de propriedades, o método publishEventOverHTTP() ou publica o evento registrado no fluxo ou na Iniciação Rápida. Quando o ID da Organização mencionado no arquivo de propriedades é de iniciação rápida, o método publishEventOverHTTP() publica o evento para o serviço de inicialização rápida do Internet of Things Foundation e publica o evento em formato HTTP simples. Mas quando uma organização registrada válida é mencionada no arquivo de propriedades, esse método sempre publica o evento em HTTPS (HTTP sobre SSL), de forma que toda a comunicação é protegida.
zh_cn: 根据属性文件中的设置，publishEventOverHTTP() 方法会在 Quickstart 或已注册流程中发布事件。如果属性文件中提到的组织标识为 quickstart，publishEventOverHTTP() 方法会将事件发布到 Internet of Things Foundation quickstart 服务，并以普通 HTTP 格式发布此事件。但在属性文件中提到有效的已注册组织时，此方法始终会以 HTTPS（基于 SSL 的 HTTP）发布事件，因此所有通信均受到保护。

source: The event in HTTP(s) is published at most once Quality of Service, so the application needs to implement the retry logic when there is an error.
ko: HTTP(s)의 이벤트는 최대 한 번 서비스 품질(QoS)이 공개되므로 오류 발생 시 애플리케이션이 재시도 논리를 구현해야 합니다.
pt_br: O evento em HTTP(s) é publicado no máximo uma vez no Quality of Service, portanto, o aplicativo precisa implementar a lógica de nova tentativa quando houver um erro.
zh_cn: 采用 HTTP(s) 的事件最多发布一次（服务质量），因此出现错误时，应用程序需要实现重试逻辑。

source: Publishing commands to devices
ko: 디바이스에 명령 공개
pt_br: Publicando comandos para dispositivos
zh_cn: 将命令发布到设备

source: Applications can publish commands to connected devices.
ko: 애플리케이션은 연결된 디바이스에 명령을 공개할 수 있습니다.
pt_br: Os aplicativos podem publicar comandos para dispositivos conectados.
zh_cn: 应用程序可将命令发布到所连接的设备。

source: Examples
ko: 예제
pt_br: Exemplos
zh_cn: 示例

source: `MQTTApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/MQTTApplicationDeviceEventPublish.java>`__ - A sample application that shows how to publish device events.
ko: `MQTTApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/MQTTApplicationDeviceEventPublish.java>`__ - 디바이스 이벤트를 공개하는 방법을 보여주는 샘플 애플리케이션
pt_br: `MQTTApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/MQTTApplicationDeviceEventPublish.java>`__ - Um aplicativo de amostra que mostra como publicar eventos de dispositivos.
zh_cn: `MQTTApplicationDeviceEventPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/MQTTApplicationDeviceEventPublish.java>`__ - 显示如何发布设备事件的样本应用程序。

source: `RegisteredApplicationCommandPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationCommandPublish.java>`__ - A sample application that shows how to publish a command to a device.
ko: `RegisteredApplicationCommandPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationCommandPublish.java>`__ - 디바이스에 명령을 공개하는 방법을 보여주는 샘플 애플리케이션
pt_br: RegisteredApplicationCommandPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationCommandPublish.java>`__ - Um aplicativo de amostra que mostra como publicar um comando para um dispositivo.
zh_cn: `RegisteredApplicationCommandPublish <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationCommandPublish.java>`__ - 显示如何向设备发布命令的样本应用程序。

source: `RegisteredApplicationSubscribeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationSubscribeSample.java>`__ - A sample application that shows how to subscribe for various events like, device events, device commands, device status and application status.
ko: `RegisteredApplicationSubscribeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationSubscribeSample.java>`__ - 디바이스 이벤트, 디바이스 명령, 디바이스 상태 및 애플리케이션 상태와 같이 여러 이벤트에 대해 구독하는 방법을 보여주는 샘플 애플리케이션
pt_br: `RegisteredApplicationSubscribeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationSubscribeSample.java>`__ - Um aplicativo de amostra que mostra como assinar para vários eventos como, os eventos de dispositivo, os comandos do dispositivo, o status do dispositivo e o status do aplicativo.
zh_cn: `RegisteredApplicationSubscribeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/RegisteredApplicationSubscribeSample.java>`__ - 显示如何预订多种事件（如设备事件、设备命令、设备状态和应用程序状态）的样本应用程序。

source: `SharedSubscriptionSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/SharedSubscriptionSample.java>`__ - A sample application that shows how to build a scalable application which will load balance messages across multiple instances of the application.
ko: `SharedSubscriptionSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/SharedSubscriptionSample.java>`__ - 애플리케이션의 여러 인스턴스 간에 메시지를 로드밸런싱하는 확장 가능 애플리케이션을 빌드하는 방법을 보여주는 샘플 애플리케이션
pt_br: `SharedSubscriptionSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/SharedSubscriptionSample.java>`__ - Um aplicativo de amostra que demonstra como construir um aplicativo escalável que faz o balanceamento das cargas de mensagens em várias instâncias do aplicativo.
zh_cn: `SharedSubscriptionSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdeviceclient/src/com/ibm/iotf/sample/client/application/SharedSubscriptionSample.java>`__ - 显示如何构建可扩展应用程序（用于在应用程序的多个实例之间对消息进行负载均衡）的样本应用程序。
