Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: es, ja, pt_br, zh_cn, zh_tw

source: Java Client Library - Managed Device
es: Biblioteca de cliente Java - Dispositivo gestionado
pt_br: Biblioteca do cliente Java - Dispositivo gerenciado
zh_cn: Java 客户机库 - 受管设备
zh_tw: Java 用戶端程式庫 - 受管理裝置

source: Introduction
es: Introducción
ja: 概要
pt_br: Introdução
zh_cn: 简介
zh_tw: 簡介

source: This client library describes how to use devices with the Java ibmiotf client library. For help with getting started with this module, see `Java Client Library - Introduction <../java/javaintro.html>`__.
es: Esta biblioteca de cliente describe cómo utilizar dispositivos con la biblioteca de cliente Java ibmiotf. Para obtener ayuda con el inicio de este módulo, consulte `Biblioteca de cliente Java - Introducción <../java/javaintro.html>`__.
ja: このクライアント・ライブラリーは、Java ibmiotf クライアント・ライブラリーと共にデバイスを使用する方法について記述しています。このモジュールを始めるにあたって、ヘルプとなる `Java クライアント・ライブラリー - 概要 <../java/javaintro.html>`__ を参照してください。
pt_br: Esta biblioteca do cliente descreve como usar dispositivos com a biblioteca do cliente ibmiotf Java. Para obter ajuda sobre como iniciar este módulo, consulte `Biblioteca do cliente Java - Introdução <../java/javaintro.html>`__.
zh_cn: 此客户机库描述了如何将设备与 Java ibmiotf 客户机库配合使用。有关如何开始使用此模块的帮助，请参阅 `Java 客户机库 - 简介 <../java/javaintro.html>`__。
zh_tw: 此用戶端程式庫說明如何使用裝置與 Java ibmiotf 用戶端程式庫搭配。如需開始使用此模組的說明，請參閱 `Java 用戶端程式庫 - 簡介 <../java/javaintro.html>`__。

source: This section contains information on how devices can connect to the Internet of Things Foundation Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
es: Esta sección contiene información sobre cómo se pueden conectar dispositivos al servicio de gestión de dispositivos de Internet of Things Foundation utilizando Java y llevar a cabo operaciones de gestión de dispositivos como la actualización de firmware, la actualización de ubicaciones y la actualización de diagnósticos.
ja: このセクションには、Java を使用してデバイスを Internet of Things Foundation デバイス管理サービスに接続する方法や、ファイアウォールの更新やロケーションの更新、診断の更新などのデバイス管理操作を実行する方法に関する情報が記載されています。
pt_br: Esta seção contém informações sobre como os dispositivos podem se conectar ao serviço de gerenciamento de dispositivos do Internet of Things Foundation usando Java e executar operações de gerenciamento de dispositivos, como atualizações de firmware, atualizações de local e atualizações de diagnóstico.
zh_cn: 本部分包含的信息涉及设备如何使用 Java 连接到“Internet of Things Foundation 设备管理”服务，以及设备如何执行设备管理操作，如固件更新、位置更新和诊断更新。
zh_tw: 本節包含裝置如何使用 Java 來連接至「Internet of Things Foundation 裝置管理」服務，並執行裝置管理作業（例如，韌體更新、位置更新以及診斷程式更新）的相關資訊。

source: The Device section contains information on how devices can publish events and handle commands using the Java ibmiotf Client Library.
es: La sección Dispositivo contiene información sobre cómo los dispositivos publican los sucesos y manejan los mandatos utilizando la biblioteca de cliente Java ibmiotf.
ja: デバイス・セクションには、デバイスが Java ibmiotf クライアント・ライブラリーを使用してイベントをパブリッシュしコマンドを処理する方法に関する情報が記載されています。
pt_br: A seção Dispositivos contém informações sobre como os dispositivos podem publicar eventos e manipular comandos usando a biblioteca do cliente Java ibmiotf.
zh_cn: “设备”部分包含有关设备如何使用 Java ibmiotf 客户机库发布事件和处理命令的信息。
zh_tw: 「裝置」區段包含裝置如何使用「Java ibmiotf 用戶端程式庫」來發佈事件及處理指令的相關資訊。

source: The Applications section contains information on how applications can use the Java ibmiotf Client Library to interact with devices.
es: La sección Aplicaciones contiene información sobre cómo pueden utilizar las aplicaciones la biblioteca de cliente Java ibmiotf para interactuar con los dispositivos.
ja: アプリケーション・セクションには、アプリケーションがデバイスと対話するために Java ibmiotf クライアント・ライブラリーを使用する方法に関する情報が含まれます。
pt_br: A seção Aplicativos contém informações sobre como os aplicativos podem usar a Biblioteca do Cliente ibmiotf Java para interagir com dispositivos.
zh_cn: “应用程序”部分包含有关应用程序可如何使用 Java ibmiotf 客户机库来与设备进行交互的信息。
zh_tw: 「應用程式」區段包含應用程式如何使用「Java ibmiotf 用戶端程式庫」與裝置互動的相關資訊。

source: Device Management
es: Gestión de dispositivos
ja: デバイス管理
pt_br: Gerenciamento de Dispositivo
zh_cn: 设备管理
zh_tw: 裝置管理

source: The `device management <../reference/device_mgmt.html>`__ feature enhances the Internet of Things Foundation Connect service with new capabilities for managing devices. Device management makes a distinction between managed and unmanaged devices:
es: La función `gestión de dispositivos <../reference/device_mgmt.html>`__ mejora el servicio de Internet of Things Foundation Connect con nuevas prestaciones para los dispositivos de gestión. La gestión de dispositivos establece una diferencia entre dispositivos gestionados y no gestionados:
ja: `デバイス管理機能 <../reference/device_mgmt.html>`__ は、Internet of Things Foundation Connect サービスを拡張してデバイスを管理するための新機能を提供します。デバイス管理は、管理対象デバイスと非管理対象デバイスを次のように区別します。
pt_br: O recurso `gerenciamento de dispositivo <../reference/device_mgmt.html>`__ aprimora o serviço do Internet of Things Foundation Connect com novos recursos para o gerenciamento de dispositivos. O gerenciamento de dispositivos faz uma distinção entre dispositivos gerenciados e não gerenciados:
zh_cn: `设备管理 <../reference/device_mgmt.html>`__ 功能通过新的设备管理功能增强了“Internet of Things Foundation 连接”服务。设备管理可区分受管设备和非受管设备：
zh_tw: `裝置管理 <../reference/device_mgmt.html>`__ 特性以用來管理裝置的新功能來增強「Internet of Things Foundation 連接」服務。裝置管理會區別受管理與未受管理的裝置：

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the Internet of Things Foundation Connect.
es: **Dispositivos gestionados** se definen como dispositivos que tienen instalado un agente. El agente de gestión envía y recibe metadatos de dispositivo y responde a los mandatos de gestión de dispositivos procedentes de Internet of Things Foundation Connect.
ja: **管理対象デバイス**とは、管理エージェントがインストールされているデバイスのことです。管理エージェントは、デバイスのメタデータを送受信し、Internet of Things Foundation Connect からのデバイス管理コマンドに応答します。
pt_br: **Dispositivos Gerenciados** são definidos como dispositivos que possuem um agente de gerenciamento instalado. O agente de gerenciamento envia e recebe metadados do dispositivo e reponde aos comandos de gerenciamento de dispositivo do Internet of Things Foundation Connect.
zh_cn: **Managed Devices** 定义为已安装管理代理程序的设备。管理代理程序可以与“Internet of Things Foundation 连接”之间传输设备元数据，并响应来自“Internet of Things Foundation 连接”的设备管理命令。
zh_tw: **受管理裝置** 定義為已安裝管理代理程式的裝置。管理代理程式會傳送及接收裝置 meta 資料，並回應來自「Internet of Things Foundation 連接」的裝置管理指令。

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the Internet of Things Foundation Connect.
es: **Dispositivos no gestionados** son los dispositivos que no tienen un agente de gestión de dispositivos. Todos los dispositivos comienzan su ciclo de vida como dispositivos no gestionados y pueden pasar a ser dispositivos gestionados enviando un mensaje desde un agente de gestión de dispositivos a Internet of Things Foundation Connect.
ja: **非管理対象デバイス**とは、デバイス管理エージェントを持たないデバイスのことです。すべてのデバイスは、非管理対象デバイスとしてライフサイクルを開始し、メッセージをデバイス管理エージェントから Internet of Things Foundation Connect に送信することによって管理対象デバイスに移行できます。
pt_br: **Dispositivos Não Gerenciados** são todos os dispositivos que não possuem um agente de gerenciamento de dispositivo. Todos os dispositivos iniciam seus ciclos de vida como dispositivos não gerenciados e podem se transformar em dispositivos gerenciados por meio do envio de uma mensagem de um agente de gerenciamento de dispositivo para o Internet of Things Foundation Connect.
zh_cn: **非受管设备** 是没有安装设备管理代理程序的设备。在生命周期一开始，所有设备都是非受管设备，并可以通过设备管理代理程序将消息发送到“Internet of Things Foundation 连接”来转换为受管设备。
zh_tw: **未受管理的裝置** 是指沒有裝置管理代理程式的任何裝置。所有裝置都會以未受管理的裝置開始其生命週期，且可以從裝置管理代理程式傳送一則訊息給「Internet of Things Foundation 連接」，將它轉換成受管理裝置。

source: Connecting to the Internet of Things Foundation Device Management Service
es: Conexión al servicio de gestión de dispositivos de Internet of Things Foundation
ja: Internet of Things Foundation デバイス管理サービスに接続
pt_br: Conectando-se ao serviço de gerenciamento de dispositivos do Internet of Things Foundation
zh_cn: 连接到“Internet of Things Foundation 设备管理”服务
zh_tw: 連接至 Internet of Things Foundation 裝置管理服務

source: Create DeviceData
es: Crear DeviceData
ja: DeviceData の作成
pt_br: Crie DeviceData
zh_cn: 创建 DeviceData
zh_tw: 建立 DeviceData

source: The `device model <../reference/device_model.html>`__ describes the metadata and management characteristics of a device. The device database in the Internet of Things Foundation Connect is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the Internet of Things Foundation Connect, the device database is updated, making the information available to applications.
es: El `modelo de dispositivo <../reference/device_model.html>`__ describe los metadatos y características de gestión de un dispositivo. La base de datos de Internet of Things Foundation Connect es el origen maestro de la información del dispositivo.Las aplicaciones y dispositivos gestionados pueden enviar actualizaciones a la base de datos, como la ubicación o el progreso de actualización del firmware. Una vez recibidas estas actualizaciones por Internet of Things Foundation Connect, la base de datos del dispositivo se actualiza y pone la información a disposición de las aplicaciones.
ja: `デバイス・モデル <../reference/device_model.html>`__ とは、デバイスのメタデータおよび管理特性を記述するものです。Internet of Things Foundation Connect において、デバイス・データベースはデバイス情報のマスター・ソースです。アプリケーションおよび管理対象デバイスは、場所やファームウェア更新の進行状況などの更新情報をデータベースに送信できます。Internet of Things Foundation Connect がこのような更新情報を受け取ると、デバイス・データベースが更新され、アプリケーションでそれらの情報を使用できるようになります。
pt_br: O `modelo de dispositivo <../reference/device_model.html>`__ descreve os metadados e as características de gerenciamento de um dispositivo. O banco de dados do dispositivo no Internet of Things Foundation é a principal fonte de informações sobre o dispositivo. Os aplicativos e dispositivos gerenciados podem enviar atualizações para o banco de dados, como um local ou o progresso de uma atualização de firmware. Quando essas atualizações são recebidas pelo Internet of Things Foundation Connect, o banco de dados do dispositivo é atualizado, disponibilizando as informações para os aplicativos.
zh_cn: `设备模型 <../reference/device_model.html>`__ 描述设备的元数据和管理特征。“Internet of Things Foundation 连接”中的设备数据库是设备信息的主要来源。应用程序和受管设备可以向数据库发送更新（例如，位置或固件更新进度）。“Internet of Things Foundation 连接”收到这些更新后，设备数据库将进行更新，这样应用程序便可以使用这些信息。
zh_tw: `裝置模型 <../reference/device_model.html>`__ 說明裝置的 meta 資料和管理性質。「Internet of Things Foundation 連接」中的裝置資料庫是裝置資訊的主要來源。應用程式及受管理裝置能夠傳送更新至資料庫，如：位置或韌體更新的進度。「Internet of Things Foundation 連接」收到這些更新後，即會更新裝置資料庫，讓資訊可供應用程式使用。

source: The device model in the ibmiotf client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
es: El modelo de dispositivo de la biblioteca de cliente ibmiotf se representa como DeviceData y para crear un DeviceData se deben crear los siguientes objetos,
ja: ibmiotf クライアント・ライブラリーのデバイス・モデルは DeviceData として表されます。DeviceData を作成するには、以下のオブジェクトを作成する必要があります。
pt_br: O modelo de dispositivo na biblioteca do cliente ibmiotf é representado como DeviceData e para criar um DeviceData é necessário criar os seguintes objetos,
zh_cn: ibmiotf 客户机库中的设备模型以 DeviceData 表示，要创建 DeviceData，用户需要创建以下对象：
zh_tw: ibmiotf 用戶端程式庫中的裝置模型會以 DeviceData 代表，若要建立 DeviceData，需要建立下列物件：

source: DeviceInfo (mandatory)
es: DeviceInfo (obligatorio)
ja: DeviceInfo (必須)
pt_br: DeviceInfo (obrigatório)
zh_cn: DeviceInfo（必需）
zh_tw: DeviceInfo（必要）

source: DeviceLocation (required if the device supports location update)
es: DeviceLocation (necesario si el dispositivo soporta la actualización de ubicaciones)
ja: DeviceLocation (デバイスがロケーションの更新をサポートする場合は必須)
pt_br: DeviceLocation (necessário se o dispositivo suportar atualização de local)
zh_cn: DeviceLocation（如果设备支持位置更新，那么是必需的）
zh_tw: DeviceLocation（如果裝置支援位置更新，則為必要）

source: DiagnosticErrorCode (required if the device wants to update the ErrorCode)
es: DiagnosticErrorCode (necesario si el dispositivo quiere actualizar el ErrorCode)
ja: DiagnosticErrorCode (デバイスが ErrorCode を更新する場合は必須)
pt_br: DiagnosticErrorCode (necessário se o dispositivo desejar atualizar o ErrorCode)
zh_cn: DiagnosticErrorCode（如果希望设备更新 ErrorCode，那么是必需的）
zh_tw: DiagnosticErrorCode（如果裝置要更新 ErrorCode，則為必要）

source: DiagnosticLog (required if the device wants to update Log information)
es: DiagnosticLog (necesario si el dispositivo quiere actualizar la información de registro)
ja: DiagnosticLog (デバイスがログ情報を更新する場合は必須)
pt_br: DiagnosticLog (necessário se o dispositivo desejar atualizar as informações de log)
zh_cn: DiagnosticLog（如果希望设备更新日志信息，那么是必需的）
zh_tw: DiagnosticLog（如果裝置要更新「日誌」資訊，則為必要）

source: DeviceFirmware (required if the device supports Firmware Actions)
es: DeviceFirmware (necesario si el dispositivo soporta acciones de firmware)
ja: DeviceFirmware (デバイスがファームウェア・アクションをサポートしている場合は必須)
pt_br: DeviceFirmware (necessário se o dispositivo suportar ações de firmware)
zh_cn: DeviceFirmware（如果设备支持固件操作，那么是必需的）
zh_tw: DeviceFirmware（如果裝置支援「韌體動作」，則為必要）

source: DeviceMetadata (optional)
es: DeviceMetadata (opcional)
ja: DeviceMetadata (オプション)
pt_br: DeviceMetadata (opcional)
zh_cn: DeviceMetadata（可选)
zh_tw: DeviceMetadata（選用）

source: The following code snippet shows how to create the mandatory object DeviceInfo along with an optional object DeviceMetadata with sample data:
es: El siguiente fragmento de código muestra cómo crear el objeto obligatorio DeviceInfo junto con un objeto opcional DeviceMetadata con datos de muestra:
ja: 以下のコード・スニペットは、サンプル・データを使用して必須オブジェクト DeviceInfo をオプション・オブジェクト DeviceMetadata と一緒に作成する方法を示しています。
pt_br: O fragmento de código a seguir mostra como criar o projeto obrigatório DeviceInfo juntamente com um objeto opcional DeviceMetadata com dados de amostra:
zh_cn: 以下代码片段显示如何使用样本数据创建必需对象 DeviceInfo 以及可选对象 DeviceMetadata：
zh_tw: 下列程式碼 Snippet 顯示如何使用取樣資料，建立必要物件 DeviceInfo 和選用物件 DeviceMetadata：

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
es: El siguiente fragmento de código muestra cómo crear el objeto DeviceData con los objetos creados anteriormente DeviceInfo y DeviceMetadata:
ja: 以下のコード・スニペットは、DeviceData オブジェクトを、上記で作成した DeviceInfo オブジェクトおよび DeviceMetadata オブジェクトと一緒に作成する方法を示しています。
pt_br: O fragmento de código a seguir mostra como criar o objeto DeviceData com os objetos DeviceInfo e DeviceMetadata criados anteriormente:
zh_cn: 以下代码片段显示如何通过上面创建的 DeviceInfo 和 DeviceMetadata 对象来创建 DeviceData 对象：
zh_tw: 下列程式碼 Snippet 顯示如何使用上方建立的 DeviceInfo 及 DeviceMetadata 物件來建立 DeviceData 物件：

source: Construct ManagedDevice
es: Construir ManagedDevice
ja: ManagedDevice の構成
pt_br: Construa ManagedDevice
zh_cn: 构造 ManagedDevice
zh_tw: 建構 ManagedDevice

source: ManagedDevice - A device class that connects the device as managed device to Internet of Things Foundation Connect and enables the device to perform one or more Device Management operations. Also the ManagedDevice instance can be used to do normal device operations like publishing device events and listening for commands from application.
es: ManagedDevice - Una clase de dispositivo que conecta el dispositivo como dispositivo gestionado con Internet of Things Foundation Connect y permite al dispositivo realizar operaciones de gestión de dispositivos.Además, la instancia ManagedDevice se puede utilizar para realizar operaciones normales del dispositivo como publicar sucesos de dispositivo y escuchar comandos de la aplicación.
ja: ManagedDevice - デバイスを管理対象デバイスとして Internet of Things Foundation Connect に接続して、デバイスが 1 つ以上のデバイス管理操作を実行できるようにするデバイス・クラス。また、ManagedDevice インスタンスを使用して、デバイス・イベントのパブリッシュやアプリケーションからのコマンドの listen などの通常のデバイス操作を行うこともできます。
pt_br: ManagedDevice - Uma classe de dispositivo que conecta o dispositivo como um dispositivo gerenciado ao Internet of Things Foundation Connect e permite que o dispositivo execute uma ou mais operações de gerenciamento de dispositivo. Além disso, a instância ManagedDevice pode ser usada para a execução de operações de dispositivo normais, como a publicação de eventos de dispositivo e o atendimento a comandos do aplicativo.
zh_cn: ManagedDevice - 一种设备类，可将设备作为受管设备连接到“Internet of Things Foundation 连接”，并且允许设备执行一个或多个“设备管理”操作。另外，ManagedDevice 实例还可用于执行常规设备操作，如发布设备事件和侦听应用程序发出的命令。
zh_tw: ManagedDevice - 此為一種裝置類別，將作為受管理裝置的裝置連接至「Internet of Things Foundation 連接」，並可讓裝置執行一或多個「裝置管理」作業。此外，ManagedDevice 實例也可用來執行一般裝置作業，例如，發佈裝置事件以及接聽來自應用程式的指令。

source: ManagedDevice exposes 2 different constructors to support different user patterns,
es: ManagedDevice expone 2 constructores diferentes para soportar distintos patrones de usuario,
ja: ManagedDevice は、異なる複数のユーザー・パターンをサポートする 2 つの異なるコンストラクターを公開します。
pt_br: O ManagedDevice expõe dois construtores diferentes para o suporte a diferentes padrões do usuário,
zh_cn: ManagedDevice 提供 2 种不同的构造方法，用于支持不同的用户模式：
zh_tw: ManagedDevice 利用 2 個不同的建構子來支援不同的使用者型樣。

source: **Constructor One**
es: **Constructor uno**
ja: **コンストラクター 1**
pt_br: **Construtor Um**
zh_cn: **构造方法 1**
zh_tw: **建構子一**

source: Constructs a ManagedDevice instance by accepting the DeviceData and the following properties,
es: Construye una instancia ManagedDevice aceptando el DeviceData y las siguientes propiedades,
ja: DeviceData と以下のプロパティーを受け入れることにより、ManagedDevice インスタンスを構成します。
pt_br: Constrói uma instância de ManagedDevice, aceitando os DeviceData e as seguintes propriedades,
zh_cn: 通过接受 DeviceData 和以下属性来构造 ManagedDevice 实例：
zh_tw: 透過接受 DeviceData 及下列內容的方式，來建構 ManagedDevice 實例：

source: Organization-ID - Your organization ID.
es: Organization-ID - El ID de su organización.
ja: Organization-ID - 組織 ID。
pt_br: Organization-ID - O ID da organização.
zh_cn: Organization-ID - 贵组织的标识。
zh_tw: Organization-ID - 組織 ID。

source: Device-Type - The type of your device.
es: Device-Type - El tipo de dispositivo.
ja: Device-Type - デバイスのタイプ。
pt_br: Device-Type - O tipo de dispositivo.
zh_cn: Device-Type - 设备的类型。
zh_tw: Device-Type - 裝置的類型。

source: Device-ID - The ID of your device.
es: Device-ID - El ID de su dispositivo.
ja: Device-ID - デバイスの ID。
pt_br: Device-ID - O ID do dispositivo.
zh_cn: Device-ID - 设备的标识。
zh_tw: Device-ID - 裝置的 ID。

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
es: Authentication-Method - Método de autenticación (el único valor actualmente soportado es "token").
ja: Authentication-Method - 認証方式 (現在サポートされている値は "token" のみ)。
pt_br: Authentication-Method - O método de autenticação (o único valor atualmente suportado é "token").
zh_cn: Authentication-Method - 认证方法（当前唯一支持的值为“token”）。
zh_tw: Authentication-Method - 鑑別的方法（目前唯一支援的值是 "token"）。

source: Authentication-Token - API key token
es: Authentication-Token - Elemento clave de la API
ja: Authentication-Token - API キー・トークン
pt_br: Authentication-Token - O token da chave de API
zh_cn: Authentication-Token - API 密钥令牌
zh_tw: Authentication-Token - API 金鑰記號

source: All these properties are required to interact with the Internet of Things Foundation Connect.
es: Todas estas propiedades son necesarias para interactuar con Internet of Things Foundation Connect.
ja: これらのプロパティーはすべて、Internet of Things Foundation Connect と対話するために必要です。
pt_br: Todas essas propriedades são necessárias para interagir com o Internet of Things Foundation Connect.
zh_cn: 所有这些属性都是与“Internet of Things Foundation 连接”进行交互时所必需的。
zh_tw: 這些內容全部都需要，才能與「Internet of Things Foundation 連接」互動。

source: The following code shows how to create a ManagedDevice instance:
es: El código siguiente muestra cómo crear una instancia ManagedDevice:
ja: 以下のコードでは、ManagedDevice インスタンスの作成方法を示しています。
pt_br: O código a seguir mostra como criar uma instância de ManagedDevice:
zh_cn: 以下代码显示如何创建 ManagedDevice 实例：
zh_tw: 下列程式碼顯示如何建立 ManagedDevice 實例：

source: The existing users of DeviceClient might observe that the names of these properties have changed slightly. These names have been changed to mirror the names in the Internet of Things Foundation Connect Dashboard, but the existing users who want to migrate from the DeviceClient to the ManagedDevice can still use the old format and construct the ManagedDevice instance as follows:
es: Los usuarios existentes de DeviceClient pueden observar ligeros cambios en el nombre de estas propiedades. Estos nombres se han cambiado para adaptarlos a los nombres del Panel de control de Internet of Things Foundation Connect, pero los usuarios existentes que deseen migrar de DeviceClient a ManagedDevice pueden seguir utilizando el formato anterior y construir la instancia ManagedDevice como se indica a continuación:
ja: DeviceClient の既存のユーザーは、これらのプロパティーの名前が若干変更されていることに気が付くかもしれません。これらの名前は、Internet of Things Foundation Connect ダッシュボードで名前をミラーリングするために変更されていますが、DeviceClient から ManagedDevice に移行する既存のユーザーは引き続き古い形式を使用して、以下のように ManagedDevice インスタンスを構成することができます。
pt_br: Os usuários existentes do DeviceClient podem observar que os nomes dessas propriedades sofreram algumas alterações. Esses nomes foram alterados para espelhar os nomes existentes no Painel do Internet of Things Foundation Connect, mas os usuários existentes que desejarem migrar do DeviceClient para o ManagedDevice ainda podem usar o formato antigo e construir a instância de ManagedDevice conforme a seguir:
zh_cn: DeviceClient 的现有用户可能会注意到这些属性的名称略有变化。更改这些名称是为了与“Internet of Things Foundation 连接仪表板”中的名称对应，但希望从 DeviceClient 迁移到 ManagedDevice 的现有用户仍可以使用原有格式并如下构造 ManagedDevice 实例：
zh_tw: DeviceClient 的現有使用者可能會注意到這些內容的名稱有輕微變更。這些名稱已變更，以鏡映「Internet of Things Foundation 連接儀表板」中的名稱，但是，想要從 DeviceClient 移轉至 ManagedDevice 的現有使用者仍然可以使用舊格式，並如下建構 ManagedDevice 實例：

source: **Constructor Two**
es: **Constructor dos**
ja: **コンストラクター 2**
pt_br: **Construtor Dois**
zh_cn: **构造方法 2**
zh_tw: **建構子二**

source: Construct a ManagedDevice instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
es: Construye una instancia ManagedDevice aceptando el DeviceData y la instancia MqttClient.Este constructor requiere que el DeviceData se cree con atributos de dispositivo adicionales como Device Type y Device Id del modo siguiente:
ja: DeviceData および MqttClient インスタンスを受け入れることにより、ManagedDevice インスタンスを構成します。以下のとおり、このコンストラクターについては、デバイス・タイプやデバイス ID などの追加のデバイス属性を使用して、DeviceData を作成する必要があります。
pt_br: Construa uma instância de ManagedDevice, aceitando os DeviceData e a instância MqttClient. Este construtor requer que os DeviceData sejam criados com atributos de dispositivo adicionais, como Tipo de Dispositivo e ID de Dispositivo, conforme a seguir:
zh_cn: 通过接受 DeviceData 和 MqttClient 实例来构造 ManagedDevice 实例。该构造方法要求使用其他设备属性（如设备类型和设备标识）来创建 DeviceData，如下所示：
zh_tw: 透過接受 DeviceData 及 MqttClient 實例的方式，來建構 ManagedDevice 實例。此建構子需要 DeviceData 以「裝置類型」及「裝置 ID」等其他裝置屬性建立，如下所示：
