Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/java/java_deviceManagement.po
Languages: es, ja, pt_br, zh_cn, zh_tw

source: Note this constructor helps the custom device users to create a ManagedDevice instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
es: Tenga en cuenta que este constructor ayuda a los usuarios de dispositivos personalizados a crear una instancia ManagedDevice con la instancia ya creada y conectada MqttClient para hacer uso de las operaciones de gestión de dispositivos.No obstante, recomendamos a los usuarios utilizar la biblioteca para todas las funcionalidades de dispositivos.
ja: このコンストラクターは、既に作成および接続されている MqttClient インスタンスとともにカスタム・デバイス・ユーザーが ManagedDevice インスタンスを作成して、デバイス管理操作を利用できるようにします。しかし、ユーザーがすべてのデバイス機能用のライブラリーを使用することをお勧めします。
pt_br: Observe que esse construtor ajuda os usuários do dispositivo customizado a criarem uma instância de ManagedDevice com a instância MqttClient já criada e conectada, aproveitando as operações de gerenciamento de dispositivo. Mas nós recomendamos que os usuários utilizem a biblioteca para todas as funcionalidades do dispositivo.
zh_cn: 注意，该构造方法有助于定制设备用户使用已创建和已连接的 MqttClient 实例来创建 ManagedDevice 实例，以利用设备管理操作。但我们建议用户对所有设备功能均使用该库。
zh_tw: 請注意，此建構子可協助自訂裝置使用者，使用已建立並已連接的 MqttClient 實例來建立 ManagedDevice 實例，以利用裝置管理作業。但是，對於所有裝置功能，我們建議使用者使用程式庫。

source: Manage
es: Gestionar
ja: 管理
pt_br: Gerenciar
zh_cn: 管理
zh_tw: 管理

source: The device can invoke manage() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the Internet of Things Foundation Connect already:
es: El dispositivo puede solicitar el método manage() para participar en las actividades de gestión de dispositivos. La solicitud de gestión iniciará una solicitud de conexión a nivel interno si el dispositivo no está conectado ya con Internet of Things Foundation Connect:
ja: デバイスは、manage() メソッドを呼び出して、デバイス管理アクティビティーに参加することができます。デバイスが Internet of Things Foundation Connect にまだ接続していない場合、管理リクエストは接続リクエストを内部的に開始します。
pt_br: O dispositivo pode chamar o método manage() para participar das atividades de gerenciamento de dispositivo. A solicitação de gerenciamento iniciará uma solicitação de conexão internamente se o dispositivo ainda não estiver conectado ao Internet of Things Foundation Connect:
zh_cn: 设备可通过调用 manage() 方法来参与设备管理活动。如果设备尚未连接到“Internet of Things Foundation 连接”，那么管理请求将在内部发出一个连接请求：
zh_tw: 裝置可以呼叫 manage() 方法來參與裝置管理活動。如果裝置尚未連接至「Internet of Things Foundation 連接」，則管理要求會在內部起始連接要求：

source: The device can use overloaded manage (lifetime) method to register the device for a given timeframe. The timeframe specifies the length of time within which the device must send another **Manage device** request in order to avoid being reverted to an unmanaged device and marked as dormant.
es: El dispositivo puede utilizar un método de gestión sobrecargado (tiempo de vida) para registrar el dispositivo durante un periodo de tiempo determinado. El periodo de tiempo especifica el periodo durante el cual el dispositivo debe enviar otra solicitud **Manage device** para evitar convertirse en un dispositivo no gestionado y marcarse como inactivo.
ja: デバイスは、overloaded manage (lifetime) メソッドを使用して、特定の timeframe でデバイスを登録します。timeframe は、デバイスが次の **デバイスを管理** リクエストを送信しなければならない制限時間を指定します。これを過ぎるとデバイスは非管理対象デバイスに戻り、「休止」のマークが付けられます。
pt_br: O dispositivo pode usar o método de gerenciamento sobrecarregado (tempo de vida) para registrar o dispositivo por um determinado intervalo de tempo. O intervalo de tempo especifica o período de tempo no qual o dispositivo deve enviar outra solicitação **Gerenciar dispositivo** para evitar ser revertido em um dispositivo não gerenciado e marcado como inativo.
zh_cn: 设备可以使用重载 manage (lifetime) 方法针对指定时间范围注册设备。该时间范围指定一个时间段，设备必须在该时间段内发送另一个**管理设备**请求，以便避免被还原为非受管设备且标记为停止。
zh_tw: 裝置可使用 overloaded manage (lifetime) 方法，在給定的時間範圍內登錄裝置。時間範圍指定一個時間長度，裝置必須在此期間內傳送另一個 **管理裝置** 要求，以避免回復成未受管理裝置並標示為休眠。

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the manage operation.
es: Consulte la `documentación <../device_mgmt/operations/manage.html>`__ para obtener más información sobre la operación de gestión.
ja: 管理操作について詳しくは、`資料 <../device_mgmt/operations/manage.html>`__ を参照してください。
pt_br: Consulte a `documentação <../device_mgmt/operations/manage.html>`__ para obter mais informações sobre a operação de gerenciamento.
zh_cn: 有关管理操作的更多信息，请参阅 `文档 <../device_mgmt/operations/manage.html>`__。
zh_tw: 如需管理作業的相關資訊，請參閱 `文件 <../device_mgmt/operations/manage.html>`__。

source: Unmanage
es: No gestionar
ja: 管理解除
pt_br: Cancelar gerenciamento
zh_cn: 取消管理
zh_tw: 取消管理

source: A device can invoke unmanage() method when it no longer needs to be managed. The Internet of Things Foundation Connect will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a **Manage device** request.
es: Un dispositivo puede solicitar el método unmanage() cuando ya no necesite ser gestionado. Internet of Things Foundation Connect dejará de enviar nuevas solicitudes de gestión de dispositivos a este dispositivo y todas las solicitudes de gestión de dispositivos de este dispositivo distintas a la solicitud **Manage device** se rechazarán.
ja: デバイスは、管理される必要がなくなったときに unmanage() メソッドを呼び出すことができます。Internet of Things Foundation Connect は新しいデバイス管理リクエストをこのデバイスに送信しなくなり、このデバイスからのすべてのデバイス管理リクエスト (**デバイスを管理** リクエストを除く) は拒否されます。
pt_br: Um dispositivo pode chamar o método unmanage() quando não precisar mais ser gerenciado. O Internet of Things Foundation Connect deixará de enviar novas solicitações de gerenciamento de dispositivo para esse dispositivo e todas as solicitações de gerenciamento de dispositivo feitas a partir desse dispositivo serão rejeitadas, com exceção de uma solicitação **Gerenciar dispositivo**.
zh_cn: 当设备不再需要接受管理时，它可以调用 unmanage() 方法。“Internet of Things Foundation 连接”将不再向此设备发送新的设备管理请求，并且将拒绝来自此设备的所有设备管理请求（**管理设备**请求除外）。
zh_tw: 當裝置不再需要管理時，可呼叫 unmanage() 方法。「Internet of Things Foundation 連接」不會再傳送新的裝置管理要求給這個裝置，且除了 **管理裝置** 要求以外，來自這個裝置的所有裝置管理要求都會遭到拒絕。

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the Unmanage operation.
es: Consulte la `documentación <../device_mgmt/operations/manage.html>`__ para obtener más información sobre la operación No gestionar.
ja: 管理解除操作について詳しくは、`資料 <../device_mgmt/operations/manage.html>`__ を参照してください。
pt_br: Consulte a `documentação <../device_mgmt/operations/manage.html>`__ para obter mais informações sobre a operação de cancelamento de gerenciamento.
zh_cn: 有关取消管理操作的更多信息，请参阅 `文档 <../device_mgmt/operations/manage.html>`__。
zh_tw: 如需「取消管理」作業的相關資訊，請參閱 `文件 <../device_mgmt/operations/manage.html>`__。

source: Location Update
es: Actualización de la ubicación
ja: ロケーションの更新
pt_br: Atualização de local
zh_cn: 位置更新
zh_tw: 位置更新

source: Devices that can determine their location can choose to notify the Internet of Things Foundation Connect about location changes. In order to update the location, the device needs to create DeviceData instance with the DeviceLocation object first.
es: Los dispositivos que pueden determinar su ubicación pueden optar por notificar a Internet of Things Foundation Connect los cambios en la ubicación.Para actualizar la ubicación, antes el dispositivo debe crear la instancia DeviceData con el objeto DeviceLocation.
ja: ロケーションを判別できるデバイスは、ロケーションの変更について Internet of Things Foundation Connect に通知することを選択できます。ロケーションを更新するには、デバイスは DeviceLocation オブジェクトとともにまず DeviceData インスタンスを作成する必要があります。
pt_br: Os dispositivos que podem determinar seu local podem optar por notificar o Internet of Things Foundation Connect sobre as mudanças de local. Para atualizar o local, primeiro o dispositivo precisa criar a instância DeviceData com o objeto DeviceLocation.
zh_cn: 能确定自身位置的设备可以选择将位置变更信息通知给“Internet of Things Foundation 连接”。为了更新位置，设备需要首先通过 DeviceLocation 对象创建 DeviceData 实例。
zh_tw: 可以判斷其位置的裝置可以選擇通知「Internet of Things Foundation 連接」有關其位置變更。為了更新位置，裝置需要先利用 DeviceLocation 物件來建立 DeviceData 實例。

source: Once the device is connected to Internet of Things Foundation Connect, the location can be updated by invoking the following method:
es: Una vez que el dispositivo está conectado a Internet of Things Foundation Connect, la ubicación se puede actualizar invocando el siguiente método:
ja: デバイスが Internet of Things Foundation Connect に接続されると、以下のメソッドを呼び出すことにより、ロケーションを更新することができます。
pt_br: Quando o dispositivo estiver conectado ao Internet of Things Foundation Connect, o local pode ser atualizado, chamando o seguinte método:
zh_cn: 设备连接到“Internet of Things Foundation 连接”后，便可以通过调用以下方法来更新位置：
zh_tw: 裝置一旦連接至「Internet of Things Foundation 連接」之後，便可呼叫下列方法來更新位置：

source: Later, any new location can be updated by changing the properties of the DeviceLocation object:
es: Posteriormente, las nuevas ubicaciones se pueden actualizar cambiando las propiedades del objeto DeviceLocation:
ja: DeviceLocation オブジェクトのプロパティーを変更することにより、後で新規ロケーションを更新することができます。
pt_br: Posteriormente, qualquer novo local pode ser atualizado alterando as propriedades do objeto DeviceLocation:
zh_cn: 之后，可以通过更改 DeviceLocation 对象的属性来更新任何新位置：
zh_tw: 稍後，只要變更 DeviceLocation 物件的內容，便可更新任何新位置：

source: The update() method informs the Internet of Things Foundation Connect about the new location.
es: El método update() informa a Internet of Things Foundation Connect sobre la nueva ubicación.
ja: update() メソッドは、新規ロケーションについて Internet of Things Foundation Connect に通知します。
pt_br: O método update() informa o Internet of Things Foundation Connect sobre o novo local.
zh_cn: update() 方法会向“Internet of Things Foundation 连接”发送有关新位置的信息。
zh_tw: update() 方法會通知「Internet of Things Foundation 連接」有關新位置。

source: Refer to the `documentation <../device_mgmt/operations/update.html>`__ for more information about the Location update.
es: Consulte la `documentación <../device_mgmt/operations/update.html>`__ para obtener más información sobre la actualización de la ubicación.
ja: ロケーションの更新について詳しくは、`資料 <../device_mgmt/operations/update.html>`__ を参照してください。
pt_br: Consulte a `documentação <../device_mgmt/operations/update.html>`__ para obter mais informações sobre a atualização de local.
zh_cn: 有关位置更新的更多信息，请参阅 `文档 <../device_mgmt/operations/update.html>`__。
zh_tw: 如需「位置」更新的相關資訊，請參閱 `文件 <../device_mgmt/operations/update.html>`__。

source: Append/Clear ErrorCodes
es: Añadir/Borrar ErrorCodes
ja: ErrorCodes の付加/クリア
pt_br: Anexar/limpar ErrorCodes
zh_cn: 附加/清除 ErrorCodes
zh_tw: 附加/清除 ErrorCodes

source: Devices can choose to notify the Internet of Things Foundation Connect about changes in their error status. In order to send the ErrorCodes the device needs to construct a DiagnosticErrorCode object as follows:
es: Los dispositivos pueden notificar a Internet of Things Foundation Connect los cambios producidos en sus estados de error.Para enviar los ErrorCodes, el dispositivo debe construir un objeto DiagnosticErrorCode del modo siguiente:
ja: デバイスはエラー状況の変化について Internet of Things Foundation Connect に通知することを選択できます。ErrorCodes を送信するには、デバイスは DiagnosticErrorCode オブジェクトを次のように構成する必要があります。
pt_br: Os dispositivos podem optar por notificar o Internet of Things Foundation Connect sobre as mudanças em seus status de erro. Para enviar os ErrorCodes o dispositivo precisa construir um objeto DiagnosticErrorCode conforme a seguir:
zh_cn: 设备可以选择向“Internet of Things Foundation 连接”通知有关其错误状态的更改。为了发送 ErrorCodes，设备需要构造一个 DiagnosticErrorCode 对象，如下所示：
zh_tw: 裝置可以選擇通知「Internet of Things Foundation 連接」有關其錯誤狀態的變更。為了傳送 ErrorCodes，裝置需要建構一個 DiagnosticErrorCode 物件，如下所示：

source: Once the device is connected to Internet of Things Foundation Connect, the ErrorCode can be sent by calling the send() method as follows:
es: Una vez que el dispositivo está conectado a Internet of Things Foundation Connect, el ErrorCode se puede enviar invocando el método send() del siguiente modo:
ja: デバイスが Internet of Things Foundation Connect に接続されると、次のように send() メソッドを呼び出すことにより、ErrorCode を送信することができます。
pt_br: Quando o dispositivo estiver conectado ao Internet of Things Foundation Connect, o ErrorCode pode ser enviado, chamando o método send(), conforme a seguir:
zh_cn: 设备连接到“Internet of Things Foundation 连接”后，可通过调用 send() 方法发送 ErrorCode，如下所示：
zh_tw: 裝置一旦連接至「Internet of Things Foundation 連接」之後，便可透過呼叫 send() 方法來傳送 ErrorCode，如下所示：

source: Later, any new ErrorCodes can be easily added to the Internet of Things Foundation Connect by calling the append method as follows:
es: Posteriormente, los ErrorCodes nuevos se pueden añadir a Internet of Things Foundation Connect invocando el método append del modo siguiente:
ja: 次のように append メソッドを呼び出すことにより、後で新規 ErrorCodes を Internet of Things Foundation Connect に簡単に追加することができます。
pt_br: Posteriormente, novos ErrorCodes podem ser facilmente incluídos no Internet of Things Foundation Connect, chamando o método de anexação conforme a seguir:
zh_cn: 之后，可通过调用 append 方法将任何新的 ErrorCodes 轻松添加到“Internet of Things Foundation 连接”如下所示：
zh_tw: 稍後，呼叫 append 方法便可輕易將任何新的 ErrorCodes 新增至「Internet of Things Foundation 連接」，如下所示：

source: Also, the ErrorCodes can be cleared from Internet of Things Foundation Connect by calling the clear() method as follows:
es: Además, los ErrorCodes se pueden borrar de Internet of Things Foundation Connect invocando el método clear() del modo siguiente:
ja: また、次のように clear() メソッドを呼び出すことにより、Internet of Things Foundation Connect から ErrorCodes をクリアすることもできます。
pt_br: Além disso, os ErrorCodes podem ser limpos do Internet of Things Foundation Connect, chamando o método clear() conforme a seguir:
zh_cn: 另外，可通过调用 clear() 方法从“Internet of Things Foundation 连接”中清除 ErrorCodes，如下所示：
zh_tw: 此外，呼叫 clear() 方法便可從「Internet of Things Foundation 連接」清除 ErrorCodes，如下所示：

source: Append/Clear Log messages
es: Añadir/Borrar mensajes de registro
ja: ログ・メッセージの付加/クリア
pt_br: Anexar/limpar mensagens de log
zh_cn: 附加/清除日志消息
zh_tw: 附加/清除日誌訊息

source: Devices can choose to notify the Internet of Things Foundation Connect about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. In order to send log messages, the device needs to construct a DiagnosticLog object as follows:
es: Los dispositivos pueden optar por notificar los cambios a Internet of Things Foundation Connect añadiendo una nueva entrada de registro.La entrada de registro incluye mensajes de error, su marca de fecha y hora y gravedad, así como datos de diagnóstico binarios codificados en base 64. Para enviar los mensajes de registro, el dispositivo debe construir un objeto DiagnosticLog del modo siguiente:
ja: 新規ログ項目を追加することにより、デバイスは変化について Internet of Things Foundation Connect に通知することを選択できます。ログ・エントリーには、ログ・メッセージ、タイム・スタンプと重大度、およびオプションで base64 でエンコードしたバイナリー診断データが含まれます。ログ・メッセージを送信するには、デバイスは DiagnosticLog オブジェクトを次のように構成する必要があります。
pt_br: Os dispositivos podem optar por notificar o Internet of Things Foundation Connect sobre as mudanças ocorridas, incluindo uma nova entrada de log. A entrada de log inclui mensagens de log, seus registros de data e hora e de gravidade, bem como dados diagnósticos binários opcionais codificados em base64. Para enviar mensagens de log, o dispositivo precisa construir um objeto DiagnosticLog, conforme a seguir:
zh_cn: 设备可以通过添加新日志条目向“Internet of Things Foundation 连接”通知相关更改。日志条目包括日志消息、消息的时间戳记和严重性，以及采用 base64 编码的二进制诊断数据（可选）。为了发送日志消息，设备需要构造一个 DiagnosticLog 对象，如下所示：
zh_tw: 裝置可以選擇通知「Internet of Things Foundation 連接」有關透過新增日誌項目而產生的變更。日誌項目包括日誌訊息、其時間戳記和嚴重性，以及可能包含 base64 編碼的二進位診斷資料。為了傳送日誌訊息，裝置需要建構一個 DiagnosticLog 物件，如下所示：

source: Once the device is connected to Internet of Things Foundation Connect, the log message can be sent by calling the send() method as follows:
es: Una vez que el dispositivo está conectado a Internet of Things Foundation Connect, el mensaje de registro se puede enviar invocando el método send() del siguiente modo:
ja: デバイスが Internet of Things Foundation Connect に接続されると、次のように send() メソッドを呼び出すことにより、ログ・メッセージを送信することができます。
pt_br: Quando o dispositivo estiver conectado ao Internet of Things Foundation Connect, a mensagem de log pode ser enviada, chamando o método send(), conforme a seguir:
zh_cn: 设备连接到“Internet of Things Foundation 连接”后，可通过调用 send() 方法发送日志消息，如下所示：
zh_tw: 裝置一旦連接至「Internet of Things Foundation 連接」之後，便可透過呼叫 send() 方法來傳送日誌訊息，如下所示：

source: Later, any new log messages can be easily added to the Internet of Things Foundation Connect by calling the append method as follows:
es: Posteriormente, los mensajes de registro nuevos se pueden añadir a Internet of Things Foundation Connect invocando el método append del modo siguiente:
ja: 次のように append メソッドを呼び出すことにより、後で新規ログ・メッセージを Internet of Things Foundation Connect に簡単に追加することができます。
pt_br: Posteriormente, novas mensagens de log podem ser facilmente incluídas no Internet of Things Foundation Connect, chamando o método de anexação conforme a seguir:
zh_cn: 之后，可通过调用 append 方法将任何新的日志消息轻松添加到“Internet of Things Foundation 连接”，如下所示：
zh_tw: 稍後，呼叫 append 方法便可輕易將任何新的日誌訊息新增至「Internet of Things Foundation 連接」，如下所示：

source: Also, the log messages can be cleared from Internet of Things Foundation Connect by calling the clear method as follows:
es: Además, los mensajes de registro se pueden borrar de Internet of Things Foundation Connect invocando el método clear del modo siguiente:
ja: また、次のように clear メソッドを呼び出すことにより、Internet of Things Foundation Connect からログ・メッセージをクリアすることもできます。
pt_br: Além disso, as mensagens de log podem ser limpas do Internet of Things Foundation Connect, chamando o método de limpeza conforme a seguir:
zh_cn: 另外，可通过调用 clear 方法从“Internet of Things Foundation 连接”中清除日志消息，如下所示：
zh_tw: 此外，呼叫 clear 方法便可從「Internet of Things Foundation 連接」清除日誌訊息，如下所示：

source: The device diagnostics operations are intended to provide information on device errors, and does not provide diagnostic information relating to the devices connection to the Internet of Things Foundation Connect.
es: El diagnóstico de dispositivo está pensado para proporcionar información sobre errores de dispositivo y no proporciona información relacionada con la conexión de los dispositivos a Internet of Things Foundation Connect.
ja: デバイス診断操作の目的はデバイス・エラー情報を提供することです。デバイスと Internet of Things Foundation Connect の接続に関連した診断情報はここでは提供されません。
pt_br: As operações de diagnósticos de dispositivos têm com objetivo fornecer informações sobre erros de dispositivos e não fornecer informações de diagnóstico relacionadas à conexão de dispositivos ao Internet of Things Foundation Connect.
zh_cn: 设备诊断操作用于提供有关设备错误的信息，而不提供与连接“Internet of Things Foundation 连接”的设备相关的诊断信息。
zh_tw: 裝置診斷作業的目的是提供裝置錯誤的相關資訊，但不會提供與「Internet of Things Foundation 連接」的裝置連線相關的診斷資訊。

source: Refer to the `documentation <../device_mgmt/operations/diagnostics.html>`__ for more information about the Diagnostics operation.
es: Consulte la `documentación <../device_mgmt/operations/diagnostics.html>`__ para obtener más información sobre la operación de diagnóstico.
ja: 診断操作について詳しくは、`資料 <../device_mgmt/operations/diagnostics.html>`__ を参照してください。
pt_br: Consulte a `documentação <../device_mgmt/operations/diagnostics.html>`__ para obter mais informações sobre a operação de diagnóstico.
zh_cn: 有关诊断操作的更多信息，请参阅 `文档 <../device_mgmt/operations/diagnostics.html>`__。
zh_tw: 如需「診斷」作業的相關資訊，請參閱 `文件 <../device_mgmt/operations/diagnostics.html>`__。

source: Firmware Actions
es: Acciones de firmware
ja: ファームウェア操作
pt_br: Ações de firmware
zh_cn: 固件操作
zh_tw: 韌體動作

source: The firmware update process is separated into two distinct actions:
es: El proceso de actualización del firmware se divide en dos acciones distintas:
ja: ファームウェア更新プロセスは、2 つの別個の操作に分かれています。
pt_br: O processo de atualização de firmware é separado em duas ações distintas:
zh_cn: 固件更新过程分为以下两个不同的操作：
zh_tw: 韌體更新程序分為兩個不同的動作：

source: Downloading Firmware
es: Descarga de firmware
ja: ファームウェアのダウンロード
pt_br: Download do firmware
zh_cn: 下载固件
zh_tw: 下載韌體

source: Updating Firmware.
es: Actualización de firmware.
ja: ファームウェアの更新。
pt_br: Atualização do firmware.
zh_cn: 更新固件
zh_tw: 更新韌體。

source: The device needs to do the following activities to support Firmware Actions:
es: Para soportar las acciones de firmware, el dispositivo debe llevar a cabo las siguientes actividades:
ja: デバイスは、ファームウェア操作をサポートするために次のアクティビティーを行う必要があります。
pt_br: O dispositivo precisa executar as seguintes atividades para suportar ações de firmware:
zh_cn: 设备需要完成以下活动来支持这些固件操作：
zh_tw: 裝置需要執行下列活動，才能支援「韌體動作」：

source: **1. Construct DeviceFirmware Object**
es: **1. Construir el objeto DeviceFirmware**
ja: **1. DeviceFirmware オブジェクトの構成**
pt_br: **1. Construir o objeto DeviceFirmware**
zh_cn: **1. 构造 DeviceFirmware 对象**
zh_tw: **1. 建構 DeviceFirmware 物件**

source: In order to perform Firmware actions the device needs to construct the DeviceFirmware object and add it to DeviceData as follows:
es: Para llevar a cabo las acciones de firmware. el dispositivo debe crear el objeto DeviceFirmware y añadirlo a DeviceData del modo siguiente:
ja: ファームウェア操作を実行するには、デバイスは DeviceFirmware オブジェクトを次のように構成し、それを DeviceData に追加する必要があります。
pt_br: Para executar ações de firmware, o dispositivo precisa construir o objeto DeviceFirmware e incluí-lo em DeviceData, conforme a seguir:
zh_cn: 为了执行固件操作，设备需要构造 DeviceFirmware 对象并将其添加到 DeviceData，如下所示：
zh_tw: 為了執行「韌體」動作，裝置需要建構 DeviceFirmware 物件，並將其新增至 DeviceData，如下所示：

source: The DeviceFirmware object represents the current firmware of the device and will be used to report the status of the Firmware Download and Firmware Update actions to Internet of Things Foundation Connect.
es: El objeto DeviceFirmware representa el firmware actual del dispositivo y se utilizará para informar sobre el estado de las acciones Descarga de firmware y Actualización de firmware a Internet of Things Foundation Connect.
ja: DeviceFirmware オブジェクトは、デバイスの現在のファームウェアを表しており、Internet of Things Foundation Connect にファームウェア・ダウンロード・アクションおよびファームウェア更新アクションの状況を報告するために使用されます。
pt_br: O objeto DeviceFirmware representa o firmware atual do dispositivo e será usado para relatar o status das ações de download de firmware e atualização de firmware para o Internet of Things Foundation Connect.
zh_cn: DeviceFirmware 对象表示设备的当前固件，并且用于向“Internet of Things Foundation 连接”报告“固件下载”和“固件更新”操作的状态。
zh_tw: DeviceFirmware 物件代表裝置的現行韌體，用來向「Internet of Things Foundation 連接」報告「韌體下載」及「韌體更新」動作的狀態。

source: **2. Inform the server about the Firmware action support**
es: **2. Informar al servidor sobre el soporte de la acción Firmware**
ja: **2. サーバーへのファームウェア操作サポートの通知**
pt_br: **2. Informar o servidor sobre o suporte da ação de firmware**
zh_cn: **2. 向服务器发送有关固件操作支持的信息**
zh_tw: **2. 通知伺服器有關韌體動作支援**

source: The device needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by invoking a following method with a boolean value:
es: Para que el servidor inicie la solicitud de firmware, el dispositivo debe definir el distintivo de la acción de firmware en true. Para ello se puede invocar el siguiente método con un valor booleano:
ja: サーバーがファームウェア・リクエストを開始するには、デバイスは、ファームウェア操作フラグを true に設定する必要があります。これは、ブール値を指定して以下のメソッドを呼び出すことによって行えます。
pt_br: O dispositivo precisa configurar a sinalização de ação de firmware como true para que o servidor inicie a solicitação de firmware. Isso pode ser feito chamando o método a seguir com um valor booleano:
zh_cn: 设备需要将固件操作标记设置为 true，以便服务器发出固件请求。可通过调用以下具有布尔值的方法来实现：
zh_tw: 裝置需要將韌體動作旗標設為 true，伺服器才能起始韌體要求。以布林值呼叫下列方法，便可達成此作業：
