Repository: robert17/iotf-rtd
Catalog: docs/messaging/devices.po-*.po
Languages: de

source: MQTT Connectivity for Devices
de: MQTT-Konnektivität für Einheiten

source: A Device must authenticate using a client ID in the following format:
de: Eine Einheit Muss die Authentifizierung mit einer Client-ID im folgenden Format durchführen:

source: A Device must be registered before it can connect
de: Eine Einheit muss registriert werden, bevor sie eine Verbindung herstellen kann

source: When connecting to the Quickstart service no authentication (or registration) is required
de: Beim Verbinden mit dem Quickstart-Service ist keine Authentifizierung (oder Registrierung) erforderlich

source: MQTT client identifier
de: MQTT-Client-ID

source: Supply a client id of the form **d**:**org\_id**:**device\_type**:**device\_id**
de: Geben Sie eine Client-ID in folgender Form an: **d**:**org\_id**:**device\_type**:**device\_id**

source: **d** idenfities your client as a device
de: **d** kennzeichnet Ihren Einheit als Client

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
de: **org\_id** ist Ihre eindeutige Organisations-ID, die beim Registrieren im Service zugeordnet wird. Die Organisations-ID ist eine alphanumerische Zeichenfolge mit 6 Zeichen.

source: **device\_type** is intended to be used as an identifer of the type of device connecting, it may be useful to think of this as analogous to a model number.
de: **device\_type** wird als Kennung des zu verbindenden Einheitentyps verwendet. Diese Kennung kann man sich als Modellnummer vorstellen.

source: **device\_id** must uniquely identify a device across all devices of a specific device\_type, it may be useful to think of this as analogous to a serial number.
de: **device\_id** musst eine Einheit über alle Einheiten eines bestimmten Einheitentyp (device\_type) eindeutig kennzeichnen. Diese ID kann man sich als Seriennummer vorstellen.

source: MQTT authentication
de: MQTT-Authentifizierung

source: Username
de: Benutzername

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for devices today.
de: Der Service unterstützt zur Zeit nur die tokenbasierte Authentifizierung für Einheiten. Es gibt nur einen gültigen Benutzernamen für Einheiten heute.

source: A value of **use-token-auth** indicates to the service that the authentication token for the device will be passed as the password for the MQTT connection.
de: Der Wert **use-token-auth** teilt einem Service mit, dass das Authentifizierungstoken für die Einheit als Kennwort für die MQTT-Verbindung übergeben wird.

source: Password
de: Kennwort

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
de: Bei der Verwendung der tokenbasierten Authentifizierung übergeben Sie das Einheitenauthentifizierungstoken als Kennwort, wenn Sie Ihre MQTT-Verbindung einrichten.

source: Publishing events
de: Ereignisse publizieren

source: Publish to topic iot-2/evt/\ **event\_id**/fmt/**format\_string**
de: Publizieren in Thema iot-2/evt/\ **event\_id**/fmt/**format\_string**

source: Subscribing to commands
de: Befehle subskribieren

source: Subscribe to topic iot-2/cmd/\ **command\_id**/fmt/**format\_string**
de: Abonnieren von Thema iot-2/cmd/\ **command\_id**/fmt/**format\_string**

source: Quickstart restrictions
de: Quickstart-Einschränkungen

source: If you are writing device code that wants to support use with Quickstart you must take into account the following features present in the registered service that are not supported in Quickstart:
de: Wenn Sie Einheitencode schreiben, der die Verwendung mit Quickstart unterstützt, müssen Sie die folgenden Funktionen berücksichtigen, die im registrierten Service vorhanden sind und nicht in Quickstart unterstützt werden:

source: MQTT connection over SSL
de: MQTT-Verbindung über SSL

source: Clean or durable sessions
de: Bereinigte oder permanente Sitzungen
