Repository: robert17/iotf-rtd
Catalog: docs/messaging/mqtt.po-*.po
Languages: de

source: The primary mechanism that devices and applications use to communicate with the IBM Internet of Things Foundation is MQTT; this is a protocol designed for the efficient exchange of real-time data with sensor and mobile devices.
de: Der primäre Mechanismus, den Einheiten und Anwendungen zur Kommunikation mit IBM Internet of Things Foundation verwenden, ist MQTT; dies ist ein Protokoll, das für den effizienten Austausch von Echtzeitdaten mit Sensoreinheiten und mobilen Geräten konzipiert ist.

source: MQTT runs over TCP/IP and, while it is possible to code directly to TCP/IP, you might prefer to use a library that handles the details of the MQTT protocol for you. You will find there's a wide range of MQTT client libraries available at mqtt.org_, with the best place to start looking being the `Eclipse Paho project`_. IBM contributes to the development and support of many of these libraries.
de: MQTT läuft über TCP/IP. Es ist zwar möglich, dass Sie Code direkt an TCP/IP richten können, Sie können jedoch auch eine Bibliothek verwenden, die die Details des MQTT-Protokolls für Sie übernimmt. Bei mqtt.org_ ist eine große Bandbreite von MQTT-Clientbibliotheken verfügbar; schauen Sie am besten unter `Eclipse Paho project`_ nach. IBM ist an Entwicklung und Unterstützung vieler dieser Bibliotheken beteiligt.

source: MQTT 3.1 is the version of the protocol that is in widest use today. Version 3.1.1 contains a number of minor enhancements, and has been ratified as an OASIS Standard.
de: MQTT 3.1 ist die Version des Protokolls, das am häufigsten heute verwendet wird. Version 3.1.1 enthält eine Reihe kleinerer Erweiterungen und wurde als OASIS-Standard ratifiziert.

source: One reason for using version 3.1.1 is that the maximum length of the MQTT Client Identifier (ClientId) is increased from the 23 character limit imposed by 3.1. The IoT service will often require longer ClientId's and will accept long ClientId's with either version of the protocol however some 3.1 client libraries check the ClientId and enforce the 23 character limit.
de: Eine Grund für die Verwendung von Version 3.1.1 besteht darin, dass die maximale Länge der MQTT-Clientkennung (ClientId) vom 23-Zeichen-Limit (in Version 3.1) erhöht wurde. Der IoT-Service erfordert oft längere Clientkennungen und akzeptiert lange Client-IDs mit jeder Version des Protokolls; einige Clientbibliotheken der Version 3.1 prüfen jedoch die Client-ID und erzwingen ein Limit von 23 Zeichen.

source: MQTT client connection
de: MQTT-Clientverbindung

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for applications and devices in that organization.
de: Jede registrierte Organisation hat einen eindeutigen Endpunkt, der beim Verbinden von MQTT-Clients für Anwendungen und Einheiten in dieser Organisation verwendet werden muss.

source: Unencrypted client connection
de: Nicht verschlüsselte Clientverbindung

source: Connect on port **1883**
de: Verbindung auf Port **1883** herstellen

source: All information your device submits is being sent in plain text (including the authentication credentials for your device). We recommend the use of an encrypted connection whenever possible.
de: Alle Informationen , die Ihre Einheit übergibt, werden in einfachem Text gesendet (einschließlich der Authentifizierungsnachweise für Ihre Einheit). Wir empfehlen ide Verwendung einer verschlüsselten Verbindung wann immer möglich.

source: Encrypted client connection
de: Verschlüsselte Clientverbindung

source: Connect on port **8883** or **443** for websockets.
de: Verbindung auf **8883** oder **443** für Websockets herstellen

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
de: In vielen Clientbibliotheken müssen Sie das öffentliche Zertifikat des Servers im Pem-Format angeben. Die folgende Datei enthält die gesamte Zertifikatskette für \*.messaging.internetofthings.ibmcloud.com: messaging.pem_

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
de: Einige SSL-Clientbibliotheken können keine Platzhalterdomänen handhaben; wenn Sie keine Bibliotheken wechseln können, müssen in diesem Fall die Zertifikatsprüfung inaktivieren.

source: The IoT Foundation requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
de: IoT Foundation erfordert TLS v1.2. Wir empfehlen die folgenden Cipher-Suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 oder AES128-GCM-SHA256 *(ab 1. Juni 2015)*.

source: Device and application clients
de: Einheiten- und Anwendungsclients

source: We define two primary classes of thing: Devices & Applications
de: Wir definieren zwei primäre Klassen bei IoT: Einheiten & Anwendungen

source: The class of thing that your MQTT client identifies itself to the service as will determine the capabilities of your client once connected as well as the mechanism through which you will need to authenticate.
de: Die Thing-Klasse, mit der Ihr MQTT-Client sich gegenüber dem Service identifiziert; dadurch wird die Funktionalität Ihres Clients (wenn verbunden) sowie die Mechanismen, über die Sie sich authentifizieren müssen, bestimmt.

source: Applications and devices also work with different MQTT topic spaces. Devices work within a device-scoped topic space, whereas applications have full access to the topic space for an entire organization.
de: Anwendungen und Einheiten arbeiten auch mit unterschiedlichen MQTT-Topic-Bereichen. Einheiten arbeiten mit einem Topic-Bereich für Einheiten; Anwendungen haben hingegen uneingeschränkten Zugriff auf den Topic-Bereich für eine gesamte Organisation.

source: Quality of service
de: Servicequalität

source: The MQTT protocol provides three qualities of service for delivering messages between clients and servers: "at most once", "at least once" and "exactly once". Events and commands can be sent using any quality of service level, however you should carefully consider whether what the right level is for your needs. It is not a simple case that QoS2 is "better" than QoS0.
de: Das MQTT-Protokoll bietet 3 Servicequalitäten (QoS, Qualities of Service) für die Übermittlung von Nachrichten zwischen Clients und Servern: "Höchstens einmal", "Mindestens einmal" und "Genau einmal". Ereignisse und Befehle können mit jeder Servicequalität gesendet werden; Sie sollten jedoch mit Bedacht die richtige Servicequalität gemäß Ihren Anforderungen auswählen. Nicht immer ist QoS2 "besser" als QoS0.

source: At most once (QoS0)
de: Höchstens einmal (QoS0)

source: The message is delivered at most once, or it might not be delivered at all. Delivery across the network is not acknowledged, and the message is not stored. The message could be lost if the client is disconnected, or if the server fails. QoS0 is the fastest mode of transfer. It is sometimes called "fire and forget".
de: Die Nachricht wird höchstens einmal übermittelt, oder sie wird überhaupt nicht übermittelt. Die Übermittlung über das Netz wird nicht bestätigt, und die Nachricht wird nicht gespeichert. Die Nachricht kann verloren gehen, wenn die Clientverbindung getrennt wird, oder wenn der Server fehlschlägt. QoS0 ist der schnellste Übertragungsmodus. Er wird zuweilen auch als "Fire-and-Forget-Modus" bezeichnet.

source: The MQTT protocol does not require servers to forward publications at QoS0 to a client. If the client is disconnected at the time the server receives the publication, the publication might be discarded, depending on the server implementation.
de: Das MQTT-Protokoll erfordert nicht, dass Server Publizierungen bei QoS0 an einen Client weiterleiten. Wenn die Clientverbindung zu dem Zeitpunkt getrennt wird, wenn der Server die Publizierung empfängt, kann die Publizierung verworfen werden (abhängig von der Serverimplementierung).

source: When sending real-time data on an interval we recommend using QoS0. If a single message goes missing it does not really matter as another message will be sent shortly after containing newer data. In this scenario the extra cost of using higher quality of service does not result in any tangible benefit.
de: Beim Senden von Echtzeitdaten empfehlen wir die Verwendung von QoS0. Wenn eine einzelne Nachricht verloren geht, spielt das keine Rolle, solange eine andere Nachricht mit neueren Daten kurz danach gesendet wird. In diesem Szenario führen die Zusatzkosten bei Verwendung einer höheren Servicequalität zu keinem materiellen Vorteil.

source: At least once (QoS1)
de: Mindestens einmal (QoS1)

source: The message is always delivered at least once. It might be delivered multiple times if there is a failure before an acknowledgment is received by the sender. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again.
de: Die Nachricht wird immer mindestens einmal übermittelt. Sie kann mehrere Male übermittelt werden, wenn ein Fehler vor dem Empfang einer Bestätigung durch den Absender vorliegt. Die Nachricht muss lokal beim Absender gespeichert werden und zwar bis der Absender eine Bestätigung erhält, dass die Nachricht durch den Empfänger publiziert wurde. Die Nachricht wird für den Fall gespeichert, dass sie erneut gesendet werden muss.

source: Exactly once (QoS2)
de: Genau einmal (QoS2)

source: The message is always delivered exactly once. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again. QoS2 is the safest, but slowest mode of transfer. A more sophisticated handshaking and acknowledgement sequence is used than for QoS1 to ensure no duplication of messages occurs.
de: Die Nachricht wird immer genau einmal übermittelt. Die Nachricht muss lokal beim Absender gespeichert werden und zwar bis der Absender eine Bestätigung erhält, dass die Nachricht durch den Empfänger publiziert wurde. Die Nachricht wird für den Fall gespeichert, dass sie erneut gesendet werden muss. QoS2 ist der sicherste aber auch langsamste Übertragungsmodus. Im Gegensatz zu QoS1 wird hier eine ausgereiftere Sequenz für Handshaking und Bestätigung verwendet, so dass sichergestellt ist, dass keine Duplizierung von Nachrichten auftritt.

source: When sending commands we recommend using QoS2. In many cases, when processing commands you want to know that the command will only be actioned, and that it will be actioned only once. This is one of the clearest examples of when the additional overhead of QoS2 has a clear benefit.
de: Beim senden von Befehlen empfehlen wir die Verwendung von QoS2. In vielen Fällen wollen Sie bei der Verarbeitung von Befehlen wissen, dass der Befehl nur einmal aktioniert wird. Dies ist eines der besten Beispiele dafür, wann der zusätzliche Aufwand bei QoS2 einen klaren Vorteil hat und mehr Nutzen bietet.

source: Subscription Buffers and Clean Session
de: Subskriptionspuffer und bereinigte Sitzung

source: Each subscription from either a device or application is allocated a buffer of 5000 messages. This allows for any application or device to fall behind the live data it is processing and build up a backlog of up to 5000 pending messages for each subscription it has made. Once the buffer fills up, any new message will result in the oldest message in the buffer being discarded.
de: Jeder Subskription von entweder einer Einheit oder einer Anwendung wird ein Puffer von 5000 Nachrichten zugeordnet. Dadurch kann jede Anwendung oder jede Einheit hinter den Livedaten, die sie verarbeitet, zurückbleiben und einen Rückstand von bis zu 5000 ausstehenden Nachrichten für jede gemachte Subskription akkumulieren. Die Auffüllung des Puffers führt dazu, dass durch jede neue Nachricht die älteste Nachricht im Puffer gelöscht wird.

source: The subscription buffer can be accessed using MQTT clean session option. If clean session is set to true, a subscriber will start receiving messages from the buffer. If it is false the buffer is reset.
de: Auf den Subskriptionspuffer kann unter Verwendung der MQTT-Option für bereinigte Sitzungen zugegriffen werden. Falls der wert für "Clean Session" auf true gesetzt ist, empfängt der Subskribent Nachrichten aus dem Puffer. Beim Wert false wird der Puffer zurückgesetzt.

source: This limit applies regardless of the quality of service setting used. Thus it is possible that a message sent at QoS1 or QoS2 may not be delivered to an application that is unable to keep up with the messages rate for the subscription(s) it has made.
de: Diese Begrenzung gilt unabhängig von der verwendeten Einstellung für die Servicequalität. Es ist daher möglich, dass eine Nachricht, die um bei QoS1 oder QoS2 gesendet wurde, nicht an eine Anwendung, die nicht mit der Nachrichtenrate für die von dieser Anwendung getroffenen Subskription(en) mithalten kann, übermittelt werden kann.
