Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_mgmt.po
Languages: de

source: Device Management
de: Einheitenmanagement

source: The device management feature enhances the Internet of Things Foundation service with new capabilities for managing devices. This introduction will introduce some of the concepts and features of device management.
de: Von der Einheitenmanagementfunktion wird der Internet of Things Foundation-Service um neue Funktionen zur Verwaltung von Einheiten erweitert. In dieser Einführung werden einige der Konzepte und Funktionen des Einheitenmanagements vorgestellt.

source: What does Device Management add?
de: Was wird vom Einheitenmanagement hinzugefügt?

source: Control and management of device lifecycles for both individual and batches of devices.
de: Steuerung und Management der Lebenszyklen von Einheiten für einzelne Einheiten und Einheitengruppen.

source: Device metadata and status information, enabling the creation of device dashboards and other tools.
de: Einheitenmetadaten und Statusinformationen, die die Erstellung von Einheitendashboards und weiterer Tools ermöglichen.

source: Diagnostic information, both for connectivity to the Internet of Things Foundation service, and device diagnostics.
de: Diagnoseinformationen, sowohl für die Konnektivität zum Internet of Things Foundation-Service als auch Einheitendiagnoseinformationen.

source: Device management commands, like firmware update, and device reboot.
de: Einheitenmanagementbefehle, zum Beispiel für Firmware-Updates und Neustarts von Einheiten.

source: At a more technical level, device management adds:
de: Auf einer eher technischen Ebene wird vom Einheitenmanagement Folgendes hinzugefügt:

source: a device model, that describes the metadata and management characteristics of a device,
de: Ein Einheitenmodell, von dem die Metadaten und Managementeigenschaften einer Einheit beschrieben werden.

source: a ReST API which provides a callable interface for managing devices,
de: Eine REST-API, von der eine aufrufbare Schnittstelle zur Veraltung von Einheiten bereitgestellt wird.

source: and a device management protocol, used for communication between the management agent on the devices and the Internet of Things Foundation.
de: Ein Einheitenmanagementprotokoll, das zur Kommunikation zwischen den Managementagenten der Einheiten und Internet of Things Foundation verwendet wird.

source: Important concepts in device management
de: Wichtige Konzepte für das Einheitenmanagement

source: Managed and Unmanaged Devices
de: Verwaltete und nicht verwaltete Einheiten

source: Device management creates a distinction between managed and unmanaged devices.
de: Vom Einheitenmanagement wird zwischen verwalteten und nicht verwalteten Einheiten unterschieden.

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the Internet of Things Foundation. The device management agent and the Internet of Things Foundation device management service must share an understanding of data formats and communication patterns so they can interpret data correctly.
de: **Verwaltete Einheiten** sind Einheiten, auf denen ein Managementagent installiert ist. Vom Managementagenten werden Einheitenmetadaten gesendet und empfangen sowie auf Einheitenmanagementbefehle von Internet of Things Foundation geantwortet. Vom Einheitenmanagementagenten und vom Internet of Things Foundation-Einheitenmanagementservice müssen übereinstimmende Datenformate und Kommunikationsmuster gemeinsam genutzt werden, damit die Daten von beiden korrekt interpretiert werden können.

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the Internet of Things Foundation. Devices without a device management agent installed can never become managed devices.
de: **Nicht verwaltete Einheiten** sind Einheiten, die nicht über einen Einheitenmanagementagenten verfügen. Der Lebenszyklus jeder Einheit beginnt als nicht verwaltete Einheit; wenn vom Einheitenmanagementagenten die entsprechende Nachricht an Internet of Things Foundation gesendet wird, kann sie zu einer verwalteten Einheit werden. Einheiten ohne installierten Einheitenmanagementagenten können nie zu verwalteten Einheiten werden.

source: Device Model
de: Einheitenmodell

source: The device model is the combination of device metadata and management characteristics of a device. Devices can contain a lot of metadata, including device identifiers, device type and associated identifiers, and device model extensions. For a list of identifiers, see the device model reference documentation.
de: Ein Einheitenmodell ist eine Kombination aus den Einheitenmetadaten und Managementeigenschaften einer Einheit. Einheiten können viele Metadaten enthalten, zum Beispiel Einheitenkennungen, Einheitentypen und zugeordnete Kennungen sowie Einheitenmodellerweiterungen. Eine Liste der Kennungen finden Sie in der Referenzliteratur zum Einheitenmodell.

source: Device Management Protocol
de: Einheitenmanagementprotokoll

source: This protocol is used for device management communication between the Internet of Things Foundation and the management agent on a managed device. The device management protocol is based on MQTT and uses a different set of topics than the regular device messaging protocol. The device management agent of a device must implement the device management protocol in order to enable device management functions.
de: Dieses Protokoll wird für die Einheitenmanagementkommunikation zwischen Internet of Things Foundation und dem Managementagenten auf einer verwalteten Einheit verwendet. Das Einheitenmanagementprotokoll basiert auf MQTT und verwendet eine abweichende Themenmenge, die vom regulären Einheitennachrichtenprotokoll nicht bereitgestellt wird. Vom Einheitenmanagementagenten einer Einheit muss das Einheitenmanagementprotokoll implementiert werden, damit die Einheitenmanagementfunktionen aktiviert werden können.

source: Device Identifiers
de: Einheitenkennungen

source: Manufactured devices come with a variety of identifiers, such as model and serial number. Each identifier can be considered a separate namespace, but the combination of identifiers which uniquely identify a specific device is customer dependent and may be very complex.
de: Gefertigte Einheiten werden mit einer Vielzahl an Kennungen geliefert, zum Beispiel einer Modellnummer und einer Seriennummer. Jede Kennung kann als gesonderter Namensbereich betrachtet werden, die Kombinationen der Kennungen, mit denen eine Einheit eindeutig identifiziert werden kann, ist vom Kunden abhängig und kann sehr komplex sein.

source: In order to accommodate this complexity, the device management standards have defined many types of identifier, and these are represented in the core device model. See the Device Model Attributes reference document for more detailed information on device identifiers and attributes.
de: Um dieser Komplexität gerecht zu werden, wurden als Einheitenmanagementstandards viele Kennungstypen definiert, die auch im Basiseinheitenmodell enthalten sind. Detaillierte Informationen zu Einheitenkennungen und Attributen finden Sie im Referenzdokument zu den Einheitenmodellattributen.

source: A management agent is a collection of logic installed on a device which allows it to connect to the Internet of Things Foundation service as a managed device. The management agent understands the metadata and device management commands used in the device management messaging protocol. Without a management agent, devices cannot use the device management messaging protocol and so cannot become managed devices.
de: Ein Managementagent ist ein Logikbaustein, der auf einer Einheit installiert wird, mit dem als verwaltete Einheit eine Verbindung zum Internet of Things Foundation-Service aufgebaut werden kann. Der Managementagent versteht die Metadaten und Einheitenmanagementbefehle, die im Nachrichtenprotokoll des Einheitenmanagements verwendet werden. Ohne einen Managementagenten kann eine Einheit das Nachrichtenprotokoll des Einheitenmanagements nicht verwenden und somit auch nicht zu einer verwalteten Einheit werden.

source: The Device Management Lifecycle
de: Lebenszyklus im Einheitenmanagement

source: A device and its associated device type are created in the Internet of Things Foundation using the dashboard or REST API.
de: Eine Einheit und ihr zugeordneter Einheitentyp werden von Internet of Things Foundation mithilfe eines Dashboards oder einer REST-API erstellt.

source: The device connects to the Internet of Things Foundation and uses the 'Manage Device' operation to become a managed device.
de: Von der Einheit wird eine Verbindung zu Internet of Things Foundation hergestellt und die Operation 'Einheit verwalten' verwendet, um zu einer verwalteten Einheit zu werden.

source: The device's metadata, as described in the Device Model can now be viewed and manipulated through device operations, for example, firmware update and device reboot.
de: Die Metadaten der Einheit können jetzt wie im Einheitenmodell beschrieben angezeigt und mithilfe von Einheitenoperationen geändert werden, zum Beispiel durch ein Firmware-Update oder einen Neustart der Einheit.

source: The device can communicate updates through the device-management protocol, such as location or diagnostic information and error codes.
de: Von der Einheit können Aktualisierungen über das Einheitenmanagementprotokoll kommuniziert werden, zum Beispiel die Position oder Diagnoseinformationen und Fehlercodes.

source: In order to provice a way to deal with defunct devices in large device populations, the 'Manage device' operation request has an optional lifetime parameter. This lifetime parameter is the number of seconds within which the device must make another 'Manage device' request in order to avoid being marked as dormant and becoming an unmanaged device.
de: Zur Handhabung von nicht mehr vorhandenen Einheiten in Umgebungen mit einer großen Anzahl an Einheiten wird von der Anforderung der Operation 'Einheit verwalten' ein optionaler Parameter für den Lebenszyklus bereitgestellt. Dieser Lebenszyklusparameter gibt den Zeitraum als Anzahl der Sekunden an, in dem eine Einheit eine weitere Anforderung des Typs 'Einheit verwalten' senden muss, um zu vermeiden, dass sie als 'ruhend' angesehen und zu einer nicht verwalteten Einheit wird.

source: When a device is decommissioned it can be removed from the Internet of Things Foundation using the dashboard or REST API.
de: Wenn eine Einheit stillgelegt wird, kann sie mithilfe des Dashboards oder der REST-API von Internet of Things Foundation entfernt werden.
