Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/security.po
Languages: de, pt_br, zh_tw

source: Securing the Internet of Things
de: Internet of Things schützen
pt_br: Protegendo o Internet of Things
zh_tw: 保護 Internet of Things 安全

source: The IBM Internet of Things Foundation (IoT Foundation) is a fully managed, cloud-hosted service that makes it simple to derive value from Internet of Things (IoT) devices.
de: IBM Internet of Things Foundation (IoT Foundation) ist ein voll-verwalteter, cloud-hosted Service, der es Ihnen ermöglicht, Nutzen aus den IoT-Einheiten zu ziehen.
pt_br: O IBM Internet of Things Foundation (IoT Foundation) é um serviço totalmente gerenciado, hospedado em nuvem que torna simples derivar o valor de dispositivos do Internet of Things (IoT).
zh_tw: IBM Internet of Things Foundation (IoT Foundation) 是一種全面管理的雲端代管服務，能夠輕易從 Internet of Things (IoT) 裝置衍生值。

source: The following document aims to answer common questions about how your organization's data is protected. Focusing on specific areas:
de: Im folgenden Dokument sollen Antworten auf die häufig gestellten Fragen gegeben werden, wie die Daten Ihrer Organisation geschützt werden. Folgende Bereiche stehen im Blickpunkt:
pt_br: O documento a seguir tem como objetivo responder a perguntas comuns sobre como os dados de sua organização são protegidos. Focando em áreas específicas:
zh_tw: 下列文件旨在回答關於如何保護組織資料的一般問題。聚焦在特定區域：

source: Authentication: assuring the identity of users, devices or applications attempting to access your organization's information.
de: Authentifizierung: Sicherstellung der Identität von Benutzern, Einheiten oder Anwendungen, die auf die Informationen Ihrer Organisation zugreifen.
pt_br: Autenticação: assegurar a identidade de usuários, dispositivos ou aplicativos tentando acessar informações de sua organização.
zh_tw: 鑑別：確保試圖存取您組織資訊的使用者、裝置或應用程式的身分。

source: Authorization: assuring that users, devices and applications have permission to access your organization's information.
de: Berechtigung: Sicherstellung, dass Benutzer, Einheiten und Anwendungen die Berechtigung zum Zugriff auf die Informationen Ihrer Organisation haben.
pt_br: Autorização: assegurar que usuários, dispositivos e aplicativos tenham permissão para acessar informações de sua organização.
zh_tw: 授權：確保使用者、裝置及應用程式有權限存取您組織的資訊。

source: Encryption: assuring that data is only readable by authorized parties and cannot be intercepted.
de: Verschlüsselung: Sicherstellung, dass Daten nur von berechtigten Personen gelesen und nicht abgefangen werden können.
pt_br: Criptografia: assegurar que dados sejam legíveis apenas por partes autorizadas e não possam ser interceptados.
zh_tw: 加密：確保資料只有獲授權一方可以讀取，而且不能被截取。

source: Terminology
de: Terminologie
pt_br: Terminologia
zh_tw: 名詞解釋

source: How do we secure management of your organization?
de: Wie sichern wir die Verwaltung Ihrer Organisation?
pt_br: Como nós protegemos o gerenciamento de sua organização?
zh_tw: 如何保護組織管理的安全？

source: The browser-based GUI and REST APIs are fronted by HTTPS, with a certificate signed by DigiCert enabling you to trust that you're connecting to the genuine IoT Foundation.
de: Die browserbasierte Benutzerschnittstelle (GUI) und die REST APIs laufen unter HTTPS; mit einem von DigiCert signierten Zertifikat gehen Sie sicher, dass Sie auch wirklich eine Verbindung zu IoT Foundation herstellen.
pt_br: A GUI e as APIs REST baseadas no navegador são fronteadas por HTTPS, com um certificado assinado por DigiCert permitindo que você confie que está conectando ao IoT Foundation genuíno.
zh_tw: 瀏覽器型 GUI 和 REST API 是在 HTTPS 前面，具有 DigiCert 所簽署的憑證，讓您相信您是要連接到真正的 IoT Foundation。

source: GUI: authenticated via your IBM ID.
de: GUI: über Ihre IBM ID authentifiziert.
pt_br: GUI: autenticada por meio de seu ID IBM.
zh_tw: GUI：透過 IBM ID 進行鑑別。

source: REST API: once you create an API key through the GUI, you can use this to make authenticated REST calls against your organization.
de: REST API: nachdem Sie einen API-Schlüssel über die GUI-Benutzerschnittstele erstellt haben, können Sie diesen Schlüssel verwenden, um authentifizierte RESTA-Aufrufe gegen Ihre Organisation durchzuführen.
pt_br: API REST: depois de criar uma chave API por meio da GUI, você pode usar isso para fazer chamadas REST autenticadas em sua organização.
zh_tw: REST API：透過 GUI 建立 API 金鑰之後，您可以利用它對組織發出已鑑別的 REST 呼叫。

source: How do we secure your device and application credentials?
de: Wie sichern wir die Identifikationsdaten für Ihre Einheit und Anwendung?
pt_br: Como nós protegemos suas credenciais de dispositivo e aplicativo?
zh_tw: 如何保護裝置和應用程式認證的安全？

source: When devices are registered or API keys are generated, the authentication token is salted and hashed. This means your organization's credentials can never be recovered from our systems - even in the unlikely event that the IoT Foundation is compromised.
de: Wenn Einheiten registriert oder API-Schlüssel generiert werden, wird das Authentifizierungstoken salted und hashed. Dies bedeutet, dass die Identifikationsdaten Ihrer Organisation niemals wieder von unseren Systemen wiederhergestellt werden können - auch nicht in dem sehr unwahrscheinlichen Fall, dass IoT Foundation kompromittiert wird.
pt_br: Quando os dispositivos são registrados ou as chaves API são geradas, o token de autenticação tem salt e hash. Isso significa que as credenciais de sua organização nunca podem ser recuperadas de nossos sistemas - mesmo no caso improvável de o IoT Foundation estar comprometido.
zh_tw: 當登錄裝置或產生 API 金鑰時，鑑別記號有冗餘字串，而且為雜湊方式。這表示組織的認證絕對無法從我們的系統中回復 - 即使是發生 IoT Foundation 受損的極罕見事件也是如此。

source: Device credentials and API keys can be individually revoked if they are compromised.
de: Die Identifikationsdaten von Einheiten und API-Schlüssel können einzeln widerrufen werden, wenn diese kompromittiert wurden.
pt_br: As credenciais de dispositivo e as chaves API podem ser individualmente revogadas se estiverem comprometidas.
zh_tw: 裝置認證和 API 金鑰如已受損，可以個別予以撤銷。

source: How do we ensure your devices connect securely to the IoT Foundation?
de: Wie stellen wir sicher, dass Ihre Einheiten eine sichere Verbindung zu IoT Foundation herstellen?
pt_br: Como asseguramos que seus dispositivos se conectem com segurança ao IoT Foundation?
zh_tw: 如何確保裝置安全連接到 IoT Foundation？

source: Devices connect through a unique combination of clientId and authentication token that only you know.
de: Einheiten stellen die Verbindung über eine eindeutige Kombination aus Client-ID (clientId) und Authentifizierungstoken her. Nur Sie kennen das Authentifizierungstoken.
pt_br: Os dispositivos se conectam por meio de uma combinação exclusiva de clientId e token de autenticação que apenas você conhece.
zh_tw: 裝置是透過 clientId 和只有您才知道的鑑別記號的唯一組合來進行連接。

source: Full support for connectivity over TLS (v1.2) is provided.
de: Vollständige Unterstützung für die Konnektivität über TLS (v1.2) wird bereitgestellt.
pt_br: É fornecido suporte total para conectividade sobre TLS (v1.2).
zh_tw: 已提供對透過 TLS（1.2 版）之連線功能的全面支援。

source: Open standards are used (MQTT v3.1.1) to allow easy interop across many platforms and languages.
de: Offene Standards werden verwendet (MQTT v3.1.1), damit eine eine einfache Interoperabilität zwischen vielen Plattformen und Sprachen ermöglicht wird.
pt_br: Padrões abertos são usados (MQTT v3.1.1) para permitir uma fácil interoperabilidade através de várias plataformas e linguagens.
zh_tw: 使用開放式標準（MQTT 3.1.1 版），使許多平台和語言之間的交互作業變容易。

source: How do we prevent data leaking between devices?
de: Wie verhindern wir, dass es zwischen Einheiten Datenlecks gibt?
pt_br: Como evitamos o vazamento de dados entre dispositivos?
zh_tw: 如何防止裝置之間洩漏資料？

source: Secure messaging patterns are baked in. Once authenticated, devices are only authorized to publish and subscribe to a restricted topic space:
de: Es werden sichere Nachrichtenmuster verwendet. Nach erfolgter Authentifizierung sind Einheiten nur dazu berechtigt, auf einem eingeschränkten Topic-Bereich zu publizieren und diesen zu subskribieren:
pt_br: Padrões de mensagens seguros são produzidos. Depois de autenticados, os dispositivos são autorizados apenas a publicar e assinar um espaço de tópico restrito:
zh_tw: 會存入安全傳訊型樣。鑑別之後，裝置僅獲授權來發佈和訂閱受限主題空間：

source: All devices work with the same topic space. The authentication credentials provided by the client connecting dictate to which device this topic space will be scoped by the IoT Foundation. This prevents devices from being able to impersonate another device.
de: Alle Einheiten arbeiten mit dem selben Topic-Bereich. Die Authentifizierungsnachweise, die von dem sich verbindenden Client bereitgestellt werden, diktieren, auf welche Einheit dieser Topic-Bereich durch IoT Foundation platziert wird. Dadurch wird verhindert, dass Einheiten die Identität von anderen Einheiten annehmen können.
pt_br: Todos os dispositivos funcionam com o mesmo espaço de tópico. As credenciais de autenticação fornecidas pelo cliente que está se conectando ditam para qual dispositivo esse espaço de tópico terá escopo pelo IoT Foundation. Isso evita que os dispositivos possam personificar outro dispositivo.
zh_tw: 所有裝置使用相同的主題空間。所連接用戶端提供的鑑別認證指定 IoT Foundation 會將此主題空間限定在哪個裝置。這可防止裝置假冒另一個裝置。

source: The only way to impersonate another device is by obtaining compromised security credentials for the device.
de: Die einzige Möglichkeit, die Identität einer anderen Einheit anzunehmen, besteht darin, dass man kompromittierte Sicherheitsberechtigungsnachweise für die Einheit erhält.
pt_br: A única maneira de personificar outro dispositivo é obtendo credenciais de segurança comprometidas para o dispositivo.
zh_tw: 假冒另一個裝置的唯一方式是取得該裝置已洩露的安全認證。

source: Applications can subscribe and publish on both the event and command topics for all devices in the organization. Applications can analyse data from many devices simultaneously, and can also simulate or proxy devices in addition to forming the complementary side of a full duplex communication loop.
de: Anwendungen können sowohl Ereignis- als auch Befehls-Topics subskribieren und darauf publizieren, und zwar für alle Einheiten in der Organisation. Anwendungen können Daten aus vielen Einheiten gleichzeitig analysieren und können darüber hinaus Proxy-Einheiten simulieren, zusätzlich zur Bildung der ergänzenden Rolle einer Vollduplexübertragungsschleife.
pt_br: Os aplicativos podem assinar e publicar em ambos os tópicos de evento e de comando para todos os dispositivos na organização. Os aplicativos podem analisar dados de muitos dispositivos simultaneamente e também podem simular dispositivos de proxy além de formar o lado complementar de um loop de comunicação full duplex.
zh_tw: 應用程式可針對組織中所有裝置的事件和指令主題進行訂閱及發佈。應用程式可同步分析來自許多裝置的資料，而且，除了形成全雙工通訊迴圈的互補面之外，還可以模擬或代理裝置。

source: How do we prevent data leaking between organizations?
de: Wie verhindern wir, dass es zwischen Organisationen Datenlecks gibt?
pt_br: Como evitamos o vazamento de dados entre organizações?
zh_tw: 如何防止組織之間洩漏資料？

source: The topic space in which devices and applications operate is scoped within a single organization. When authenticated, the IoT Foundation transforms the topic structure using an organization ID based on the client authentication, making it impossible for data from one organization to be accessed from another.
de: Der Topic-Bereich, in dem Einheiten und Anwendungen operieren, befindet sich bereichsorientiert innerhalb einer einzigen Organisation. Nach Authentifizierung wandelt IoT Foundation die Topic-Struktur um, und zwar unter Verwendung einer Organisations-ID, die auf der Clientauthentifizierung basiert. Dadurch ist es unmöglich, dass auf Daten von einer Organisation durch eine andere Organisation zugegriffen werden kann.
pt_br: O espaço de tópico no qual os dispositivos e aplicativos operam terá escopo dentro de uma única organização. Quando autenticado, o IoT Foundation transforma a estrutura de tópico usando um ID de organização baseado na autenticação de cliente, impossibilitando que os dados de uma organização sejam acessados de outra.
zh_tw: 裝置和應用程式操作所在的主題空間限定在單一組織內。鑑別後，IoT Foundation 會根據用戶端鑑別，使用組織 ID 轉換主題結構，使得某個組織的資料無法從另一個組織進行存取。
