Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/Extra_Examples.po
Languages: fr, it, zh_cn, zh_tw

source: Examples
fr: Exemples
it: Esempi:
zh_cn: 示例
zh_tw: 範例

source: These examples illustrate the API and the behaviour of the device management agent.
fr: Les exemples suivants présentent l'API et le comportement de l'agent de gestion des terminaux.
it: Questi esempi illustrano l'API e il comportamento dell'agent di gestione del dispositivo.
zh_cn: 这些示例演示了该 API 以及设备管理代理程序的行为。
zh_tw: 這些範例說明 API 及裝置管理代理程式的行為。

source: Device Location
fr: Emplacement d'un terminal
it: Ubicazione dispositivo
zh_cn: 设备位置
zh_tw: 裝置位置

source: An administrator wants to update the location for a device in the Internet of Things Foundation, perhaps using information from a mobile device. A device would use an equivalent mechanismbased on MQTT.
fr: Un administrateur veut mettre à jour l'emplacement d'un terminal dans Internet of Things Foundation en utilisant par exemple les informations d'un terminal mobile. Un terminal utilisera un mécanisme équivalent basé sur MQTT.
it: Un amministratore desidera aggiornare l'ubicazione per un dispositivo in Internet of Things Foundation, forse utilizzando le informazioni provenienti da un dispositivo mobile. Un dispositivo utilizzerebbe un meccanismo equivalente basato su MQTT.
zh_cn: 管理员可能想要使用移动设备中的信息来更新 Internet of Things Foundation 中某个设备的位置。设备将使用基于 MQTT 的同等机制。
zh_tw: 管理者要在 Internet of Things Foundation 中更新裝置的位置，可能還要使用行動式裝置中的資訊。裝置可能會使用基於 MQTT 的同等機制。

source: Example Request:
fr: Exemple de demande :
it: Richiesta di esempio:
zh_cn: 请求示例：
zh_tw: 範例要求：

source: Request Body
fr: Corps de la demande
it: Corpo della richiesta
zh_cn: 请求主体
zh_tw: 要求內文

source: Device Reboot
fr: Réamorçage du terminal
it: Riavvio dispositivo
zh_cn: 设备重新引导
zh_tw: 裝置重新開機

source: An administrator wants to reboot a device from the device dashboard. This is a long-running asyncronous process.
fr: Un administrateur souhaite réamorcer un terminal à partir du tableau de bord associé. Ce processus est un processus asynchrone à exécution longue.
it: Un amministratore desidera riavviare un dispositivo dal dashboard dispositivo. Questo è un processo asincrono a lunga durata.
zh_cn: 管理员想要从设备仪表板中重新引导设备。这是一个长时间运行的异步过程。
zh_tw: 管理者要從裝置儀表板重新啟動裝置。這是長時間執行的非同步程序。

source: Request body
fr: Corps de la demande
it: Corpo della richiesta
zh_cn: 请求主体
zh_tw: 要求內文

source: Sequence:
fr: Séquence :
it: Sequenza:
zh_cn: 序列：
zh_tw: 順序：

source: REST API is issued to the Internet of Things device management server.
fr: L'API REST est lancée sur le serveur de gestion des terminaux IoT.
it: L'API REST viene emessa al server di gestione dispositivo di Internet of Things.
zh_cn: 向物联网设备管理服务器发出 REST API。
zh_tw: REST API 已發出至「物聯網」裝置管理伺服器。

source: The Internet of Things Foundation published a command to reboot the device.
fr: Internet of Things Foundation a publié une commande pour réamorcer le terminal.
it: Internet of Things Foundation ha pubblicato un comando per riavviare il dispositivo.
zh_cn: Internet of Things Foundation 发出了一条命令来重新引导设备。
zh_tw: Internet of Things Foundation 已發佈將裝置重新開機的指令。

source: REST API returns. A management request document is created which can be queried to keep track of the progress of the request.
fr: L'API REST renvoie des données. Un document de demande de gestion est créé. Vous pouvez l'interroger pour suivre la progression de la demande.
it: Restituzione API REST. Viene creato un documento di richiesta di gestione che può essere interrogato per tenere traccia dell'avanzamento della richiesta.
zh_cn: REST API 将会返回。这会创建一个管理请求文档，可查询该文档来跟踪该请求的进度。
zh_tw: 傳回 REST API。建立管理要求文件，可用來查詢以追蹤要求進度。

source: When the device is connectd, it receives the command and reboots.
fr: Une fois connecté, le terminal reçoit la commande et est réamorcé.
it: Quando il dispositivo è connesso, esso riceve il comando e si riavvia.
zh_cn: 连接设备后，设备会收到此命令并重新引导。
zh_tw: 當裝置連接時，它會收到指令並重新開機。

source: When the device restarts, it updates its device management registration.
fr: Lors de son redémarrage, le terminal met à jour son enregistrement de gestion.
it: Quando il dispositivo si riavvia, aggiorna la registrazione di gestione dispositivo.
zh_cn: 设备重新启动后，它会更新其设备管理注册。
zh_tw: 當裝置重新啟動時，它會更新其裝置管理登錄。

source: Firmware update
fr: Mise à jour du microprogramme
it: Aggiornamento firmware
zh_cn: 固件更新
zh_tw: 韌體更新

source: An administrator wants to initiate a firmware update on a device from the device dashboard. This is a long-running, asynchronous process. There are two separate steps here, downloading and updating.
fr: Un administrateur souhaite lancer une mise à jour du microprogramme d'un terminal à partir du tableau de bord associé. Ce processus est un processus asynchrone à exécution longue. Il comprend deux étapes distinctes, à savoir le téléchargement et la mise à jour.
it: Un amministratore desidera avviare un aggiornamento firmware su un dispositivo dal dashboard dispositivo. Questo è un processo asincrono a lunga durata. Esistono due fasi separate qui, lo scaricamento e l'aggiornamento.
zh_cn: 管理员想要从设备仪表板中对某个设备启动固件更新。这是一个长时间运行的异步过程。此处分为两个单独的步骤：下载和更新。
zh_tw: 管理者要從裝置儀表板在裝置上起始韌體更新。這是長時間執行的非同步程序。這裡有兩個不同的步驟：下載及更新。

source: Request 1:
fr: Demande 1 :
it: Richiesta 1:
zh_cn: 请求 1：
zh_tw: 要求 1：

source: Request Body:
fr: Corps de la demande :
it: Corpo della richiesta:
zh_cn: 请求主体：
zh_tw: 要求內文：

source: REST API is issued to the Internet of Things Foundation.
fr: L'API REST est lancée dans Internet of Things Foundation.
it: L'API REST viene emessa a Internet of Things Foundation.
zh_cn: 向 Internet of Things Foundation 发出 REST API。
zh_tw: REST API 已發出至 Internet of Things Foundation。

source: The Internet of Things Foundation published an update to the mgmt.firmware section of the device's metadata containing the package URL. An observation request is scheduled for the status of the firmware update.
fr: Internet of Things Foundation a publié une mise à jour de la section mgmt.firmware dans les métadonnées du terminal, qui contient l'URL du module. Une demande d'observation est planifiée pour le statut de la mise à jour du microprogramme.
it: Internet of Things Foundation ha pubblicato un aggiornamento alla sezione mgmt.firmware dei metadati del dispositivo contenente l'URL del pacchetto. È pianificata una richiesta di osservazione per lo stato dell'aggiornamento del firmware.
zh_cn: Internet of Things Foundation 发布了对设备元数据中 mgmt.firmware 部分的更新（其中包括包 URL）。这样会调度一个观察请求，以了解固件更新的状态。
zh_tw: Internet of Things Foundation 已發佈更新至裝置 meta 資料（包含套件 URL）的 mgmt.firmware 區段。會排程觀察要求，以取得韌體更新的狀態。

source: A command is published to the device to download the firmware package.
fr: Une commande est publiée sur le terminal pour télécharger le module du microprogramme.
it: Un comando viene pubblicato sul dispositivo per scaricare il pacchetto del firmware.
zh_cn: 向设备发出一条命令来下载固件包。
zh_tw: 發佈指令至裝置以下載韌體套件。

source: The Internet of Things Foundation updates the firmware section of the device's metadata, replacing the existing data.
fr: Internet of Things Foundation met à jour la section relative au microprogramme dans les métadonnées du terminal en remplaçant les données existantes.
it: Internet of Things Foundation aggiorna la sezione firmware dei metadati del dispositivo, sostituendo i dati esistenti.
zh_cn: Internet of Things Foundation 将更新设备元数据中的 firmware 部分，以替换现有数据。
zh_tw: Internet of Things Foundation 會更新裝置 meta 資料的韌體區段，並取代現有的資料。

source: When the device is connected, it receives the update to the mgmt.firmware section of its metadata containing the package URL, the observation request and the command.
fr: Une fois connecté, le terminal reçoit la mise à jour de la section mgmt.firmware de ses métadonnées, qui contient l'adresse URL du module, la demande d'observation et la commande.
it: Quando il dispositivo è connesso, riceve l'aggiornamento alla sezione mgmt.firmware dei suoi metadati contenente l'URL del pacchetto, la richiesta di osservazione e il comando.
zh_cn: 连接设备后，设备会收到对其元数据中 mgmt.firmware 部分的更新（其中包括包 URL、观察请求和命令）。
zh_tw: 當裝置連接時，它會收到其 meta 資料（包含套件 URL）之 mgmt.firmware 區段的更新、觀察要求及指令。

source: The device sets its firmware status to 1 (Downloading) and initiates the download.
fr: Le terminal associe le statut de son microprogramme à la valeur 1 (Téléchargement en cours) et lance le téléchargement.
it: Il dispositivo imposta il suo stato di firmware su 1 (Scaricamento) e inizia lo scaricamento.
zh_cn: 设备会将其固件状态设置为 1（正在下载）并启动下载。
zh_tw: 裝置會將其韌體狀態設為 1（下載）並起始下載作業。

source: When the firmware is downloaded, the device changes the firmware status to 2 (Downloaded) and sends a notification to the Internet of Things Foundation.
fr: Une fois le microprogramme téléchargé, le terminal associe le statut correspondant à la valeur 2 (Téléchargé) et envoie une notification à Internet of Things Foundation.
it: Quando il firmware viene scaricato, il dispositivo modifica lo stato del firmware in 2 (Scaricato) e invia una notifica a Internet of Things Foundation.
zh_cn: 下载固件后，设备会将固件状态更改为 2（已下载）并向 Internet of Things Foundation 发送通知。
zh_tw: 韌體下載後，裝置會將韌體狀態變更為 2（已下載），並傳送通知給 Internet of Things Foundation。

source: The Internet of Things Foundation updates the firmware section of the device's metadata.
fr: Internet of Things Foundation met à jour la section relative au microprogramme dans les métadonnées du terminal.
it: Internet of Things Foundation aggiorna la sezione firmware dei metadati del dispositivo.
zh_cn: Internet of Things Foundation 将更新设备元数据中的 firmware 部分。
zh_tw: Internet of Things Foundation 會更新裝置 meta 資料的韌體區段。

source: Request 2:
fr: Demande 2 :
it: Richiesta 2:
zh_cn: 请求 2：
zh_tw: 要求 2：

source: The command is published to update the device firmware to the downloaded package.
fr: La commande est publiée pour mettre à jour le microprogramme du terminal dans le module téléchargé.
it: Il comando viene pubblicato per aggiornare il firmware del dispositivo con il pacchetto scaricato.
zh_cn: 发出此命令以使用已下载的软件包来更新设备固件。
zh_tw: 發佈指令將裝置韌體更新為已下載的套件。

source: The firmware section of the device's metadata is updated.
fr: La section relative au microprogramme est mise à jour dans les métadonnées du terminal.
it: La sezione del firmware dei metadati del dispositivo viene aggiornata.
zh_cn: 已更新设备元数据中的 firmware 部分。
zh_tw: 裝置 meta 資料的韌體區段即會更新。

source: The REST API returns and a management request document is created which can be queried to keep track of the progress of the request.
fr: L'API REST renvoie des données et un document de demande de gestion est créé. Vous pouvez l'interroger pour suivre la progression de la demande.
it: L'API REST restituisce e viene creato un documento di richiesta di gestione che può essere interrogato per tenere traccia dell'avanzamento della richiesta.
zh_cn: REST API 将会返回，并会创建一个管理请求文档，可以查询该文档来跟踪该请求的进度。
zh_tw: 傳回 REST API 並建立管理要求文件，可用來查詢以追蹤要求進度。

source: When the device is connected, it receives the command and begins the firmware update.
fr: Une fois connecté, le terminal reçoit la commande et lance la mise à jour du microprogramme.
it: Quando il dispositivo è connesso, riceve il comando ed inizia l'aggiornamento del firmware.
zh_cn: 连接设备后，设备会收到此命令并开始更新固件。
zh_tw: 當裝置連接時，它會收到指令並開始韌體更新。

source: Assuming the firmware update was successful, the device changes the firmware update status to 0 (Success) and sends a notification to the Internet of Things Foundation.
fr: Si la mise à jour du microprogramme aboutit, le terminal modifie le statut correspondant en indiquant 0 (Réussite) et envoie une notification à Internet of Things Foundation.
it: Presumendo che l'aggiornamento del firmware è riuscito, il dispositivo modifica lo stato del firmware in 0 (Riuscito) e invia una notifica a Internet of Things Foundation.
zh_cn: 假设固件更新成功，设备会将固件更新状态更改为 0（成功）并向 Internet of Things Foundation 发送通知。
zh_tw: 假設韌體更新成功，裝置會將韌體更新狀態變更為 0（成功），並傳送通知給 Internet of Things Foundation。
