Repository: robert17/iotf-rtd
Catalog: docs/libraries/python.po-*.po
Languages: es, it, ko, zh_hans

source: Python Client Library - Introduction
es: Biblioteca de cliente Python - Introducción
it: Libreria client Python - Introduzione
ko: Python 클라이언트 라이브러리 - 소개
zh_hans: Python 客户机库 - 简介

source: Use the Python module for interacting with the `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ and to automate commands using Python 3.4 or 2.7. The module can be used to simplify interactions with the IBM Internet of Things Foundation. The following libraries contain instructions and guidance on using the python ibmiotf module to interact with devices and applications within your organizations.
es: Utilice el módulo Python para interactuar con `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ y automatizar los mandatos utilizando Python 3.4 o 2.7. El módulo se puede utilizar para simplificar las interacciones con IBM Internet of Things Foundation. Las bibliotecas siguientes contienen instrucciones y orientación sobre la utilización del módulo de python ibmiotf para interactuar con los dispositivos y las aplicaciones en las organizaciones.
it: Utilizzare il modulo Python per interagire con 'IBM Internet of Things Foundation <https Foundation://internetofthings.ibmcloud.com>`_ e per automatizzare i comandi utilizzando Python 3.4 o 2.7. Il modulo può essere utilizzato per semplificare le interazioni con IBM Internet of Things Foundation. Le seguenti librerie contengono istruzioni ed orientamenti sull'utilizzo del modulo ibmiotf python per interagire con i dispositivi e le applicazioni all'interno dell'organizzazione.
ko: `IBM Internet of Things Foundation(<https://internetofthings.ibmcloud.com>)`과 상호작용하고 Python 3.4 또는 2.7을 사용하여 명령을 자동화하기 위해 Python 모듈을 사용하십시오. 이 모듈은 IBM Internet of Things Foundation과의 상호작용을 단순화하는 데 사용할 수 있습니다. 다음의 라이브러리에는 Python ibmiotf 모듈을 사용하여 조직 내 디바이스 및 애플리케이션과 상호작용하는 것에 대한 지시사항 및 지침이 포함되어 있습니다.
zh_hans: 使用 Python 模块以与 `IBM Internet of Things Foundation <https://internetofthings.ibmcloud.com>`__ 进行交互，从而使用 Python 3.4 或 2.7 自动执行命令。可使用此模块简化与 IBM Internet of Things Foundation 的交互。以下库包含有关使用 python ibmiotf 模块与组织中设备和应用程序进行交互的指示信息和指南。

source: Note: Support for MQTT over SSL requires at least Python v2.7.9 or v3.4, and openssl v1.0.1
es: Nota: El soporte para MQTT sobre SSL necesita como mínimo Python v2.7.9 o v3.4 y openssl v1.0.1
it: Nota: il supporto per MQTT su SSL richiede almeno Python v2.7.9 o v3.4, e openssl v1.0.1
ko: 참고: SSL을 통한 MQTT에 대한 지원을 사용하려면 최소한 Python v2.7.9 또는 v3.4 및 openssl v1.0.1이 필요함
zh_hans: 注：对 MQTT over SSL 的支持至少需要 Python V2.7.9 或 V3.4 和 openssl V1.0.1

source: This client library is divided into two sections, both included within the library. The Devices section contains information on how devices publish events and handle commands using the Python ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
es: Esta biblioteca de cliente se divide en dos secciones, ambas incluidas en la biblioteca. La sección Dispositivos contiene información sobre cómo los dispositivos publican sucesos y manejan mandatos utilizando el módulo de Python ibmiotf y la sección Aplicaciones contiene información sobre cómo las aplicaciones pueden utilizar el módulo ibmiotf para interactuar con los dispositivos.
it: Questa libreria client è divisa in due sezioni, entrambe incluse all'interno della libreria. La sezione Dispositivi contiene informazioni su come i dispositivi pubblicano gli eventi e gestiscono i comandi tramite l'utilizzo del modulo ibmiotf Python, e la sezione Applicazioni contiene informazioni su come le applicazioni possono utilizzare il modulo ibmiotf per interagire con i dispositivi.
ko: 이 클라이언트 라이브러리는 두 개의 절로 구성되며 두 개의 절 모두 라이브러리에 포함되어 있습니다. 디바이스 절에는 디바이스가 Python ibmiotf 모듈을 사용하여 이벤트를 공개하고 명령을 처리하는 방법에 대한 정보가 포함되어 있고 애플리케이션 절에는 애플리케이션이 ibmiotf 모듈을 사용하여 디바이스와 상호작용하는 방법에 대한 정보가 포함되어 있습니다.
zh_hans: 此客户机库划分为两个部分，均包含在库中。“设备”部分包含有关设备如何使用 Python ibmiotf 模块发布事件和处理命令的信息，“应用程序”部分包含有关应用程序可如何使用 ibmiotf 模块与设备交互的信息。

source: Dependencies
es: Dependencias
it: Dipendenze
ko: 종속 항목
zh_hans: 依赖关系

source: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ - provides a client class which enable applications to connect to an MQTT broker
es: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ - proporciona una clase de cliente que permite a las aplicaciones conectarse a un intermediario MQTT
it: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ - fornisce una classe client che consente alle applicazioni di connettersi a un broker MQTT
ko: `paho-mqtt(<https://pypi.python.org/pypi/paho-mqtt>)` - 애플리케이션이 MQTT 브로커에 연결할 수 있게 하는 클라이언트 클래스를 제공함
zh_hans: `paho-mqtt <https://pypi.python.org/pypi/paho-mqtt>`__ - 提供使应用程序可连接到 MQTT 代理程序的客户机类

source: `iso8601 <https://pypi.python.org/pypi/iso8601>`__ - parses the most common forms of ISO 8601 date strings into datetime objects
es: `iso8601 <https://pypi.python.org/pypi/iso8601>`__ - analiza los formatos más comunes de series de fecha ISO 8601 en objetos de fecha y hora
it: `iso8601 <https://pypi.python.org/pypi/iso8601>`__ - analizza le forme più comuni di stringhe data ISO 8601 in oggetti dataora
ko: `iso8601(<https://pypi.python.org/pypi/iso8601>)` - ISO 8601 날짜 문자열의 가장 일반적인 양식을 날짜/시간 오브젝트로 구문 분석함
zh_hans: `iso8601 <https://pypi.python.org/pypi/iso8601>`__ - 将 ISO 8601 日期字符串的最常见格式解析为日期时间对象

source: `pytz <https://pypi.python.org/pypi/pytz>`__ - allows accurate and cross platform timezone calculations
es: `pytz <https://pypi.python.org/pypi/pytz>`__ - permite cálculos de huso horario precisos y entre plataformas
it: `pytz <https://pypi.python.org/pypi/pytz>`__ - consente calcoli di fuso orario accurati e tra le piattaforme
ko: `pytz(<https://pypi.python.org/pypi/pytz>)` - 정확한 크로스 플랫폼 시간대 계산을 허용함
zh_hans: `pytz <https://pypi.python.org/pypi/pytz>`__ - 实现准确的跨平台时区计算

source: `requests <https://pypi.python.org/pypi/requests>`__ - an HTTP library
es: `requests <https://pypi.python.org/pypi/requests>`__ - una biblioteca HTTP
it: `requests <https://pypi.python.org/pypi/requests>`__ - una libreria HTTP
ko: `requests(<https://pypi.python.org/pypi/requests>)` - HTTP 라이브러리
zh_hans: `requests <https://pypi.python.org/pypi/requests>`__ - HTTP 库

source: Installation
es: Instalación
it: Installazione
ko: 설치
zh_hans: 安装

source: To install the latest version of the library with pip, enter the following code in your command line. ::
es: Para instalar la versión más reciente de la biblioteca con pip, entre el código siguiente en la línea de mandatos. ::
it: Per installare la versione più recente della libreria con pip, immettere il seguente codice nella riga comandi. ::
ko: pip를 가진 라이브러리의 최신 버전을 설치하려면 명령행에 다음 코드를 입력하십시오. ::
zh_hans: 要安装带 pip 的库的最新版本，请在命令行中输入以下代码。::

source: Uninstall
es: Desinstalar
it: Disinstallazione
ko: 설치 제거
zh_hans: 卸载

source: Uninstalling the module is simple, enter the following code in the command line.
es: La desinstalación del módulo es simple, entre el código siguiente en la línea de mandatos.
it: La disinstallazione del modulo è semplice, immettere il seguente codice nella riga comandi.
ko: 모듈 설치 제거는 단순합니다. 명령행에 다음 코드를 입력하십시오.
zh_hans: 卸载模块很简单，在命令行中输入以下代码即可。

source: Migrating from v0.0.x to v0.1.x
es: Migración de v0.0.x a v0.1.x
it: Migrazione da v0.0.x a v0.1.x
ko: v0.0.x에서 v0.1.x로 마이그레이션
zh_hans: 从 V0.0.x 迁移到 V0.1.x

source: There is a significant change between the 0.0.x releases and 0.1.x that will require changes to client code. Now that the library properly supports multiple message formats you will want to update calls to deviceClient.publishEvent, appClient.publishEvent and appClient.publishCommand to also supply the desired message format.
es: Hay un cambio significativo entre los releases 0.0.x y 0.1.x que necesitará cambios en el código de cliente. Ahora que la biblioteca soporta de forma correcta varios formatos de mensaje, es aconsejable actualizar las llamadas a deviceClient.publishEvent, appClient.publishEvent y appClient.publishCommand para proporcionar también el formato de mensaje deseado.
it: C'è stato un cambiamento significativo tra le release 0.0.x e 0.1.x che richiederà delle modifiche al codice client. Ora che la libreria supporta correttamente diversi formati di messaggi è possibile aggiornare le chiamate a deviceClient.publishEvent, appClient.publishEvent e appClient.publishCommand per supportare anche il formato messaggi desiderato.
ko: 0.0.x 릴리스와 0.1.x 사이에는 클라이언트 코드를 변경해야 하는 중요한 변경사항이 있습니다. 라이브러리는 여러 메시지 형식을 적절하게 지원하므로 사용자는 deviceClient.publishEvent, appClient.publishEvent 및 appClient.publishCommand에 대한 호출을 업데이트하여 원하는 메시지 형식도 제공하길 원할 것입니다.
zh_hans: 0.0.x 发行版和 0.1.x 之间进行了重要更改，后者需要对客户机代码进行更改。由于此库能正确支持多种消息格式，您将需要更新对 deviceClient.publishEvent、appClient.publishEvent 和 appClient.publishCommand 的调用，以同时提供所需消息格式。

source: Sample code v0.0.9:
es: Código de ejemplo v0.0.9:
it: Codice di esempio v0.0.9:
ko: 샘플 코드 v0.0.9:
zh_hans: 样本代码 V0.0.9：

source: Sample code v0.1.1:
es: Código de ejemplo v0.1.1:
it: Codice di esempio v0.1.1:
ko: 샘플 코드 v0.1.1:
zh_hans: 样本代码 V0.1.1：

source: Also, as part of this change, events and commands sent as format "json" will not be assumed to meet the `IoTF JSON Payload Specification <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. The default client behaviour will be to parse commands and events with format "json" as a generic JSON object only. Only messages sent as format "json-iotf" will default to being decoded in this specification. This can be easily changed with the following code.
es: Asimismo, como parte de este cambio, no se supondrá que los sucesos y mandatos enviados como formato "json" cumplen con la `Especificación de carga útil JSON de IoTF <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__. El comportamiento de cliente predeterminado será analizar mandatos y sucesos con el formato "json" como un objeto JSON genérico solamente. Solo los mensajes enviados como formato "json-iotf" tomarán de forma predeterminada estar descodificados en esta especificación. Esto se puede cambiar fácilmente con el código siguiente.
it: Inoltre, come parte di questa modifica, non si presumerà che gli eventi e i comandi inviati in formato "json" rispettino la 'specifica payload JSON IoTF <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>'__. Il funzionamento predefinito del client sarà quello di analizzare i comandi e gli eventi con il formato "json" solo come oggetti JSON generici. Solo i messaggi inviati in formato "json-iotf" saranno, per impostazione predefinita, decodificati in base a questa specifica. Ciò può essere facilmente modificato con il seguente codice.
ko: 또한 이 변경의 일부로서 "json" 형식으로 전송된 명령 및 이벤트는 `IoTF JSON 페이로드 스펙(<https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>)`을 충족하는 것으로 간주되지 않습니다. 기본 클라이언트 동작은 "json" 형식을 가진 이벤트 및 명령을 일반적인 JSON 오브젝트로만 구문 분석하는 것입니다. "json-iotf" 형식으로 전송된 메시지만 기본적으로 이 스펙에서 디코딩됩니다. 다음 코드를 사용하여 쉽게 이를 변경할 수 있습니다.
zh_hans: 此外，作为此更改的一部分，以“json”格式发送的事件和命令将不符合 `IoTF JSON 有效内容规范 <https://docs.internetofthings.ibmcloud.com/messaging/payload.html#iotf-json-payload-specification>`__。缺省客户机行为是将格式为“json”的命令和事件仅解析为通用 JSON 对象。只有以格式“json-iotf”发送的消息将缺省为按此规范进行解码。这可轻松通过以下代码进行更改。

source: Documentation
es: Documentación
it: Documentazione
ko: 문서
zh_hans: 文档

source: `Device Client <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
es: `Cliente de dispositivos <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
it: `Client dispositivo <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__
ko: `디바이스 클라이언트(<https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>)`
zh_hans: `设备客户机 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_devices.html>`__

source: `Application Client <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
es: `Cliente de aplicaciones <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
it: `Client applicazione <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
ko: `애플리케이션 클라이언트(<https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>)`
zh_hans: `应用程序客户机 <https://docs.internetofthings.ibmcloud.com/libraries/python_cli_for_apps.html>`__
