Repository: robert17/iotf-rtd
Catalog: docs/libraries/python_cli_for_devices.po-*.po
Languages: es, zh_hans

source: Python Client Library - Devices
es: Biblioteca de cliente Python - Dispositivos
zh_hans: Python 客户机库 - 设备

source: Introduction
es: Introducción
zh_hans: 简介

source: This client library describes how to use devices with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
es: Esta biblioteca de cliente describe cómo utilizar dispositivos con el módulo de python ibmiotf. Para obtener ayuda para empezar a utilizar este módulo, consulte `Biblioteca de cliente Python - Introducción <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
zh_hans: 此客户机库描述了如何将设备与 python ibmiotf 模块配合使用。有关此模块的入门帮助，请参阅 `Python 客户机库 - 简介 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__。

source: This client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the Python ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
es: Esta biblioteca de cliente se divide en dos secciones, ambas incluidas en la biblioteca. Esta sección contiene información sobre cómo los dispositivos publican sucesos y manejan mandatos utilizando el módulo de Python ibmiotf y la sección Aplicaciones contiene información sobre cómo las aplicaciones pueden utilizar el módulo ibmiotf para interactuar con los dispositivos.
zh_hans: 此客户机库划分为两个部分，均包含在库中。此部分包含有关设备如何使用 Python ibmiotf 模块发布事件和处理命令的信息，“应用程序”部分包含有关应用程序可如何使用 ibmiotf 模块与设备交互的信息。

source: Constructor
zh_hans: 构造方法

source: The constructor builds the client instance, and accepts an options dict containing the following definitions:
es: El constructor crea la instancia de cliente y acepta un diccionario de opciones que contiene las definiciones siguientes:
zh_hans: 构造方法可构建客户机实例，并接受包含以下定义的选项字典：

source: org - Your organization ID.
es: org - ID de organización.
zh_hans: org - 您组织的标识。

source: type - The type of your device.
es: type - Tipo del dispositivo.
zh_hans: type - 您设备的类型。

source: id - The ID of your device.
es: id - ID del dispositivo.
zh_hans: id - 您设备的标识。

source: auth-method - Method of authentication (the only value currently supported is "token").
es: auth-method - Método de autenticación (el único valor soportado actualmente es "token").
zh_hans: auth-method - 认证方法（当前唯一支持的值为“token”）。

source: auth-token - API key token (required if auth-method is "token").
es: auth-token - Señal de clave de API (necesario si auth-method es "token").
zh_hans: auth-token - API 密钥令牌（如果 auth-method 为“token”，那么此项为必需）。

source: If no options dict is provided, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device. The options dict creates definitions which are used to interact with the Internet of Things Foundation module.
es: Si no se proporciona ningún diccionario de opciones, el cliente se conectará a Internet of Things Foundation Quickstart y tomará de forma predeterminada un dispositivo no registrado. El diccionario de opciones crea definiciones que se utilizan para interactuar con el módulo de Internet of Things Foundation.
zh_hans: 如果未提供选项字典，那么客户机将连接到 Internet of Things Foundation Quickstart，并缺省为未注册设备。选项字典创建用于与 Internet of Things Foundation 模块进行交互的定义。

source: Using a configuration file
es: Utilización de un archivo de configuración
zh_hans: 使用配置文件

source: Instead of including an options dict directly, you can use a configuration file containing an options dict. If you are using a configuration file containing an options dict, use the following code format.
es: En lugar de incluir un diccionario de opciones directamente, puede utilizar un archivo de configuración que contenga un diccionario de opciones. Si está utilizando un archivo de configuración que contiene un diccionario de opciones, utilice el formato de código siguiente.
zh_hans: 您可以使用包含选项字典的配置文件，而不是直接包含选项字典。如果使用的配置文件包含选项字典，请使用以下代码格式。

source: The content of the configuration file must be in the following format:
es: El contenido del archivo de configuración debe estar en el formato siguiente:
zh_hans: 配置文件的内容必须为以下格式：

source: Publishing events
es: Publicación de sucesos
zh_hans: 发布事件

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
es: Los sucesos son el mecanismo mediante el cual los dispositivos publican datos en Internet of Things Foundation. El dispositivo controla el contenido del suceso y asigna un nombre para cada suceso que envía.
zh_hans: 事件是设备用于将数据发布到 Internet of Things Foundation 的机制。设备控制事件的内容，并为其发送的每个事件分配名称。

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
es: Cuando IoT Foundation recibe un suceso, se utilizan las credenciales de la conexión en la que se ha recibido el suceso para determinar de qué dispositivo se ha enviado el suceso. Con esta arquitectura es imposible que un dispositivo suplante a otro dispositivo.
zh_hans: IoT Foundation 接收到事件时，用于接收该事件的连接的凭证将用于确定从哪个设备发送了该事件。有了此体系结构，一个设备无法假冒其他设备。

source: Events can be published at any of the three :ref:`quality of service levels <qoslevels>` defined by the MQTT protocol. By default events will be published as qos level 0.
es: Los sucesos se pueden publicar a cualquiera de los tres `niveles de calidad de servicio <niveles_qos>` :ref: definidos por el protocolo MQTT. De forma predeterminada, los sucesos se publicarán como nivel de qos 0.
zh_hans: 事件可以按 MQTT 协议定义的三个 :ref:`服务质量级别 <qoslevels>` 中的任何一个级别进行发布。缺省情况下，事件将按 qos 级别 0 进行发布。

source: Publish event using default quality of service
es: Publicar suceso utilizando calidad de servicio predeterminada
zh_hans: 使用缺省服务质量发布事件

source: Publish event using user-defined quality of service
es: Publicar suceso utilizando calidad de servicio definida por el usuario
zh_hans: 使用用户定义的服务质量发布事件

source: Events can be published at higher MQTT quality of servive levels, but these events may take slower then QoS level 0, because of the extra confirmation of receipt.
es: Los sucesos se pueden publicar a niveles de calidad de servicio MQTT más altos, pero es posible que estos sucesos vayan más lentos que el nivel de QoS 0, debido a la confirmación adicional de recepción.
zh_hans: 可通过较高的 MQTT 服务质量级别发布事件，但由于需额外确认回执，这些事件可能采用慢于 QoS 级别 0 的级别。

source: Handling commands
es: Manejo de mandatos
zh_hans: 处理命令

source: When the device client connects it automatically subscribes to any command for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
es: Cuando el cliente de dispositivo se conecta, se suscribe automáticamente a cualquier mandato para este dispositivo. Para procesar mandatos específicos, necesita registrar un método de devolución de llamada de mandato. Los mensajes se devuelven como una instancia de la clase de mandato que tiene las propiedades siguientes:
zh_hans: 设备客户机连接时，会自动预订此设备的任何命令。要处理特定命令，您需要注册命令回调方法。消息将作为具有以下属性的 Command 类实例返回：

source: payload - string
es: payload - serie
zh_hans: payload - 字符串

source: format - string
es: format - serie
zh_hans: format - 字符串

source: data - dict
es: data - diccionario
zh_hans: data - 字典

source: timestamp - datetime
es: timestamp - fecha y hora
zh_hans: timestamp - 日期时间

source: Custom message format support
es: Soporte de formato de mensaje personalizado
zh_hans: 定制消息格式支持

source: By default the library supports the encoding and decoding of Python dictionary objects as JSON when you use msgFormat "json". When you use msgFormat "json-iotf" it will encode the message in accordance with the IoTF JSON Payload Specification. To add support for your own custom message formats see the `sample in GitHub <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__
es: De forma predeterminada, la biblioteca soporta la codificación y decodificación de objetos de diccionario de Python como JSON cuando se utiliza msgFormat "json". Cuando se utiliza msgFormat "json-iotf" codificará el mensaje de acuerdo con la especificación de carga útil JSON de IoTF. Para añadir soporte para los formatos de mensaje personalizados propios, consulte el `ejemplo en GitHub <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__
zh_hans: 缺省情况下，使用 msgFormat“json”时，库支持将 Python 字典对象作为 JSON 进行编码和解码。使用 msgFormat“json-iotf”时，将根据 IoTF JSON 有效内容规范对消息进行编码。要添加对您自己的定制消息格式的支持，请参阅 `GitHub 中的样本 <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__

source: Once you have created your custom encoder module it needs to be registered in the device client. If you attempt to use an unknown message format when sending an event or the device receives a command send in a format that it does not know how to decode then the library will throw a MissingMessageDecoderException.
es: Una vez que ha creado el módulo de codificador personalizado, es necesario registrarlo en el cliente de dispositivo. Si intenta utilizar un formato de mensaje desconocido al enviar un suceso o el dispositivo recibe un mensaje enviado en un formato que no sabe cómo decodificar, la biblioteca emitirá una MissingMessageDecoderException.
zh_hans: 创建定制编码器模块后，需要在设备客户机中进行注册。如果发送事件时尝试使用未知消息格式，或设备接收的命令是以其不知道如何解码的格式发送的，那么库将抛出 MissingMessageDecoderException。
