Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/nodejs/node-js_applications.po
Languages: fr

source: Node.js Client Library - Applications
fr: Bibliothèque client Node.js - Applications

source: The node.js client is used for simplifying the interacting with the Internet of Things Foundation. This client library contains instruction and guidance on using node.js with Internet of Things Foundation to interact with you devices and applications.
fr: Le client node.js permet de simplifier l'interaction avec Internet of Things Foundation. Cette bibliothèque client contient les instructions et les conseils à suivre pour utiliser node.js avec Internet of Things Foundation lors de l'interaction avec des terminaux et des applications.

source: This client library is divided into two parts, Devices and Applications. The Devices section contains information on how devices publish events and handle commands using the node.js Internet of Things Foundation module, and the Applications section contains information on how applications can use the nodejs ibmiotf module to interact with devices.
fr: Cette bibliothèque client est divisée en deux sections, Terminaux et Applications. La section Terminaux contient des informations expliquant comment les terminaux publient des événements et traitent des commandes à l'aide du module node.js d'Internet of Things Foundation. La section Applications contient des informations décrivant comment les applications peuvent utiliser le module nodejs ibmiotf pour interagir avec des terminaux.

source: *IotfApplication* is the application client for the Internet of Things Foundation service. This section contains information on how applications interact with devices.
fr: *IotfApplication* est le client d'application du service Internet of Things Foundation. Cette section contient des informations sur les modalités d'interaction des applications avec des terminaux.

source: Constructor
fr: Constructeur

source: The constructor builds the application client instance. It accepts an configuration json containing the following : - org - Your organization ID - id - The unique ID of your application within your organization. - auth-key - API key - auth-token - API key token
fr: Le constructeur crée l'instance du client d'application. Il accepte un objet de configuration JSON contenant les propriétés suivantes : - org : ID de votre organisation - id : ID unique de votre application dans votre organisation - auth-key : Clé d'API - auth-token : Jeton de clé d'API

source: If you want to use quickstart, then send only the first two properties.
fr: Si vous souhaitez utiliser Quickstart, envoyez uniquement les deux premières propriétés.

source: Using a configuration file
fr: Utilisation d'un fichier de configuration

source: Instead of passing the configuration json directly, you can also use a configuration file. Use the following code snippet
fr: Au lieu de transmettre directement l'objet de configuration JSON, vous pouvez utiliser un fichier de configuration. Utilisez le fragment de code suivant :

source: The configuration file must be in the format of
fr: Le fichier de configuration doit posséder le format suivant :

source: Connecting to the Internet of Things Foundation
fr: Connexion à Internet of Things Foundation

source: Connect to the Internet of Things Foundation by calling the *connect* function.
fr: Connectez-vous à Internet of Things Foundation en appelant la fonction *connect*.

source: After the successful connection to the IoTF service, the application client sends a *connect* event. So all the logic can be implemented inside this callback function.
fr: Une fois que la connexion à IoTF est établie, le client d'application envoie un événement *connect*. L'ensemble de la logique peut donc être mis en oeuvre au sein de cette fonction de rappel.

source: Subscribing to device events
fr: Abonnement aux événements d'un terminal

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
fr: Les événements représentent le mécanisme par lequel les terminaux publient les données dans Internet of Things Foundation. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.

source: When an event is received by the Internet of Things Foundation, the credentials of the connection on which the event was received are used to determine from which device the event was sent. Using this architecture, it is impossible for a device to impersonate another device.
fr: Lorsqu'un événement est reçu par Internet of Things Foundation, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal qui a envoyé l'événement. Avec cette architecture, un terminal ne peut en aucun cas simuler les droits d'accès d'un autre terminal.

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
fr: Par défaut, les applications sont abonnées à tous les événements de tous les terminaux connectés. Utilisez les paramètres type, id, event et msgFormat pour contrôler la portée de l'abonnement. Un même client peut prendre en charge plusieurs abonnements. Les exemples de code ci-après expliquent comment s'abonner à des terminaux en fonction des paramètres type, id, event et msgFormat.

source: To subscribe to all events from all devices
fr: Abonnement à tous les événements de tous les terminaux

source: To subscribe to all events from all devices of a specific type
fr: Abonnement à tous les événements de tous les terminaux d'un type donné

source: To subscribe to a specific event from all devices
fr: Abonnement à un événement spécifique de tous les terminaux

source: To subscribe to a specific event from two or more different devices
fr: Abonnement à un événement spécifique de plusieurs terminaux

source: To subscribe to all events published by a device in json format
fr: Abonnement à tous les événements publiés par un terminal au format json

source: Handling events from devices
fr: Traitement des événements provenant des terminaux

source: To process the events received by your subscriptions you need to implement a device event callback method. The ibmiotf application client emits the event *deviceEvent*. This function has the following properties:
fr: Pour traiter les événements reçus via vos abonnements, vous devez mettre en oeuvre une méthode de rappel d'événement. Le client d'application ibmiotf émet un événement *deviceEvent*. Cette fonction possède les propriétés suivantes :

source: payload - Device event payload
fr: payload - Contenu des événements du terminal

source: topic - Original topic
fr: topic - Sujet d'origine

source: Subscribing to device status
fr: Abonnement au statut des terminaux

source: By default, this will subscribe to status updates for all connected devices. Use the type and id parameters to control the scope of the subscription. A single client can support multiple subscriptions.
fr: Par défaut, vous êtes abonné aux mises à jour du statut de tous les terminaux connectés. Utilisez les paramètres type et id pour contrôler la portée de l'abonnement. Un même client peut prendre en charge plusieurs abonnements.

source: Subscribe to status updates for all devices
fr: Abonnement aux mises à jour du statut de tous les terminaux

source: Subscribe to status updates for all devices of a specific type
fr: Abonnement aux mises à jour du statut de tous les terminaux d'un type donné

source: Subscribe to status updates for two different devices
fr: Abonnement aux mises à jour du statut de deux terminaux différents

source: Handling status updates from devices
fr: Traitement des mises à jour du statut des terminaux

source: To process the status updates received by your subscriptions you need to implement an device status callback method. The ibmiotf application client emits the event *deviceStatus*. This function has the following properties:
fr: Pour traiter les mises à jour du statut reçues via vos abonnements, vous devez mettre en oeuvre une méthode de rappel du statut des terminaux. Le client d'application ibmiotf émet un événement *deviceStatus*. Cette fonction possède les propriétés suivantes :

source: payload - Device status payload
fr: payload - Contenu du statut d'un terminal

source: Publishing events from devices
fr: Publication des événements provenant des terminaux

source: Applications can publish events as if they originated from a Device. The function requires:
fr: Les applications peuvent publier des événements comme s'ils provenaient d'un terminal. La fonction requiert :

source: Device ID
fr: ID terminal

source: Event Type
fr: Type d'événement

source: Data
fr: Données

source: Publishing commands to devices
fr: Publication de commandes sur des terminaux

source: Applications can publish commands to connected devices. The function requires:
fr: Les applications peuvent publier des commandes sur des terminaux connectés. La fonction requiert :

source: Command Type
fr: Type de commande

source: Disconnect Client
fr: Déconnexion du client

source: Disconnects the client and releases the connections
fr: Déconnecte le client et libère les connexions

source: Check Connection Status
fr: Vérification du statut de la connexion

source: *isConnected* gives the current status of the application client connection
fr: *isConnected* indique le statut en cours de la connexion du client d'application.
