Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ko, pt_br

source: Introduction
ko: 소개
pt_br: Introdução

source: About
ko: 정보
pt_br: Sobre

source: Welcome to the documentation/reference material for IBM's IoT Foundation service. If you are looking for tutorials you can find them on developerWorks Recipes_.
ko: IBM IoT Foundation 서비스에 대한 문서/참조 자료를 시작합니다. 학습서를 찾는 경우 developerWorks Recipes_에서 찾을 수 있습니다.
pt_br: Bem-vindo à documentação/material de referência para o serviço IoT Foundation da IBM. Se estiver procurando tutoriais, é possível localizá-los em developerWorks Recipes_.

source: The documentation is organized into a number of sections:
ko: 이 문서는 다수의 절로 구성되어 있습니다.
pt_br: A documentação é organizada em várias seções:

source: Device Management Operations
ko: 디바이스 관리 오퍼레이션
pt_br: Operações de Gerenciamento de Dispositivo

source: Programming Guides
ko: 프로그래밍 안내
pt_br: Guias de Programação

source: Messaging
ko: 메시징
pt_br: Sistema de Mensagens

source: Reference Material
ko: 참조 자료
pt_br: Material de Referência

source: Contribute
ko: 기여
pt_br: Contribuição

source: If it's not working for you, it's not working for us. The source of this documentation is available on GitHub_, we welcome both `suggestions for improvement`_ and community contributions via the use of issues and pull requests against our repository.
ko: 사용자에 대해 작동하지 않는 경우에는 당사에 대해서도 작동하지 않습니다. 이 문서의 소스는 GitHub에서 얻을 수 있으며 당사의 저장소에 대한 문제 및 가져오기 요청을 사용하여 `개선을 위한 의견`을 제출하고 커뮤니티에 기여할 수 있습니다.
pt_br: Se não estiver funcionando para você, não está funcionando para nós. A origem desta documentação está disponível em GitHub_, aceitamos `sugestões para aprimoramento`_ e contribuições da comunidade através do uso de emissões e solicitações de pull em relação ao nosso repositório.
