Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/api/api_intro.po
Languages: it

source: Introduction to the Internet of Things Foundation API
it: Introduzione all'API di Internet of Things Foundation

source: The Internet of Things Foundation API can be used to interact with your organization in the Internet of Things Foundation.
it: L'API di Internet of Things Foundation può essere utilizzata per interagire con l'organizzazione in Internet of Things Foundation.

source: API Capabilities
it: Funzioni API

source: The IoT API has the following functionality:
it: L'API IoT dispone delle seguenti funzionalità:

source: View organization details.
it: Visualizzare i dettagli dell'organizzazione.

source: Bulk device operations (list all, add, remove).
it: Operazioni di massa dispositivo (elenca tutti, aggiungi, rimuovi).

source: Device type operations (list all, create, delete, view details, update).
it: Operazioni per tipo di dispositivo (elenca tutti, crea, elimina, visualizza dettagli, aggiorna).

source: Device operations (list devices, add, remove, view details, update, view location, view management information).
it: Le operazioni dispositivo (elencare dispositivi, aggiungerli, rimuoverli, visualizzarne i dettagli, aggiornarli, visualizzarne l'ubicazione, visualizzarne le informazioni di gestione).

source: Device diagnostic operations (clear log, retrieve logs, add log information, delete logs, get specific log, clear error codes, get device error codes, add an error code).
it: Le operazioni di diagnostica del dispositivo (cancellazione log, richiamo log, aggiunta informazioni log, eliminazione log, richiamo log specifico, cancellazione codici di errore, ottenimento codici di errore del dispositivo, aggiunta di un codice di errore).

source: Connection problem determination (list device connection log events).
it: Determinazione problema di connessione (elencare eventi log connessione dispositivo).

source: Historical event retrieval (view events from all devices, view events from a device type, view events for a specific device).
it: Richiamo evento cronologico (visualizzazione eventi da tutti i dispositivi, visualizzazione eventi da un tipo di dispositivo, visualizzazione eventi per un dispositivo specifico).

source: Device management request operations (list device management requests, initiate a request, clear request status, get details of a request, get list of request statuses for each affected device, get request status for a specific device).
it: Le operazioni di richiesta di gestione dispositivo (elencare richieste di gestione dispositivo, avviare una richiesta, cancellare lo stato della richiesta, richiamare i dettagli di una richiesta, ottenere l'elenco di stati della richiesta per ciascun dispositivo interessato, richiamare lo stato della richiesta per uno specifico dispositivo).

source: Usage management (retrieve number of active devices over a period of time, retrieve amount of storage used by historical event data, retrieve total amount of data used).
it: Gestione utilizzo (richiamare il numero di dispositivi attivi in un determinato periodo di tempo, richiamare la quantità di spazio di archiviazione utilizzata dai dati evento cronologici, richiamare la quantità totale di dati utilizzati).

source: Service status queries (retrieve service statuses for an organization).
it: Query dello stato del servizio (richiamare gli stati del servizio per un'organizzazione).

source: IoT Foundation API Version 2
it: API IoT Foundation Versione 2

source: The current version of the Internet of Things Foundation API is version 2.
it: La versione corrente dell'API Internet of Things Foundation è la versione 2.

source: `Click here <../swagger/v0002.html>`_ for details of the Version 2 API operations.
it: `Fare clic qui <../swagger/v0002.html>`_ per i dettagli delle operazioni dell'API Versione 2.

source: IoT Foundation API Version 1
it: API IoT Foundation Versione 1

source: Version 1 of the API is still supported, however, some of the operations cannot be performed using version 1 of the API and others are performed using different API paths.
it: versione 1 dell'API è ancora supportato, tuttavia, alcune delle operazioni non possono essere eseguite utilizzando la versione 1 dell'API e altre sono eseguite utilizzando differenti percorsi API.

source: Restrictions of version 1 of the IoT Foundation API:
it: Limitazioni della versione 1 dell'API IoT Foundation:

source: Many of the API paths relating to devices have changed.
it: Molti dei percorsi API relativi ai dispositivi sono stati modificati.

source: Version 1 of the API does not support any device type operations, other than listing all device types.
it: La versione 1 dell'API non supporta le operazioni tipo di dispositivo diverse dall'elenco di tutti i tipi di dispositivo.

source: Operations related to device management, device management requests, diagnostic information, or location cannot be performed using version 1 of the API.
it: Le operazioni correlate alla gestione del dispositivo, le richieste di gestione del dispositivo, le informazioni di diagnostica o l'ubicazione non possono essere eseguite utilizzando la versione 1 dell'API.

source: `Click here <../swagger/v0001.html>`_ for details of the Version 1 API operations.
it: `Fare clic qui <../swagger/v0001.html>`_ per i dettagli delle operazioni dell'API Versione 1.
