Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/api/historical_events.po
Languages: de, fr, it, ko, pt_br

source: Historical Event API
de: API für historische Ereignisse
fr: Interface de programmation pour les événements d'historique
it: API Evento cronologico
ko: 히스토리 이벤트 API
pt_br: API de Evento Histórico

source: Authentication
de: Authentifizierung
fr: Authentification
it: Autenticazione
ko: 인증
pt_br: Autenticação

source: The API is only accessible over HTTPS and is protected by HTTP Basic Authentication. You must provide a username and password with every request.
de: Auf die API kann nur über HTTPS zugegriffen werden. Die API ist durch die HTTP-Basisauthentifizierung geschützt. Sie müssen einen Benutzernamen und ein Kennwort bei jeder Anforderung eingeben.
fr: L'interface de programmation est accessible uniquement sur HTTPS et est protégée par le mécanisme d'authentification de base HTTP. Vous devez indiquer un nom d'utilisateur et un mot de passe avec chaque demande.
it: L'API è accessibile solo su HTTPS ed è protetta dall'autenticazione di base HTTP. È necessario fornire un nome utente e una password con ogni richiesta.
ko: 이 API는 HTTPS를 통해서만 액세스할 수 있고 HTTP 기본 인증에 의해 보호됩니다. 사용자는 모든 요청과 함께 사용자 이름 및 비밀번호를 제공해야 합니다.
pt_br: A API é acessível apenas através de HTTPS e é protegida pela Autenticação Básica HTTP. Deve-se fornecer um nome de usuário e uma senha com cada solicitação.

source: Username
de: Benutzername
fr: Nom d'utilisateur
it: Nome utente
ko: 사용자 이름
pt_br: Nome do usuário

source: A valid API key registered to the organization you want to work with.
de: Ein gültiger API-Schlüssel, der in der Organisation, mit der Sie arbeiten wollen, registriert ist.
fr: Clé d'interface de programmation valide enregistrée dans l'organisation que vous souhaitez utiliser.
it: Una chiave API valida registrata per l'organizzazione con cui si desidera operare.
ko: 작업할 조직에 등록된 올바른 API 키입니다.
pt_br: Uma chave de API válida registrada para a organização com a qual você deseja trabalhar.

source: Password
de: Kennwort
fr: Mot de passe
ko: 비밀번호
pt_br: Senha

source: The authentication token corresponding to your API key.
de: Das Authentifizierungstoken, das Ihrem API-Schlüssel entspricht.
fr: Jeton d'authentification correspondant à votre clé d'interface de programmation.
it: Il token di autenticazione corrispondente alla propria chiave API.
ko: API 키에 해당하는 인증 토큰입니다.
pt_br: O token de autenticação correspondente à sua chave API.

source: View all events
de: Alle Ereignisse anzeigen
fr: Affichage de tous les événements
it: Visualizza tutti gli eventi
ko: 모든 이벤트 보기
pt_br: Visualizar todos os eventos

source: View events across all devices registered to the organization
de: Ereignisse über alle Einheiten, die in der Organisation registriert sind, anzeigen
fr: Affichez les événements de tous les terminaux enregistrés dans l'organisation.
it: Visualizza gli eventi in tutti i dispositivi registrati con l'organizzazione
ko: 조직에 등록된 모든 디바이스의 이벤트 보기
pt_br: Visualizar eventos através de todos os dispositivos registrados na organização

source: Request
de: Anforderung
fr: Demande
it: Richiesta
ko: 요청
pt_br: Solicitação

source: Request Headers
de: Anforderungsheader
fr: En-têtes de demande
it: Intestazioni richiesta
ko: 요청 헤더
pt_br: Cabeçalhos da Solicitação

source: Use the cursorId response header returned by the initial request to iterate through the list of historical records
de: Verwenden Sie den Antwortheader cursorId, der von der ursprünglichen Anforderung zurückgegeben wird, um die Liste der historischen Datensätze zu durchlaufen
fr: Utilisez l'en-tête de réponse cursorId renvoyé par la demande initiale pour effectuer une itération dans la liste d'enregistrements de l'historique.
it: Utilizzare l'intestazione di risposta cursorId restituita dalla richiesta iniziale per iterare nell'elenco di record cronologici
ko: 초기 요청에 의해 리턴되는 cursorId 응답 헤더를 사용하여 히스토리 레코드 목록에서 반복
pt_br: Use o cabeçalho de resposta cursorId retornado pela solicitação inicial para iterar através da lista de registros históricos

source: Required when setting the cursorId header. Use the iotHistorianSessionId cookie returned by the initial request
de: Erforderlich, wenn der Header cursorId gesetzt wird. Verwenden Sie das Cookie iotHistorianSessionId, das von der ursprünglichen Anforderung zurückgegeben wird.
fr: Ce paramètre est obligatoire lorsque vous définissez l'en-tête cursorId. Utilisez le cookie iotHistorianSessionId renvoyé par la demande initiale.
it: Obbligatorio quando si imposta l'intestazione cursorId. Utilizzare il cookie iotHistorianSessionId restituito dalla richiesta iniziale
ko: cursorId 헤더 설정 시 필수. 초기 요청에 의해 리턴되는 iotHistorianSessionId 쿠키 사용
pt_br: Necessário ao configurar o cabeçalho cursorId. Use o cookie iotHistorianSessionId retornado pela solicitação inicial

source: Request Body
de: Anforderungs-Body
fr: Corps de la demande
it: Corpo della richiesta
ko: 요청 본문
pt_br: Corpo da Solicitação

source: None
de: Keiner
fr: Aucun
it: Nessuno
ko: 없음
pt_br: Nenhum

source: Query Parameters
de: Abfrageparameter
fr: Paramètres de la requête
it: Parametri della query
ko: 조회 매개변수
pt_br: Parâmetros de Consulta

source: evt_type - String
de: evt_type - Zeichenfolge
fr: evt_type - Chaîne
it: evt_type - Stringa
ko: evt_type - 문자열
pt_br: evt_type - Sequência

source: Restrict results only to those events published under this event identifier
de: Ergebnisse nur auf die Ereignisse beschränken, die unter dieser Ereignis-ID publiziert werden
fr: Limiter les résultats aux événements publiés avec cet identificateur d'événement
it: Limita i risultati solo a quegli eventi pubblicati con questo identificativo evento
ko: 이 이벤트 ID 아래에서 공개된 이벤트로만 결과 제한
pt_br: Restringir resultados apenas aos eventos publicados sob esse identificador de evento

source: start - Number of milliseconds since January 1, 1970, 00:00:00 GMT)
de: start - Anzahl der Millisekunden seit dem 1. Januar 1970, 00:00:00 GMT)
fr: start - Nombre de millisecondes depuis le 1er janvier 1970, 00:00:00 GMT
it: start - Il numero di millisecondi a partire dal 1° gennaio 1970, 00:00:00 GMT)
ko: 시작 - 1970년 1월 1일, 00:00:00 GMT로부터의 경과 시간(밀리초)
pt_br: início - Número de milissegundos desde 1 de janeiro de 1970, 00:00:00 GMT)

source: Restrict results to events published after this date
de: Ergebnisse auf die Ereignisse beschränken, die nach diesem Datum publiziert wurden
fr: Limiter les résultats aux événements publiés après cette date
it: Limita i risultati agli eventi pubblicati dopo questa data
ko: 이 날짜 이후 공개된 이벤트로 결과 제한
pt_br: Restringir resultados aos eventos publicados após essa data

source: end - Number of milliseconds since January 1, 1970, 00:00:00 GMT)
de: end - Anzahl der Millisekunden seit dem 1. Januar 1970, 00:00:00 GMT)
fr: end - Nombre de secondes depuis le 1er janvier 1970, 00:00:00 GMT)
it: end - Il numero di millisecondi a partire dal 1° gennaio 1970, 00:00:00 GMT)
ko: 종료 - 1970년 1월 1일, 00:00:00 GMT로부터의 경과 시간(밀리초)
pt_br: término - Número de milissegundos desde 1 de janeiro de 1970, 00:00:00 GMT)

source: Restrict results to events published before this date
de: Ergebnisse auf die Ereignisse beschränken, die vor diesem Datum publiziert wurden
fr: Limiter les résultats aux événements publiés avant cette date
it: Limita i risultati agli eventi pubblicati prima di questa data
ko: 이 날짜 이전에 공개된 이벤트로 결과 제한
pt_br: Restringir resultados aos eventos publicados antes dessa data

source: Response Headers
de: Antwortheader
fr: En-têtes de réponse
it: Intestazioni risposta
ko: 응답 헤더
pt_br: Cabeçalhos de Resposta

source: cursorId: use the cursorId response header returned by the initial request to iterate through the list of historical records
de: cursorId: verwenden Sie den Antwortheader cursorId, der von der ursprünglichen Anforderung zurückgegeben wird, um die Liste der historischen Datensätze zu durchlaufen
fr: cursorId : Utilisez l'en-tête de réponse cursorId renvoyé par la demande initiale pour effectuer une itération dans la liste des enregistrements d'historique.
it: cursorId: utilizzare l'intestazione di risposta cursorId restituita dalla richiesta iniziale per iterare nell'elenco di record cronologici
ko: cursorId: 초기 요청에 의해 리턴된 cursorId 응답 헤더를 사용하여 히스토리 레코드 목록에서 반복
pt_br: cursorId: use o cabeçalho de resposta cursorId retornado pela solicitação inicial para iterar através da lista de registros históricos

source: Set-Cookie: iotHistorianSessionId
it: Impostazione cookie: iotHistorianSessionId
pt_br: Configurar-Cookie: iotHistorianSessionId

source: Response Body
de: Antwort-Body
fr: Corps de la réponse
it: Corpo della risposta
ko: 응답 본문
pt_br: Corpo de Resposta

source: Returns a list of historical data records sorted by timestamp in descending order
de: Gibt eine Liste mit historische Datensätzen zurück, die nach Zeitmarke in absteigender Reihenfolge sortiert sind
fr: Renvoie une liste d'enregistrements de données d'historique triés en fonction de leur horodatage, par ordre décroissant.
it: Restituisce un elenco di record di dati cronologici ordinato per data/ora in ordine decrescente
ko: 시간소인별로 정렬된 히스토리 데이터 레코드의 내림차순 목록을 리턴함
pt_br: Retorna uma lista de registros de dados históricos classificados pelo registro de data e hora em ordem decrescente

source: device_id (String)
de: device_id (Zeichenfolge)
fr: device_id (Chaîne)
it: device_id (Stringa)
ko: device_id(문자열)
pt_br: device_id (Sequência)

source: device_type (String)
de: device_type (Zeichenfolge)
fr: device_type (Chaîne)
it: device_type (Stringa)
ko: device_type(문자열)
pt_br: device_type (Sequência)

source: evt_type (String)
de: evt_type (Zeichenfolge)
fr: evt_type (Chaîne)
it: evt_type (Stringa)
ko: evt_type(문자열)
pt_br: evt_type (Sequência)

source: timestamp (Date)
de: timestamp (Datum)
it: timestamp (Data)
ko: 시간소인(날짜)
pt_br: registro de data e hora (Data)

source: evt (Complex object)
de: evt (komplexes Objekt)
fr: evt (Objet complexe)
it: evt (Oggetto complesso)
ko: evt(복합 오브젝트)
pt_br: evt (Objeto complexo)

source: Example Response
de: Beispielantwort
fr: Exemple de réponse
it: Risposta di esempio
ko: 예제 응답
pt_br: Exemplo de Resposta

source: Common Response Codes
de: Allgemeine Antwortcodes
fr: Codes de réponse courants
it: Codici di risposta comuni
ko: 공통 응답 코드
pt_br: Códigos de Resposta Comuns

source: 200 (success)
de: 200 (Erfolg)
fr: 200 (Réussite)
it: 200 (Riuscito)
ko: 200(성공)
pt_br: 200 (sucesso)

source: View events for a device type
de: Ereignisse für einen Einheitentyp anzeigen
fr: Affichage des événements d'un type de terminal
it: Visualizza gli eventi per un tipo di dispositivo
ko: 디바이스 유형에 대한 이벤트 보기
pt_br: Visualizar eventos para um tipo de dispositivo

source: View events across all devices of a specific type
de: Ereignisse über alle Einheiten eines bestimmten Typs anzeigen
fr: Affichez les événements de tous les terminaux d'un type spécifique.
it: Visualizza gli eventi in tutti i dispositivi di un tipo specifico
ko: 특정 유형의 모든 디바이스의 이벤트 보기
pt_br: Visualizar eventos através de todos os dispositivos de um tipo específico

source: top - Number between 1 and 100
de: top - Zahl zwischen 1 und 100
fr: top - Nombre compris entre 1 et 100
it: top - Numero tra 1 e 100
ko: 맨 위 - 1과 100 사이의 숫자
pt_br: superior - Número entre 1 e 100

source: Restrict the number of records returned (default=100)
de: Anzahl der zurückgegebenen Datensätze beschränken (Standardwert=100)
fr: Limiter le nombre d'enregistrements renvoyés (par défaut=100)
it: Limita il numero di record restituiti (predefinito=100)
ko: 리턴되는 레코드의 수 제한(기본값 = 100)
pt_br: Restringir o número de registros retornados (padrão=100)

source: summarize - Array
fr: summarize - Tableau
it: summarize - Schiera
ko: 요약 - 배열
pt_br: resumir - Matriz

source: A list of fields from the JSON event payload on which to perform the aggregate function specified by the summarize_type parameter. The format for the parameter is {field1,field2,...,fieldN}
de: Eine Liste von Feldern von den JSON-Ereignisnutzdaten, auf denen die Aggregationsfunktion ausgeführt werden soll, die durch den Parameter summarize_type angegeben ist. Das Format für den Parameter ist {feld1,feld2,...,feldN}
fr: Liste de zones établies à partir du contenu des événements JSON et sur lesquelles est exécutée la fonction d'agrégation indiquée par le paramètre summarize_type. Le format du paramètre est {zone1,zone2,...,zoneN}
it: Un elenco di campi dal payload eventi JSON su cui eseguire la funzione di aggregazione specificata dal parametro summarize_type. Il formato del parametro è {field1,field2,...,fieldN}
ko: summarize_type 매개변수에 의해 지정된 집계 함수를 수행할 JSON 이벤트 페이로드의 필드 목록. 매개변수의 형식은 {field1,field2,...,fieldN}임
pt_br: Uma lista de campos da carga útil do evento JSON na qual executar a função agregada especificada pelo parâmetro summarize_type. O formato para o parâmetro é {field1,field2,...,fieldN}

source: summarize_type - String
de: summarize_type - Zeichenfolge
fr: summarize_type - Chaîne
it: summarize_type - Stringa
ko: summarize_type - 문자열
pt_br: summarize_type - Sequência

source: The aggregation to perform on the fields specified by the summarize parameter:
de: Die Aggregation, die auf den Feldern ausgeführt werden soll, die durch den Parameter summarize angegeben sind:
fr: Agrégation à effectuer sur les zones indiquées par le paramètre summarize :
it: L'aggregazione da eseguire sui campi specificati dal parametro summarize:
ko: 요약 매개변수에 의해 지정된 필드에서 수행할 집계:
pt_br: A agregação a executar nos campos especificados pelo parâmetro de resumo:

source: avg (default)
de: avg (Standardwert)
fr: avg (valeur par défaut)
it: avg (predefinito)
ko: avg(기본값)
pt_br: avg (padrão)

source: count
pt_br: contagem

source: min
pt_br: mín.

source: max
pt_br: máx.

source: sum
pt_br: soma

source: range
pt_br: intervalo

source: variance
pt_br: variação

source: View events for a device
de: Ereignisse für eine Einheit anzeigen
fr: Affichage des événements d'un terminal
it: Visualizza gli eventi per un dispositivo
ko: 디바이스에 대한 이벤트 보기
pt_br: Visualizar eventos para um dispositivo

source: View events for a specific device
de: Ereignisse für eine bestimmte Einheit anzeigen
fr: Affichez les événements d'un terminal spécifique.
it: Visualizza gli eventi per un dispositivo specifico
ko: 특정 디바이스에 대한 이벤트 보기
pt_br: Visualizar eventos para um dispositivo específico

source: Restrict the number of records returned (default=100).
de: Anzahl der zurückgegebenen Datensätze beschränken (Standardwert=100).
fr: Limiter le nombre d'enregistrements renvoyés (par défaut=100).
it: Limita il numero di record restituiti (predefinito=100).
ko: 리턴되는 레코드의 수를 제한합니다(기본값 = 100).
pt_br: Restringir o número de registros retornados (padrão=100).

source: Cookie
ko: 쿠키
