Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/api/v0001/device.po
Languages: it, pt_br, zh_cn, zh_tw

source: Device API v0001
it: API dispositivo v0001
pt_br: API de Dispositivo v0001
zh_cn: 设备 API v0001
zh_tw: 裝置 API v0001

source: Authentication
it: Autenticazione
pt_br: Autenticação
zh_cn: 认证
zh_tw: 鑑別

source: The API is only accessible over HTTPS and is protected by HTTP Basic Authentication, you must provide a username and password with every request.
it: L'API è accessibile solo su HTTPS ed è protetta dall'autenticazione di base HTTP, è necessario fornire un nome utente e una password con ogni richiesta.
pt_br: A API é acessível apenas através de HTTPS e é protegida pela Autenticação Básica HTTP, deve-se fornecer um nome de usuário e senha com cada solicitação.
zh_cn: 此 API 仅可通过 HTTPS 访问且受 HTTP 基本认证的保护，必须为每个请求提供用户名和密码。
zh_tw: 此 API 只能透過 HTTPS 存取，且受到「HTTP 基本鑑別」保護，您必須在每一次要求時提供使用者名稱和密碼。

source: Username
it: Nome utente
pt_br: Nome do usuário
zh_cn: 用户名
zh_tw: 使用者名稱

source: A valid API key registered to the organization you want to work with.
it: Una chiave API valida registrata per l'organizzazione con cui si desidera operare.
pt_br: Uma chave de API válida registrada para a organização com a qual você deseja trabalhar.
zh_cn: 向您希望使用的组织注册的有效 API 密钥。
zh_tw: 已登錄到您想要使用之組織的有效 API 金鑰。

source: Password
pt_br: Senha
zh_cn: 密码
zh_tw: 密碼

source: The authentication token corresponding to your API key.
it: Il token di autenticazione corrispondente alla propria chiave API.
pt_br: O token de autenticação correspondente à sua chave API.
zh_cn: 与您的 API 密钥对应的认证令牌。
zh_tw: 對應到 API 金鑰的鑑別記號。

source: View Organization
it: Visualizza organizzazione
pt_br: Visualizar Organização
zh_cn: 查看组织
zh_tw: 檢視組織

source: Retrieve details about an organization.
it: Richiamare i dettagli relativi ad un'organizzazione.
pt_br: Recuperar detalhes sobre uma organização.
zh_cn: 检索有关组织的详细信息。
zh_tw: 擷取關於組織的詳細資料。

source: Request
it: Richiesta
pt_br: Solicitação
zh_cn: 请求
zh_tw: 要求

source: Request Body
it: Corpo della richiesta
pt_br: Corpo da Solicitação
zh_cn: 请求主体
zh_tw: 要求內文

source: None
it: Nessuno
pt_br: Nenhum
zh_cn: 无
zh_tw: 無

source: Response Body
it: Corpo della risposta
pt_br: Corpo de Resposta
zh_cn: 响应主体
zh_tw: 回應內文

source: id - String
it: id - Stringa
pt_br: ID - Sequência
zh_cn: id - 字符串
zh_tw: id - 字串

source: name - String
it: name - Stringa
pt_br: nome - Sequência
zh_cn: name － 字符串
zh_tw: name - 字串

source: created - ISO8601 date string
it: created - Stringa data ISO8601
pt_br: criada - sequência de datas ISO8601
zh_cn: created - ISO8601 日期字符串
zh_tw: created - ISO8601 日期字串

source: updated - ISO8601 date string
it: updated - Stringa data ISO8601
pt_br: atualizada - sequência de datas ISO8601
zh_cn: updated - ISO8601 日期字符串
zh_tw: updated - ISO8601 日期字串

source: Example Response
it: Risposta di esempio
pt_br: Exemplo de Resposta
zh_cn: 响应示例
zh_tw: 回應範例

source: Common Response Codes
it: Codici di risposta comuni
pt_br: Códigos de Resposta Comuns
zh_cn: 常见响应代码
zh_tw: 一般回應碼

source: 200 (Success)
it: 200 (Riuscito)
pt_br: 200 (Sucesso)
zh_cn: 200（成功）
zh_tw: 200（成功）

source: List Devices
it: Elenca dispositivi
pt_br: Listar Dispositivos
zh_cn: 列示设备
zh_tw: 列出裝置

source: Get a list of all devices in an organization.
it: Richiamare un elenco di tutti i dispositivi in un'organizzazione.
pt_br: Obter uma lista de todos os dispositivos em uma organização.
zh_cn: 获取组织中所有设备的列表。
zh_tw: 取得組織中所有裝置的清單。

source: The response body will contain a list of devices, as below:
it: Il corpo della risposta conterrà un elenco di dispositivi, come riportato di seguito:
pt_br: O corpo de resposta conterá uma lista de dispositivos, conforme abaixo:
zh_cn: 响应主体将包含设备的列表，如下所示：
zh_tw: 回應內文將包含裝置清單，如下所示：

source: uuid - String
it: uuid - Stringa
pt_br: uuid - Sequência
zh_cn: uuid - 字符串
zh_tw: uuid - 字串

source: type - String
it: type - Stringa
pt_br: tipo - Sequência
zh_cn: type - 字符串
zh_tw: type - 字串

source: metadata - Complex data (if available)
it: metadata - Dati complessi (se disponibile)
pt_br: metadados - Dados complexos (se disponíveis)
zh_cn: metadata - 复杂数据（如果可用）
zh_tw: metadata - 複式資料（如果可用的話）

source: registration
pt_br: registro
zh_cn: 注册
zh_tw: 登錄

source: auth
pt_br: aut
zh_cn: 权限
zh_tw: 鑑別

source: date - ISO8601 date string
it: date - Stringa data ISO8601
pt_br: data - sequência de datas ISO8601
zh_cn: date - ISO8601 日期字符串
zh_tw: date - ISO8601 日期字串

source: List Devices by Type
it: Elenca i dispositivi per tipo
pt_br: Listar Dispositivos por Tipo
zh_cn: 按类型列示设备
zh_tw: 依類型列出裝置

source: Get a list of all devices of a specific type in an organization.
it: Richiamare un elenco di tutti i dispositivi di un tipo specifico in un'organizzazione.
pt_br: Obter uma lista de todos os dispositivos de um tipo específico em uma organização.
zh_cn: 获取组织中特定类型的所有设备的列表。
zh_tw: 取得組織中特定類型的所有裝置清單。

source: metadata - Complex data
it: metadata - Dati complessi
pt_br: metadados - Dados complexos
zh_cn: metadata - 复杂数据
zh_tw: metadata - 複式資料

source: List Device Types
it: Elenca tipi di dispositivo
pt_br: Listar Tipos de Dispositivos
zh_cn: 列示设备类型
zh_tw: 列出裝置類型

source: Get a list of all devices types in an organization.
it: Richiamare un elenco di tutti i tipi di dispositivi in un'organizzazione.
pt_br: Obter uma lista de todos os tipos de dispositivos em uma organização.
zh_cn: 获取组织中所有设备类型的列表。
zh_tw: 取得組織中所有裝置類型的清單。

source: The response body will contain a list of device types:
it: Il corpo della risposta conterrà un elenco di tipi di dispositivi:
pt_br: O corpo de resposta conterá uma lista de tipos de dispositivos:
zh_cn: 响应主体将包含设备类型的列表：
zh_tw: 回應內文將包含裝置類型的清單：

source: deviceType - String
it: deviceType - Stringa
pt_br: deviceType - Sequência
zh_cn: deviceType - 字符串
zh_tw: deviceType - 字串

source: count - Integer
it: count - Numero intero
pt_br: contagem - Número inteiro
zh_cn: count - 整数
zh_tw: count - 整數

source: Register a New Device
it: Registra un nuovo dispositivo
pt_br: Registrar um Novo Dispositivo
zh_cn: 注册新设备
zh_tw: 登錄新裝置

source: Register a new device to an organization.
it: Registrare un nuovo dispositivo ad un'organizzazione.
pt_br: Registrar um novo dispositivo em uma organização.
zh_cn: 向组织注册新设备。
zh_tw: 在組織中登錄新裝置。

source: You can use any scheme of your choice when assigning values for type and id to registered devices, however the following restrictions apply:
it: È possibile utilizzare qualsiasi schema di propria scelta quando si assegnano i valori per il tipo e l'id ai dispositivi registrati, tuttavia si applicano le seguenti limitazioni:
pt_br: Você pode usar qualquer esquema de sua escolha ao designar valores para o tipo e o ID para dispositivos registrados, no entanto, as seguintes restrições se aplicam:
zh_cn: 向已注册设备分配类型和标识的值时，可使用所选的任何方案，但存在以下限制：
zh_tw: 對已登錄裝置指派類型和 ID 的值時，您可以使用自己選擇的任何方法，但有下列限制：

source: Maximum length of 36 characters
it: Lunghezza massima di 36 caratteri
pt_br: Comprimento máximo de 36 caracteres
zh_cn: 最大长度为 36 个字符
zh_tw: 長度上限為 36 個字元

source: Must comprise only alpha-numeric characters and the following special characters:
it: Contenere solo caratteri alfanumerici e i seguenti caratteri speciali:
pt_br: Deve abranger apenas caracteres alfanuméricos e os seguintes caracteres especiais:
zh_cn: 必须仅包含字母数字字符和以下特殊字符：
zh_tw: 只能包含英數字元和下列特殊字元：

source: dash ("-")
it: trattino ("-")
pt_br: traço ("-")
zh_cn: 短划线（“-”）
zh_tw: 橫線 ("-")

source: underscore ("\_")
it: sottolineatura ("\_")
pt_br: sublinhado ("\_")
zh_cn: 下划线（“_”）
zh_tw: 底線 ("\_")

source: dot (".")
it: punto (".")
pt_br: ponto (".")
zh_cn: 点（“.”）
zh_tw: 句點 (".")

source: You must specify the type and identifer of the device being registered.
it: È necessario specificare il tipo e l'identificativo del dispositivo da registrare.
pt_br: Deve-se especificar o tipo e o identificador do dispositivo que está sendo registrado.
zh_cn: 必须指定正注册的设备的类型和标识。
zh_tw: 您必須指定所要登錄之裝置的類型和 ID。

source: metadata - Complex data (optional)
it: metadata - Dati complessi (facoltativo)
pt_br: metadados - Dados complexos (opcional)
zh_cn: metadata - 复杂数据（可选）
zh_tw: metadata - 複式資料（選用）

source: password - String (optional, and follows the same restrictions as type and id, with a minimum length of 8 characters)
it: password - Stringa (facoltativo e segue le stesse limitazioni di tipo e id, con una lunghezza minima di 8 caratteri)
pt_br: senha - Sequência (opcional, e segue as mesmas restrições como tipo e ID, com um comprimento mínimo de 8 caracteres)
zh_cn: password - 字符串（可选，且遵循与类型和标识相同的限制，即，最小长度为 8 个字符）
zh_tw: password - 字串（選用，遵循與類型和 ID 相同的限制，長度下限為 8 個字元）

source: Example Request
it: Richiesta di esempio
pt_br: Exemplo de Solicitação
zh_cn: 请求示例
zh_tw: 要求範例

source: Response Headers
it: Intestazioni risposta
pt_br: Cabeçalhos de Resposta
zh_cn: 响应头
zh_tw: 回應標頭

source: The response header will contain the location (resource URI) for the registered device. \* Location - URI
it: L'intestazione della risposta conterrà l'ubicazione (URI della risorsa) per il dispositivo registrato. \* Ubicazione - URI
pt_br: O cabeçalho de resposta conterá o local (URI do recurso) para o dispositivo registrado. \* Local - URI
zh_cn: 响应头将包含已注册设备的位置（资源 URI）。\* Location - URI
zh_tw: 回應標頭將包含已登錄裝置的位置（資源 URI）。\* 位置 - URI

source: The response body will contain a uuid and password for the registered device.
it: Il corpo della risposta conterrà un uuid e una password per i dispositivi registrati.
pt_br: O corpo de resposta conterá um uuid e senha para o dispositivo registrado.
zh_cn: 响应主体将包含已注册设备的 uuid 和密码。
zh_tw: 回應內文將包含已登錄裝置的 UUID 和密碼。

source: password - String
it: password - Stringa
pt_br: senha - Sequência
zh_cn: password - 字符串
zh_tw: password - 字串

source: The response body will contain the generated authentication token for this device. You must make sure to record this token when processing the response. The data is stored hashed and salted so we are not able to retrieve lost authentication tokens.
it: Il corpo della risposta conterrà il token di autenticazione generato per questo dispositivo. Durante l'elaborazione della risposta, accertarsi di annotare l'ubicazione del token. I dati vengono memorizzati in modo casuale e discontinuo, quindi non è possibile richiamare i token di autenticazione persi.
pt_br: O corpo de resposta conterá o token de autenticação gerado para este dispositivo. Deve-se certificar-se de registrar esse token ao processar a resposta. Os dados são armazenados em hash e com salt, portanto, nós não podemos recuperar os tokens de autenticação perdidos.
zh_cn: 响应主体将包含为此设备生成的认证令牌。您必须确保在处理响应时记录此令牌。该数据在存储时进行加盐散列加密，因此我们无法取回丢失的认证令牌。
zh_tw: 回應內文將包含此裝置已產生的鑑別記號。在處理回應時，請務必記錄此記號。此資料以隨機雜湊方式儲存，因此我們無法擷取失去的鑑別記號。

source: 201 (Created) - The device was successfully registered (Location header set to the URL of the new device)
it: 201 (Creato) - Il dispositivo è stato registrato correttamente (l'intestazione Ubicazione è impostata sull'URL del nuovo dispositivo)
pt_br: 201 (Criado) - O dispositivo foi registrado com êxito (Cabeçalho de local configurado para a URL do novo dispositivo)
zh_cn: 201（已创建）- 设备已成功注册（位置头设置为新设备的 URL）
zh_tw: 201（已建立）- 已順利登錄此裝置（位置標頭設為新裝置的 URL）

source: Update a Registered Device
it: Aggiorna un dispositivo registrato
pt_br: Atualizar um Dispositivo Registrado
zh_cn: 更新已注册设备
zh_tw: 更新已登錄裝置

source: Update an existing device in an organization.
it: Aggiornare un dispositivo esistente in un'organizzazione.
pt_br: Atualizar um dispositivo existente em uma organização.
zh_cn: 更新组织中的现有设备。
zh_tw: 更新組織中現有的裝置。

source: Currently, the only property of a device that can be changed after initial registration is its metadata.
it: Attualmente, l'unica proprietà di un dispositivo che può essere modificata dopo la registrazione iniziale sono i metadati.
pt_br: Atualmente, a única propriedade de um dispositivo que pode ser alterada após o registro inicial são seus metadados.
zh_cn: 当前，初始注册后唯一可更改的设备属性是其元数据。
zh_tw: 目前，在起始登錄之後可變更的裝置唯一內容是它的 meta 資料。

source: The response body will contain the updated properties of the registered device.
it: Il corpo della risposta conterrà le proprietà aggiornate del dispositivo registrato.
pt_br: O corpo de resposta conterá as propriedades atualizadas do dispositivo registrado.
zh_cn: 响应主体将包含已注册设备的更新属性。
zh_tw: 回應內文將包含已登錄裝置的已更新內容。

source: View a Registered Device
it: Visualizza un dispositivo registrato
pt_br: Visualizar um Dispositivo Registrado
zh_cn: 查看已注册设备
zh_tw: 檢視已登錄裝置

source: Get summary information about a registered device in an organization.
it: Richiamare le informazioni di riepilogo su un dispositivo registrato in un'organizzazione.
pt_br: Obter informações resumidas sobre um dispositivo registrado em uma organização.
zh_cn: 获取有关组织中已注册设备的摘要信息。
zh_tw: 取得關於組織中已登錄裝置的摘要資訊。

source: The response body will contain the known properties of the device.
it: Il corpo della risposta conterrà le proprietà note del dispositivo.
pt_br: O corpo de resposta conterá as propriedades conhecidas do dispositivo.
zh_cn: 响应主体将包含设备的已知属性。
zh_tw: 回應內文將包含裝置的已知內容。

source: Delete a Registered Device
it: Elimina un dispositivo registrato
pt_br: Excluir um Dispositivo Registrado
zh_cn: 删除已注册设备
zh_tw: 刪除已登錄裝置

source: Unregister a device from an organization.
it: Annullare la registrazione di un dispositivo da un'organizzazione.
pt_br: Cancelar o registro de um dispositivo de uma organização.
zh_cn: 从组织注销设备。
zh_tw: 從組織中取消登錄裝置。

source: 204 (No Content) - The device was successfully deleted
it: 204 (Nessun contenuto) - Il dispositivo è stato eliminato correttamente
pt_br: 204 (Nenhum Conteúdo) - O dispositivo foi excluído com êxito
zh_cn: 204（无内容）- 设备已成功删除
zh_tw: 204（無內容）- 已順利刪除裝置
