Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/c_sharp_devices.po
Languages: pt_br

source: C# Client Library - Devices
pt_br: Biblioteca do Cliente C# - Dispositivos

source: Introduction
pt_br: Introdução

source: This client library describes how to use devices with the C# ibmiotf module. For help with getting started with this module, see `C Sharp Client Library - Introduction <../libraries/c_sharp_introduction.html#/>`_\.
pt_br: Esta biblioteca do cliente descreve como usar dispositivos com o módulo ibmiotf do C#. Para obter ajuda sobre como iniciar este módulo, consulte `Biblioteca do Cliente C Sharp - Introdução <../libraries/c_sharp_introduction.html#/>`_\.

source: This client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the C# ibmiotf module. The Applications section contains information on how applications can use the ibmiotf module to interact with devices.
pt_br: Esta biblioteca do cliente é dividida em duas seções, ambas incluídas na biblioteca. Esta seção contém informações sobre como os dispositivos publicam eventos e manipulam comandos usando o módulo ibmiotf do C#. A seção Aplicativos contém informações sobre como os aplicativos podem usar o módulo ibmiotf para interagir com dispositivos.

source: Constructor
pt_br: Construtor

source: The constructor builds the client instance, and accepts arguments containing the following definitions:
pt_br: O construtor constrói a instância do cliente e aceita argumentos que contêm as seguintes definições:

source: orgId - Your organization ID.
pt_br: orgId - O ID da organização.

source: deviceType - The type of your device.
pt_br: deviceType - O tipo do dispositivo.

source: deviceId - The ID of your device.
pt_br: deviceId - O ID do dispositivo.

source: auth-method - Method of authentication (the only value currently supported is “token”).
pt_br: auth-method - Método de autenticação (o único valor atualmente suportado é “token”).

source: auth-token - API key token (required if auth-method is “token”).
pt_br: auth-token - Token da chave de API (necessário se o método de autenticação for “token”).

source: If deviceId and deviceType are provided, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device. The argument lists creates definitions which are used to interact with the Internet of Things Foundation module.
pt_br: Se deviceId e deviceType forem fornecidos, o cliente se conectará à Iniciação Rápida do Internet of Things Foundation e será padronizado como um dispositivo não gerenciado. As listas de argumentos criam definições que são usadas para interagir com o módulo do Internet of Things Foundation.

source: Publishing events
pt_br: Publicando eventos

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
pt_br: Eventos são o mecanismo pelo qual os dispositivos publicam dados no Internet of Things Foundation. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine which device sent the event. With this architecture it is impossible for a device to impersonate another device.
pt_br: Quando um evento é recebido pelo IoT Foundation, as credenciais da conexão na qual o evento foi recebido são usadas para determinar qual dispositivo enviou o evento. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.

source: Events can be published at any of the three `quality of service (QoS) levels <../mqtt.html#/qoslevels>`_, defined by the MQTT protocol. By default events will be published as QoS level 0.
pt_br: Os eventos podem ser publicados em qualquer um dos três níveis de `qualidade de serviço (QoS) <../mqtt.html#/qoslevels>`_, definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como nível de QoS 0.

source: Publish event using default quality of service
pt_br: Publicar evento usando a qualidade de serviço padrão

source: Publish event using user-defined quality of service
pt_br: Publicar evento usando a qualidade de serviço definida pelo usuário

source: Events can be published at higher MQTT quality of service levels, but events published at QoS levels above 0 may be slower then QoS 0 events, because of the extra confirmation of receipt used in QoS levels above 0.
pt_br: Os eventos podem ser publicados em níveis de qualidade de serviço de MQTT superiores, mas os eventos publicados em níveis de QoS acima de 0 podem ser mais lentos do que os eventos de QoS 0, em razão da confirmação de recebimento adicional usada em níveis de QoS acima de 0.

source: Handling commands
pt_br: Manipulando comandos

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands, you must register a command callback method.
pt_br: Quando o cliente do dispositivo se conecta, ele automaticamente assina todos os comandos para esse dispositivo. Para processar comandos específicos, você deve registrar um método de retorno de chamada de comando.
