Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/embedded_c.po
Languages: ja, ko, pt_br, zh_tw

source: Embedded C Client Library
ja: Embedded C クライアント・ライブラリー
ko: 임베디드 C 클라이언트 라이브러리
pt_br: Biblioteca do Cliente C Integrada
zh_tw: 嵌入式 C 用戶端程式庫

source: The `Embedded C client library <https://github.com/ibm-messaging/iotf-embeddedc>`_ is used to interact with the IBM Internet of Things Foundation. This library will enable devices to communicate with the IoT Foundation Cloud service using the MQTT protocol.
ja: `Embedded C クライアント・ライブラリー <https://github.com/ibm-messaging/iotf-embeddedc>`_ を使用して、IBM Internet of Things Foundation と対話します。このライブラリーによって、デバイスは MQTT プロトコルを使用して IoT Foundation クラウド・サービスと通信できるようになります。
ko: `임베디드 C 클라이언트 라이브러리 <https://github.com/ibm-messaging/iotf-embeddedc>`_는 IBM Internet of Things Foundation과 상호작용하는 데 사용됩니다. 이 라이브러리는 디바이스가 MQTT 프로토콜을 사용하여 IoT Foundation 클라우드 서비스와 통신할 수 있게 합니다.
pt_br: A `Biblioteca do cliente C integrada <https://github.com/ibm-messaging/iotf-embeddedc>`_ é usada para interagir com o Internet of Things Foundation. Esta biblioteca permitirá que os dispositivos se comuniquem com o serviço IoT Foundation Cloud usando o protocolo MQTT.
zh_tw: `嵌入式 C 用戶端程式庫 <https://github.com/ibm-messaging/iotf-embeddedc>`_ 可用來與 IBM Internet of Things Foundation 互動。此程式庫可讓裝置利用 MQTT 通訊協定來與「IoT Foundation 雲端」服務進行通訊。

source: Dependencies
ja: 従属関係
ko: 종속 항목
pt_br: Dependências
zh_tw: 相依關係

source: `Eclipse Paho Embedded C library <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - provides an MQTT C client library, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
ja: `Eclipse Paho Embedded C ライブラリー <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - MQTT C クライアント・ライブラリーを提供しています。詳細については、`こちら <http://www.eclipse.org/paho/clients/c/embedded/>`__ を参照してください。
ko: `Eclipse Paho Embedded C 라이브러리(<http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>)` - MQTT C 클라이언트 라이브러리를 제공합니다. 자세한 정보는 `여기(<http://www.eclipse.org/paho/clients/c/embedded/>)`를 확인하십시오.
pt_br: `Biblioteca C integrada Eclipse Paho <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - fornece uma biblioteca do cliente C MQTT, consulte `aqui <http://www.eclipse.org/paho/clients/c/embedded/>`__ para obter mais informações.
zh_tw: `Eclipse Paho 嵌入式 C 程式庫 <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - 提供 MQTT C 用戶端程式庫，如需相關資訊，請查閱 `這裡 <http://www.eclipse.org/paho/clients/c/embedded/>`__。

source: Installation
ja: インストール
ko: 설치
pt_br: Instalação
zh_tw: 安裝

source: To install the Internet of Things Foundation client library for Embedded C follow the instructions below.
ja: Embedded C 用の Internet of Things Foundation クライアント・ライブラリーをインストールするには、以下の手順に従ってください。
ko: Embedded C용 Internet of Things Foundation 클라이언트 라이브러리를 설치하려면 아래의 지시사항을 따르십시오.
pt_br: Para instalar a biblioteca do cliente do Internet of Things Foundation para C Integrado, siga as instruções abaixo.
zh_tw: 若要安裝嵌入式 C 的 Internet of Things Foundation 用戶端程式庫，請遵循下列指示。

source: To install the latest version of the library, enter the following code in your command line.
ja: 最新バージョンのライブラリーをインストールするには、コマンド・ラインに以下のコードを入力してください。
ko: 라이브러리의 최신 버전을 설치하려면 명령행에 다음 코드를 입력하십시오.
pt_br: Para instalar a versão mais recente da biblioteca, insira o código a seguir em sua linha de comandos.
zh_tw: 若要安裝程式庫的最新版本，請在指令行中輸入下列程式碼。

source: Copy the Paho library .tar file that was downloaded in the previous step to the *lib* directory.
ja: 前の手順でダウンロードした Paho ライブラリーの .tar ファイルを *lib* ディレクトリーにコピーします。
ko: 이전 단계에서 다운로드한 Paho 라이브러리 .tar 파일을 *lib* 디렉토리에 복사하십시오.
pt_br: Copie o arquivo .tar da biblioteca Paho que foi transferido por download na etapa anterior para o diretório *lib*.
zh_tw: 將前一個步驟所下載的 Paho 程式庫 .tar 檔複製到 *lib* 目錄。

source: Extract the library file
ja: ライブラリー・ファイルを解凍します。
ko: 라이브러리 파일 추출
pt_br: Extraia o arquivo de biblioteca
zh_tw: 將程式庫檔案解壓縮

source: When downloaded, the client has the following file structure:
ja: ダウンロード時に、クライアントのファイル構造は次のようになっています。
ko: 다운로드된 경우 클라이언트의 파일 구조는 다음과 같습니다.
pt_br: Quando transferido por download, o cliente tem a seguinte estrutura de arquivo:
zh_tw: 下載時，此用戶端具有下列檔案結構：

source: Initializing the Client Library
ja: クライアント・ライブラリーを初期化しています
ko: 클라이언트 라이브러리 초기화
pt_br: Inicializando a Biblioteca do Cliente
zh_tw: 起始設定用戶端程式庫

source: After downloading the client library, it must be initialized and connected to the Internet of Things Foundation. There are 2 ways to initialize the Internet of Things Foundation Client Library for Embedded C:
ja: ダウンロードしたクライアント・ライブラリーは、初期化して Internet of Things Foundation に接続する必要があります。Embedded C 用の Internet of Things Foundation クライアント・ライブラリーは、次の 2 とおりの方法で初期化できます。
ko: 클라이언트 라이브러리는 다운로드한 후 초기화하고 Internet of Things Foundation에 연결해야 합니다. 두 가지 방법으로 Embedded C용 Internet of Things Foundation 클라이언트 라이브러리를 초기화할 수 있습니다.
pt_br: Após o download da biblioteca do cliente, ela deverá ser inicializada e conectada ao Internet of Things Foundation. Há 2 maneiras de inicializar a Biblioteca do Cliente para C Integrado do Internet of Things Foundation:
zh_tw: 下載用戶端程式庫之後，它必須進行起始設定並連接到 Internet of Things Foundation。有 2 種方法可以起始設定嵌入式 C 的 Internet of Things Foundation 用戶端程式庫：

source: Passing as Parameters
ja: パラメーターとして引き渡し
ko: 매개변수로 전달
pt_br: Transmitindo como Parâmetros
zh_tw: 以參數傳遞

source: The 'initialize' function takes the following details to connect to the IoT Foundation service:
ja: 「initialize」関数は、IoT Foundation サービスに接続するために以下の詳細を必要とします。
ko: 'initialize' 함수는 다음과 같은 세부사항을 사용하여 IoT Foundation 서비스에 연결합니다.
pt_br: A função 'inicializar' utiliza os seguintes detalhes para conectar ao serviço IoT Foundation:
zh_tw: 'initialize' 函數採用下列詳細資料來連接到 IoT Foundation 服務：

source: client - Pointer to the *iotfclient*
ja: client - *iotfclient* を指すポインター
ko: 클라이언트 - *iotfclient*에 대한 포인터
pt_br: cliente - Ponteiro para o *iotfclient*
zh_tw: client - *iotfclient* 的指標

source: org - Your organization ID
ja: org - 組織 ID
ko: org - 조직 ID
pt_br: org - O ID da organização
zh_tw: org - 組織 ID

source: type - The type of your device
ja: type - デバイスのタイプ
ko: type - 디바이스의 유형
pt_br: tipo - O tipo do seu dispositivo
zh_tw: type - 裝置的類型

source: id - The device ID
ja: id - デバイス ID
ko: id - 디바이스 ID
pt_br: ID - O ID do dispositivo
zh_tw: id - 裝置 ID

source: authmethod - Method of authentication (the only value currently supported is "token")
ja: authmethod - 認証方式 (現在サポートされている値は "token" のみ)
ko: authmethod - 인증 방법(현재 지원되는 유일한 값은 "token"임)
pt_br: authmethod - Método de autenticação (o único valor suportado atualmente é "token")
zh_tw: authmethod - 鑑別的方法（目前唯一支援的值是 "token"）

source: authtoken - API key token (required if auth-method is "token")
ja: authtoken - API キー・トークン (auth-method が "token" である場合に必須)
ko: authtoken - API 키 토큰(auth-method가 "token"인 경우 필수)
pt_br: authtoken - Token de chave API (necessário se o método de autenticação for "token")
zh_tw: authtoken - API 金鑰記號（如果 auth-method 為 "token" 則需要）

source: Using a Configuration File
ja: 構成ファイルの使用
ko: 구성 파일 사용
pt_br: Usando um Arquivo de Configuração
zh_tw: 使用配置檔

source: You can also use a configuration file to initialize the Embedded C client library. The function 'initialize\_configfile' takes the configuration file path as a parameter.
ja: 構成ファイルを使用して Embedded C クライアント・ライブラリーを初期化できます。関数「initialize&#xa5;&#xa5;_configfile」は、構成ファイルのパスをパラメーターとして取ります。
ko: 구성 파일을 사용하여 Embedded C 클라이언트 라이브러리를 초기화할 수도 있습니다. 'initialize\_configfile' 함수는 구성 파일 경로를 매개변수로 가져옵니다.
pt_br: É possível também usar um arquivo de configuração para inicializar a Biblioteca do cliente C integrada. A função 'initialize\_configfile' toma o caminho do arquivo de configuração como um parâmetro.
zh_tw: 您也可以使用配置檔來起始設定嵌入式 C 用戶端程式庫。'initialize\_configfile' 函數採用配置檔路徑作為參數。

source: The configuration file must use the following format.
ja: 構成ファイルは、次の形式を使用する必要があります。
ko: 구성 파일은 다음 형식을 사용해야 합니다.
pt_br: O arquivo de configuração deve usar o seguinte formato.
zh_tw: 此配置檔必須使用下列格式。

source: Connecting to the Service
ja: サービスに接続
ko: 서비스에 연결
pt_br: Conetando-se ao Serviço
zh_tw: 連接至服務

source: After initializing the Internet of Things Foundation Embedded C client library, you can connect to the Internet of Things Foundation by calling the 'connectiotf' function.
ja: Internet of Things Foundation Embedded C クライアント・ライブラリーの初期化後、「connectiotf」関数を呼び出すことで Internet of Things Foundation に接続できます。
ko: Internet of Things Foundation Embedded C 클라이언트 라이브러리를 초기화한 후 'connectiotf' 함수를 호출하여 Internet of Things Foundation에 연결할 수 있습니다.
pt_br: Após inicializar a Biblioteca do cliente C integrada do Internet of Things Foundation, você pode se conectar ao Internet of Things Foundation chamando a função 'connectiotf'.
zh_tw: 在起始設定 Internet of Things Foundation 嵌入式 C 用戶端程式庫之後，您可以透過呼叫 'connectiotf' 函數來連接到 Internet of Things Foundation。

source: Handling commands
ja: コマンドの処理
ko: 명령 처리
pt_br: Manipulando comandos
zh_tw: 處理指令

source: When the device client connects, it automatically subscribes to any command for this device. To process specific commands you need to register a command callback function by calling the function 'setCommandHandler'. The commands are returned as:
ja: デバイス・クライアントは、接続時に自動的にこのデバイスのコマンドをサブスクライブします。特定のコマンドを処理するには、関数「setCommandHandler」を呼び出してコマンド・コールバック関数を登録する必要があります。コマンドは以下のように返されます。
ko: 디바이스 클라이언트는 연결되면 이 디바이스에 대한 명령을 자동으로 구독합니다. 특정 명령을 처리하려면 'setCommandHandler' 함수를 호출하여 명령 콜백 함수를 등록해야 합니다. 이 명령은 다음과 같이 리턴됩니다.
pt_br: Quando o cliente do dispositivo conecta, ele automaticamente assina qualquer comando para esse dispositivo. Para processar comandos específicos, você precisa registrar uma função de retorno de chamada de comando chamando a função 'setCommandHandler'. Os comandos são retornados como:
zh_tw: 當裝置用戶端連接時，它會自動訂閱此裝置的任何指令。若要處理特定指令，您需要透過呼叫 'setCommandHandler' 函數來登錄指令回呼函數。傳回的指令為：

source: commandName - name of the command invoked
ja: commandName - 呼び出されるコマンドの名前
ko: commandName - 호출된 명령의 이름
pt_br: commandName - nome do comando chamado
zh_tw: commandName - 呼叫的指令名稱

source: format - e.g json, xml
ja: format - 例: json、xml
ko: format - 예: json, xml
pt_br: formato - por exemplo, json, xml
zh_tw: 格式 - 例如 json、xml

source: payload
ko: 페이로드
pt_br: carga útil
zh_tw: 內容

source: The 'yield' function must be called periodically to receive commands.
ja: コマンドを受け取るには、定期的に「yield」関数を呼び出す必要があります。
ko: 명령을 수신하려면 'yield' 함수를 주기적으로 호출해야 합니다.
pt_br: A função 'yield' deve ser chamada periodicamente para receber comandos.
zh_tw: 必須定期呼叫 'yield' 函數來接收指令。

source: Publishing events
ja: イベントのパブリッシング
ko: 이벤트 공개
pt_br: Publicando eventos
zh_tw: 發佈事件

source: Events can be published by using:
ja: イベントは、以下を使用してパブリッシュできます。
ko: 다음을 사용하여 이벤트를 공개할 수 있습니다.
pt_br: Os eventos podem ser publicados usando:
zh_tw: 可使用下列各項來發佈事件：

source: eventType - Type of event to be published e.g status, gps
ja: eventType - パブリッシュされるイベントのタイプ。例: status、gps
ko: eventType - 공개할 이벤트의 유형(예: 상태, gps)
pt_br: eventType - Tipo de evento a ser publicado, por exemplo, status, gps
zh_tw: eventType - 要發佈的事件類型，例如 status、gps

source: eventFormat - Format of the event e.g json
ja: eventFormat - イベントの形式。例: json
ko: eventFormat - 이벤트의 형식(예: json)
pt_br: eventFormat - Formato do evento, por exemplo, json
zh_tw: eventFormat - 事件的格式，例如 json

source: data - Payload of the event
ja: data - イベントのペイロード
ko: data - 이벤트의 페이로드
pt_br: dados - Carga útil do evento
zh_tw: data - 事件的內容

source: QoS - qos for the publish event. Supported values : QOS0, QOS1, QOS2
ja: QoS - パブリッシュ・イベントの qos。サポートされる値: QOS0、QOS1、QOS2
ko: QoS - 이벤트 공개에 대한 qos. 지원되는 값: QOS0, QOS1, QOS2
pt_br: QoS - qos para o evento de publicação. Valores suportados: QOS0, QOS1, QOS2
zh_tw: QoS - 發佈事件的服務品質。支援的值：QOS0、QOS1、QOS2

source: Disconnect Client
ja: クライアントの切断
ko: 클라이언트 연결 끊기
pt_br: Desconectar Cliente
zh_tw: 中斷連接用戶端

source: To disconnect the client and release the connections, run the following code snippet.
ja: クライアントを切断して接続を解放するには、次のコード・スニペットを実行します。
ko: 클라이언트의 연결을 끊고 연결을 해제하려면 다음 코드 스니펫을 실행하십시오.
pt_br: Para desconectar o cliente e liberar as conexões, execute o seguinte fragmento de código.
zh_tw: 若要中斷連接用戶端並釋出連線，請執行下列程式碼 Snippet。

source: Samples
ja: サンプル
ko: 샘플
pt_br: Amostras
zh_tw: 範例

source: Sample device and application code is provided in `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
ja: サンプル・デバイスおよびアプリケーション・コードは、`GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_ で提供されています。
ko: 샘플 디바이스 및 애플리케이션 코드가 `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_에 제공됩니다.
pt_br: Um código de amostra de dispositivo e de aplicativo é fornecido no `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
zh_tw: `GitHub<https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_ 中提供了範例裝置及應用程式碼。
