Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_devices.po
Languages: de, ja, ko, pt_br, zh_tw

source: Python Client Library - Devices
de: Python-Clientbibliothek - Einheiten
ja: Python クライアント・ライブラリー - デバイス
ko: Python 클라이언트 라이브러리 - 디바이스
pt_br: Biblioteca do Cliente Python - Dispositivos
zh_tw: Python 用戶端程式庫 - 裝置

source: Introduction
de: Einführung
ja: 概要
ko: 소개
pt_br: Introdução
zh_tw: 簡介

source: This client library describes how to use devices with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
ja: このクライアント・ライブラリーは、python ibmiotf モジュールでデバイスを使用する方法について記述しています。このモジュールを始めるにあたって、ヘルプとなる `Python クライアント・ライブラリー - 概要 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__ を参照してください。
ko: 이 클라이언트 라이브러리는 Python ibmiotf 모듈을 가진 디바이스를 사용하는 방법에 대해 설명합니다. 이 모듈을 시작하는 방법은 `Python Client Library - Introduction(<https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>)`을 참조하십시오.
pt_br: Esta biblioteca do cliente descreve como usar dispositivos com o módulo ibmiotf python. Para obter ajuda sobre como iniciar este módulo, consulte `Biblioteca do Cliente Python - Introdução <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.

source: This client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the Python ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
de: Diese Clientbibliothek ist in zwei Abschnitte unterteilt, die beide in der Bibliothek enthalten sind. Dieser Abschnitt enthält Informationen dazu, wie Einheiten Ereignisse publizieren und Befehle mit dem Python-Modul ibmiotf verarbeiten. Der Abschnitt mit den Anwendungen enthält Informationen, wie Anwendungen das ibmiotf-Modul zur Interaktion mit Einheiten verwenden können.
ja: このクライアント・ライブラリーは、それぞれがライブラリー内に組み込まれた 2 つのセクションに分割されます。このセクションにはデバイスが Python ibmiotf モジュールを使用してイベントをパブリッシュしコマンドを処理する方法に関する情報が、アプリケーション・セクションにはアプリケーションが ibmiotf モジュールを使用してデバイスと対話する方法に関する情報が含まれます。
ko: 이 클라이언트 라이브러리는 두 개의 절로 구성되며 두 개의 절 모두 라이브러리에 포함되어 있습니다. 이 절에는 디바이스가 Python ibmiotf 모듈을 사용하여 이벤트를 공개하고 명령을 처리하는 방법에 대한 정보가 포함되어 있고 애플리케이션 절에는 애플리케이션이 ibmiotf 모듈을 사용하여 디바이스와 상호작용하는 방법에 대한 정보가 포함되어 있습니다.
pt_br: Esta biblioteca do cliente é dividida em duas seções, ambas incluídas na biblioteca. Esta seção contém informações sobre como os dispositivos publicam eventos e manipulam comandos usando o módulo ibmiotf Python; a seção Aplicativos contém informações sobre como os aplicativos podem usar o módulo ibmiotf para interagir com dispositivos.
zh_tw: 此用戶端程式庫分成兩個區段，兩者皆隨附於程式庫。此區段包含裝置如何使用 Python ibmiotf 模組發佈事件及處理指令的相關資訊，「應用程式」區段則包含應用程式如何使用 ibmiotf 模組來與裝置進行互動的相關資訊。

source: Constructor
de: Konstruktor
ja: コンストラクター
ko: 생성자
pt_br: Construtor
zh_tw: 建構子

source: The constructor builds the client instance, and accepts an options dict containing the following definitions:
de: Der Konstruktor erstellt die Clientinstanz und akzeptiert ein Optionsverzeichnis, das die folgenden Definitionen enthält:
ja: コンストラクターはクライアント・インスタンスを構築し、以下の定義を含む options dict を受け入れます。
ko: 생성자는 클라이언트 인스턴스를 빌드하고 다음과 같은 정의가 포함된 옵션 dict를 승인합니다.
pt_br: O construtor constrói a instância do cliente e aceita um dic. de opções contendo as seguintes definições:
zh_tw: 建構子可建置用戶端實例，並接受包含下列定義的選項 dict：

source: org - Your organization ID.
de: org - Ihre Organisations-ID.
ja: org - 組織 ID。
ko: org - 조직 ID입니다.
pt_br: org - Seu ID da organização.
zh_tw: org - 組織 ID。

source: type - The type of your device.
de: type - Der Typ Ihrer Einheit.
ja: type - デバイスのタイプ。
ko: 유형 - 디바이스의 유형입니다.
pt_br: type - O tipo do seu dispositivo.
zh_tw: type - 裝置的類型。

source: id - The ID of your device.
de: id - Die ID Ihrer Einheit.
ja: id - デバイスの ID。
ko: id - 디바이스의 ID입니다.
pt_br: ID - O ID do seu dispositivo.
zh_tw: id - 裝置的 ID。

source: auth-method - Method of authentication (the only value currently supported is "token").
de: auth-method - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").
ja: auth-method - 認証方式 (現在サポートされている値は "token" のみ)。
ko: auth-method - 인증 방법입니다(현재 지원되는 유일한 값은 "token"임).
pt_br: auth-method - Método de autenticação (o único valor atualmente suportado é "token").
zh_tw: auth-method - 鑑別的方法（目前支援的唯一值是 "token"）。

source: auth-token - API key token (required if auth-method is "token").
de: auth-token - API-Schlüsseltoken (erforderlich, falls auth-method den Wert "token" hat).
ja: auth-token - API キー・トークン (auth-method が "token" であるときに必須)。
ko: auth-token - API 키 토큰입니다(auth-method가 "token"인 경우에는 필수).
pt_br: auth-token - Token de chave API (necessário se auth-method for "token").
zh_tw: auth-token - API 金鑰記號（如果 auth-method 為 "token" 則需要）。

source: If no options dict is provided, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device. The options dict creates definitions which are used to interact with the Internet of Things Foundation module.
de: Wenn kein Options-Dict bereit gestellt wird, stellt der Client die Verbindung mit Internet of Things Foundation Quickstart her und nimmt standardmäßig den Wert einer nicht registrierten Einheit an. Das Options-Dict erstellt Definitionen, die zur Interaktion mit dem Internet of Things Foundation-Modul verwendet werden.
ja: options dict が指定されていないと、クライアントは Internet of Things Foundation Quickstart に接続し、デフォルトで未登録デバイスになります。options dict は Internet of Things Foundation モジュールと対話するために使用する定義を作成します。
ko: 옵션 dict가 제공되지 않는 경우 클라이언트는 Internet of Things Foundation Quickstart에 연결하며 등록되지 않은 디바이스로 기본값이 설정됩니다. 옵션 dict는 Internet of Things Foundation 모듈과 상호작용하는 데 사용되는 정의를 작성합니다.
pt_br: Se nenhum dic de opções for fornecido, o cliente irá se conectar ao Quickstart do Internet of Things Foundation e será padronizado para um dispositivo não registrado. O dic de opções cria definições que são usadas para interagir com o módulo do Internet of Things Foundation.
zh_tw: 如果未提供選項 dict，用戶端將連接到 Internet of Things Foundation Quickstart，並預設為已取消登錄的裝置。選項 dict 建立的定義是用來與 Internet of Things Foundation 模組進行互動。

source: Using a configuration file
de: Konfigurationsdatei verwenden
ja: 構成ファイルの使用
ko: 구성 파일 사용
pt_br: Usando um arquivo de configuração
zh_tw: 使用配置檔

source: Instead of including an options dict directly, you can use a configuration file containing an options dict. If you are using a configuration file containing an options dict, use the following code format.
de: Anstatt ein Options-Dict direkt einzubeziehen, können Sie eine Konfigurationsdatei verwenden, die ein Options-Dict enthält. Wenn Sie eine Konfigurationsdatei verwenden, die ein Options-Dict enthält, verwenden Sie das folgende Codeformat.
ja: options dict を直接組み込む代わりに、options dict を含んでいる構成ファイルを使用できます。options dict を含んでいる構成ファイルを使用している場合、以下のコード形式を使用してください。
ko: 옵션 dict를 직접 포함하는 대신 옵션 dict가 포함된 구성 파일을 사용할 수 있습니다. 옵션 dict가 포함된 구성 파일을 사용하는 경우에는 다음의 코드 형식을 사용하십시오.
pt_br: Em vez de incluir um dic de opções diretamente, você pode usar um arquivo de configuração contendo um dic de opções. Se você estiver usando um arquivo de configuração contendo um dic de opções, use o seguinte formato de código.
zh_tw: 可以使用一個包含選項 dict 的配置檔，而不直接包含選項 dict。如果使用的配置檔包含選項 dict，請使用下列程式碼格式。

source: The content of the configuration file must be in the following format:
ja: 構成ファイルのコンテンツは、以下の形式でなければなりません。
ko: 구성 파일 컨텐츠의 형식은 다음 형식이어야 합니다.
pt_br: O conteúdo do arquivo de configuração deve estar no seguinte formato:

source: Publishing events
de: Ereignisse publizieren
ja: イベントのパブリッシング
ko: 이벤트 공개
pt_br: Publicando eventos
zh_tw: 發佈事件

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind die Mechanismen, mit denen Einheiten Daten bei Internet of Things Foundation publizieren. Die Einheit steuert den Inhalt des Ereignisses und ordnet einen Namen für jedes von der Einheit gesendete Ereignis zu.
ja: イベントとは、デバイスが Internet of Things Foundation にデータをパブリッシュする際に使用するメカニズムです。デバイスはイベントのコンテンツを制御し、送信するイベントごとに名前を割り当てます。
ko: 이벤트는 디바이스가 Internet of Things Foundation에 데이터를 공개하는 데 사용하는 메커니즘입니다. 디바이스는 이벤트의 컨텐츠를 제어하고 전송하는 각 이벤트에 대해 이름을 지정합니다.
pt_br: Eventos são o mecanismo pelo qual os dispositivos publicam dados no Internet of Things Foundation. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_tw: 事件是裝置藉以將資料發佈到 Internet of Things Foundation 的機制。裝置可控制事件的內容，並為它傳送的每一個事件指派一個名稱。

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
de: Wenn ein Ereignis von IoT Foundation empfangen wird, werden die Identifikationsdaten der Verbindung, mit der das Ereignis empfangen wurde, dazu verwendet, die Einheit zu ermitteln, von der das Ereignis gesendet wurde. Mit dieser Architektur ist es für eine Einheit unmöglich, die Identität einer anderen Einheit anzunehmen.
ja: IoT Foundation がイベントを受け取ると、イベントが受信された接続の資格情報を使用して、イベントの送信元デバイスが判別されます。このアーキテクチャーにより、デバイスは別のデバイスの偽名を使用することが不可能になります。
ko: IoT Foundation이 이벤트를 수신하면 이벤트가 수신된 연결의 신임 정보를 사용하여 이벤트를 전송한 디바이스를 판별합니다. 이 아키텍처를 사용하면 한 디바이스가 다른 디바이스를 위장할 수 없습니다.
pt_br: Quando um evento é recebido pelo IoT Foundation, as credenciais da conexão na qual o evento foi recebido são usadas para determinar de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.
zh_tw: 當 IoT Foundation 接收事件時，會使用接收事件之連線的認證來判定是從哪個裝置傳送事件。在此架構下，裝置無法假冒另一個裝置。

source: Events can be published at any of the three :ref:`quality of service levels <qoslevels>` defined by the MQTT protocol. By default events will be published as qos level 0.
de: Ereignisse können mit jeder der drei Servicequalitätsstufen (:ref:`quality of service levels <qoslevels>`), die durch das MQTT-Protokoll definiert sind, publiziert werden. Standardmäßig werden Ereignisse als qos-Stufe 0 publiziert.
ja: イベントは、MQTT プロトコルによって定義された 3 つの :ref:`サービスの品質<qoslevels>` のいずれでもパブリッシュできます。デフォルトで、イベントは qos レベル 0 としてパブリッシュされます。
ko: 이벤트는 MOTT 프로토콜에 의해 정의된 세 가지 :ref:`서비스 품질(QoS) 레벨 <qoslevels>`에서 공개될 수 있습니다. 기본적으로 이벤트는 qos 레벨 0으로 공개됩니다.
pt_br: Os eventos podem ser publicados em qualquer um dos três :ref:`níveis de qualidade de serviço <qoslevels>` definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como qos nível 0.
zh_tw: 可使用 MQTT 通訊協定所定義的三個 :ref: `服務品質等級 <qoslevels>` 的其中一個來發佈事件。依預設，將以服務品質等級 0 發佈事件。

source: Publish event using default quality of service
de: Ereignisse mit der standardmäßigen Servicequalität publizieren
ja: デフォルトのサービスの品質を使用してイベントをパブリッシュ
ko: 기본 서비스 품질(QoS)을 사용하여 이벤트 공개
pt_br: Publicar evento usando a qualidade de serviço padrão
zh_tw: 使用預設服務品質發佈事件

source: Publish event using user-defined quality of service
de: Ereignisse mit einer benutzerdefinierten Servicequalität publizieren
ja: ユーザー定義のサービスの品質を使用してイベントをパブリッシュ
ko: 사용자 정의 서비스 품질(QoS)을 사용하여 이벤트 공개
pt_br: Publicar evento usando a qualidade de serviço definida pelo usuário
zh_tw: 利用使用者定義的服務品質發佈事件

source: Events can be published at higher MQTT quality of servive levels, but these events may take slower then QoS level 0, because of the extra confirmation of receipt.
de: Ereignisse könne auf höheren MQTT-Servicequalitätsstufen publiziert werden. Diese Ereignisse können jedoch wegen der zusätzlichen Eingangsbestätigung langsamer sein als QoS-Stufe 0.
ja: イベントは、より高レベルな MQTT サービスの品質でパブリッシュできますが、余分な受信の確認があるためこれらのイベントは QoS レベル 0 よりも低速になる可能性があります。
ko: 이벤트는 더 높은 MQTT 서비스 품질(QoS) 레벨에서 공개될 수 있지만 추가적인 수신 확인으로 인해 이 이벤트는 QoS 레벨 0보다 느릴 수 있습니다.
pt_br: Os eventos podem ser publicados em níveis de qualidade de serviço MQTT superiores, mas esses eventos podem ser mais lentos que o QoS nível 0 por causa da confirmação de recebimento extra.
zh_tw: 可以用更高 MQTT 服務品質等級發佈事件，但這些事件的速度比服務品質等級 0 更慢，因為要進行額外的接收確認。

source: Handling commands
de: Befehle verarbeiten
ja: コマンドの処理
ko: 명령 처리
pt_br: Manipulando comandos
zh_tw: 處理指令

source: When the device client connects it automatically subscribes to any command for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
de: Wenn der Einheitenclient die Verbindung herstellt, subskribiert er automatisch jeden Befehl für diese Einheit. Zum Verarbeiten bestimmter Befehle müssen Sie eine Callback-Methode für Befehle registrieren. Die Nachrichten werden als eine Instanz der Befehlsklasse zurückgegeben, die die folgenden Eigenschaften hat:
ja: デバイス・クライアントは、接続時に自動的にこのデバイスのコマンドをサブスクライブします。特定のコマンドを処理するには、コマンド・コールバック・メソッドを登録する必要があります。メッセージは、以下のプロパティーを持つ Command クラスのインスタンスとして返されます。
ko: 디바이스 클라이언트는 연결되면 이 디바이스에 대한 명령을 자동으로 구독합니다. 특정 명령을 처리하려면 명령 콜백 메소드를 등록해야 합니다. 메시지는 다음과 같은 특성을 가진 명령 클래스의 인스턴스로 리턴됩니다.
pt_br: Quando o cliente do dispositivo se conecta, ele automaticamente assina qualquer comando para esse dispositivo. Para processar comandos específicos, você precisa registrar um método de retorno de chamada de comando. As mensagens são retornadas como uma instância da classe Comando, que possui as seguintes propriedades:
zh_tw: 當裝置用戶端連接時，它會自動訂閱此裝置的任何指令。若要處理特定指令，則需要登錄指令回呼方法。會以「指令」類別的實例傳回訊息，此類別具有下列內容：

source: payload - string
ja: payload - ストリング
ko: 페이로드 - 문자열
pt_br: carga útil - sequência

source: format - string
de: format - Zeichenfolge
ja: format - ストリング
ko: 형식 - 문자열
pt_br: formato - sequência
zh_tw: format - 字串

source: data - dict
ko: 데이터 - dict
pt_br: dados - dic

source: timestamp - datetime
de: timestamp - Datum/Uhrzeit
ja: timestamp - 日時
ko: 시간소인 - 날짜/시간
pt_br: registro de data e hora - data/hora
zh_tw: timestamp - 日期時間

source: Custom message format support
de: Unterstützung für das Format angepasster Nachrichten
ja: カスタム・メッセージ形式のサポート
ko: 사용자 정의 메시지 형식 지원
pt_br: Suporte ao formato de mensagem customizada
zh_tw: 自訂訊息格式支援

source: By default the library supports the encoding and decoding of Python dictionary objects as JSON when you use msgFormat "json". When you use msgFormat "json-iotf" it will encode the message in accordance with the IoTF JSON Payload Specification. To add support for your own custom message formats see the `sample in GitHub <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__
de: Standardmäßig unterstützt die Bibliothek die Codierung und Decodierung von Python-Dictionary-Objekten als JSON, wenn Sie das msgFormat-Nachrichtenformat "json" verwenden. Wenn Sie das Nachrichtenformat "json-iotf" verwenden, wird die Nachricht in Übereinstimmung mit der IoTF JSON Payload Specification codiert. Zum Hinzufügen der Unterstützung für Ihre eigenen angepassten Nachrichtenformate siehe das `Beispiel in GitHub <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__
ja: msgFormat "json" を使用している場合、ライブラリーはデフォルトで JSON としての Python ディクショナリー・オブジェクトのエンコードおよびデコードをサポートします。msgFormat "json-iotf" を使用している場合、メッセージは IoTF JSON ペイロード仕様に従ってエンコードされます。独自のカスタム・メッセージ形式のサポートを追加するには、`GitHub のサンプル <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__ を参照してください。
ko: 기본적으로 라이브러리는 사용자가 msgFormat "json"을 사용할 때 Python 사전 오브젝트를 JSON으로 인코딩 및 디코딩하는 것을 지원합니다. msgFormat "json-iotf"를 사용하는 경우에는 IoTF JSON 페이로드 스펙에 따라 메시지가 인코딩됩니다. 자체 사용자 정의 메시지 형식에 대한 지원을 추가하려면 `GitHub의 샘플(<https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>)`을 참조하십시오.
pt_br: Por padrão, a biblioteca suporta a codificação e a decodificação de objetos do dicionário Python como JSON quando você usa msgFormat "json". Quando você usa msgFormat "json-iotf", isso codificará a mensagem de acordo com o IoTF JSON Payload Specification. Para incluir suporte para seus próprios formatos de mensagem customizada, consulte `amostra em GitHub <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__
zh_tw: 依預設，當您使用 msgFormat "json" 時，此程式庫支援以 JSON 格式對 Python 字典物件進行編碼和解碼。當您使用 msgFormat "json-iotf" 時，它會根據「IoTF JSON 內容規格」將訊息編碼。若要新增對自訂訊息格式的支援，請參閱 `GitHub 中的範例 <https://github.com/ibm-messaging/iot-python/tree/master/samples/customMessageFormat>`__

source: Once you have created your custom encoder module it needs to be registered in the device client. If you attempt to use an unknown message format when sending an event or the device receives a command send in a format that it does not know how to decode then the library will throw a MissingMessageDecoderException.
de: Wenn Sie Ihr angepasstes Encoder-Modul erstellt haben, muss es im Einheitenclient registriert werden. Wenn Sie versuchen, ein unbekanntes Nachrichtenformat beim Senden eines Ereignisses zu verwenden, oder wenn die Einheit einen Befehl empfängt, der in einem Format gesendet wurde, das die Einheit nicht decodieren kann, gibt die Einheit die Ausnahmebedingung MissingMessageDecoderException aus.
ja: 作成したカスタム・エンコーダー・モジュールは、デバイス・クライアントに登録する必要があります。イベントの送信時に不明なメッセージ形式の使用を試みた場合、またはデバイスがデコード方法を認識していない形式で送信されたコマンドを受信した場合、ライブラリーは MissingMessageDecoderException をスローします。
ko: 사용자 정의 인코더 모듈을 작성한 후에는 디바이스 클라이언트에서 이를 등록해야 합니다. 이벤트를 전송할 때 알 수 없는 메시지를 사용하거나 디바이스가 디코딩 방법을 모르는 형식의 명령 전송을 수신하는 경우 라이브러리에는 MissingMessageDecoderException이 발생합니다.
pt_br: Depois de ter criado seu módulo de codificador customizado, ele precisará ser registrado no cliente do dispositivo. Se você tentar usar um formato de mensagem desconhecido ao enviar um evento ou o dispositivo receber um comando enviar em um formato que ele não sabe como decodificar, a biblioteca lançará um MissingMessageDecoderException.
zh_tw: 當您建立自訂編碼器模組之後，需要在裝置用戶端中登錄它。如果您試圖在傳送事件時使用不明訊息格式，或裝置接收的指令是以它不知道如何解碼的格式傳送，則此程式庫會擲出 MissingMessageDecoderException。

source: This client library describes how to use devices with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <../libraries/python.html#/>`__.
de: Diese Clientbibliothek beschreibt die Verwendung von Einheiten mit dem Python-Modul ibmiotf. Hilfe bei den ersten Schritten mit diesem Modul siehe `Python-Clientbibliothek - Einführung <../libraries/python.html#/>`__.
zh_tw: 此用戶端程式庫說明要如何搭配 Python ibmiotf 模組來使用裝置。開始使用此模組時如需協助，請參閱 `Python 用戶端程式庫 - 簡介 <../libraries/python.html#/>`__。

source: The content of the configuration file must be in the following format(need not contain **$** sign):
de: Der Inhalt der Konfigurationsdatei muss im folgenden Format vorliegen (darf nicht das Zeichen **$** enthalten):
zh_tw: 配置檔的內容必須為下列格式（不需要包含 **$** 符號）：

source: command - string
de: command - Zeichenfolge
zh_tw: command - 字串
