Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_sample_doc.po
Languages: es, it, ko, zh_cn

source: Python Client Library - Devices
es: Biblioteca de cliente Python - Dispositivos
it: Libreria client Python - Dispositivi
ko: Python 클라이언트 라이브러리 - 디바이스
zh_cn: Python 客户机库 - 设备

source: Introduction
es: Introducción
it: Introduzione
ko: 소개
zh_cn: 简介

source: This client library describes how to use devices with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
es: Esta biblioteca de cliente describe cómo utilizar dispositivos con el módulo python ibmiotf. Para obtener ayuda sobre cómo empezar a utilizar este módulo, consulte `Biblioteca de cliente Python - Introducción <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
it: Questa libreria client descrive come utilizzare i dispositivi con il modulo ibmiotf python. Per una guida introduttiva per questo modulo, consultare `Libreria client Python - Introduzione <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
ko: 이 클라이언트 라이브러리는 Python ibmiotf 모듈을 가진 디바이스를 사용하는 방법에 대해 설명합니다. 이 모듈을 시작하는 방법은 `Python Client Library - Introduction(<https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>)`을 참조하십시오.
zh_cn: 此客户机库描述如何将设备与 python ibmiotf 模块配合使用。有关此模块的入门帮助，请参阅 `Python 客户机库 - 简介 <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__。

source: The client library is divided into two sections, both included within the library. This section contains information on how devices publish events and handle commands using the Python ibmiotf module, and the Applications section contains information on how applications can use the ibmiotf module to interact with devices.
es: La biblioteca de cliente se divide en dos secciones, ambas incluidas en la biblioteca. Esta sección contiene información sobre cómo los dispositivos publican sucesos y manejan mandatos utilizando el módulo Python ibmiotf y la sección Aplicaciones contiene información sobre cómo las aplicaciones pueden utilizar el módulo ibmiotf para interactuar con los dispositivos.
it: La libreria client è divisa in due sezioni, entrambe incluse all'interno della libreria. Questa sezione contiene informazioni su come i dispositivi pubblicano gli eventi e gestiscono i comandi tramite l'utilizzo del modulo ibmiotf Python, e la sezione Applicazioni contiene informazioni su come le applicazioni possono utilizzare il modulo ibmiotf per interagire con i dispositivi.
ko: 이 클라이언트 라이브러리는 두 개의 절로 구성되며 두 개의 절 모두 라이브러리에 포함되어 있습니다. 이 절에는 디바이스가 Python ibmiotf 모듈을 사용하여 이벤트를 공개하고 명령을 처리하는 방법에 대한 정보가 포함되어 있고 애플리케이션 절에는 애플리케이션이 ibmiotf 모듈을 사용하여 디바이스와 상호작용하는 방법에 대한 정보가 포함되어 있습니다.
zh_cn: The client library is divided into two sections, both included within the library. 此部分包含有关设备如何使用 Python ibmiotf 模块发布事件和处理命令的信息；“应用程序”部分包含有关应用程序如何使用 ibmiotf 模块来与设备进行交互的信息。

source: This section lists the code samples which are bundled with the ibmiotf python module, and gives and introduction to their function and purpose.
es: En esta sección se listan los ejemplos de código que están empaquetados con el módulo ibmiotf de python y se proporciona una introducción a la función y la finalidad de los mismos.
it: Questa sezione elenca gli esempi di codice che sono forniti con il modulo ibmiotf python e fornisce una introduzione alle funzioni e alla finalità.
ko: 이 절에는 ibmiotf Python 모듈과 함께 번들로 제공되는 코드 샘플이 나열되고 해당 함수 및 용도에 대한 소개가 제공됩니다.
zh_cn: 此部分列出与 ibmiotf python 模块捆绑在一起的代码样本，并对其功能和目的提供了简介。

source: The bluemixZoneDemo Sample
es: Ejemplo bluemixZoneDemo
it: L'esempio bluemixZoneDemo
ko: bluemixZoneDemo 샘플
zh_cn: bluemixZoneDemo 样本

source: The cli Sample
es: Ejemplo de cli
it: L'esempio cli
ko: cli 샘플
zh_cn: cli 样本

source: The customMessageFormat
es: customMessageFormat
it: Il customMessageFormat
ko: customMessageFormat
zh_cn: customMessageFormat

source: The helloWorld Sample
es: Ejemplo helloWorld
it: L'esempio helloWorld
ko: helloWorld 샘플
zh_cn: helloWorld 样本

source: The psutil Sample
es: Ejemplo psutil
it: L'esempio psutil
ko: psutil 샘플
zh_cn: psutil 样本

source: The simpleApp Sample
es: Ejemplo simpleApp
it: L'esempio simpleApp
ko: simpleApp 샘플
zh_cn: simpleApp 样本
