Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/libraries/python_cli_for_apps.po
Languages: de, fr

source: Python Client Library - Applications
de: Python-Clientbibliothek - Anwendungen
fr: Bibliothèque client Python - Applications

source: Introduction
de: Einführung

source: This client library describes how to use applications with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.
de: Diese Clientbibliothek beschreibt die Verwendung von Anwendungen mit dem Python-Modul ibmiotf. Hilfe bei den ersten Schritten mit diesem Modul siehe `Python-Clientbibliothek - Einführung <https://docs.internetofthings.ibmcloud.com/libraries/python.html#/>`__.

source: This client library is divided into two sections, both included within the library. This section contains information on how applications interact with devices using the Python ibmiotf module, and the Devices section contains information on how devices can use the ibmiotf module publish events and handle commands.
de: Diese Clientbibliothek ist in zwei Abschnitte unterteilt, die beide in der Bibliothek enthalten sind. Dieser Abschnitt enthält Informationen dazu, wie Anwendungen mit Einheiten interagieren, die das Python-Modul ibmiotf verwenden; der Abschnitt 'Einheiten' enthält Informationen dazu, wie Einheiten das Modul ibmiotf zum Publizieren von Ereignissen und Ausführen von Befehlen verwenden können.
fr: Cette bibliothèque client est divisée en deux sections, placées chacune dans la bibliothèque. Cette section contient des informations décrivant le mode d'interaction des applications avec les terminaux à l'aide du module Python ibmiotf. La section Terminaux contient des informations expliquant comment les terminaux peuvent utiliser le module ibmiotf pour publier des événements et traiter des commandes.

source: Constructor
de: Konstruktor
fr: Constructeur

source: The constructor builds the client instance, and accepts an options dict containing the following definitions:
de: Der Konstruktor erstellt die Clientinstanz und akzeptiert ein Optionsverzeichnis, das die folgenden Definitionen enthält:
fr: Le constructeur génère l'instance client et accepte un objet 'options dict' contenant les définitions suivantes :

source: org - Your organization ID.
de: org - Ihre Organisations-ID.
fr: org - ID de votre organisation.

source: id - The unique ID of your application within your organization.
de: id - Die eindeutige ID Ihrer Anwendung innerhalb Ihrer Organisation.
fr: id - ID unique de votre application au sein de l'organisation.

source: auth-method - Method of authentication (the only value currently supported is "apikey").
de: auth-method - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "apikey").
fr: auth-method - Méthode d'authentification. (La seule valeur actuellement prise en charge est "apikey".)

source: auth-key - API key (required if auth-method is "apikey").
de: auth-key - API-Schlüssel (erforderlich, falls auth-method den Wert "apikey" hat).
fr: auth-key - Clé d'API (obligatoire si auth-method a pour valeur "apikey").

source: auth-token - API key token (required if auth-method is "apikey").
de: auth-token - API-Schlüsseltoken (erforderlich, falls auth-method den Wert "apikey" hat).
fr: auth-token - Jeton de la clé d'API (obligatoire si auth-method a pour valeur "apikey").

source: If no options dict is provided, the client will connect to the Internet of Things Foundation Quickstart, and default to an unregistered device. The options dict creates definitions which are used to interact with the Internet of Things Foundation module.
de: Wenn kein Options-Dict bereit gestellt wird, stellt der Client die Verbindung mit Internet of Things Foundation Quickstart her und nimmt standardmäßig den Wert einer nicht registrierten Einheit an. Das Options-Dict erstellt Definitionen, die zur Interaktion mit dem Internet of Things Foundation-Modul verwendet werden.
fr: Si vous ne fournissez pas d'objet 'options dict', le client se connecte au composant Quickstart d'Internet of Things Foundation et est associé par défaut à un terminal non enregistré. L'objet 'options dict' crée des définitions qui permettent d'interagir avec le module Internet of Things Foundation.

source: Using a configuration file
de: Konfigurationsdatei verwenden
fr: Utilisation d'un fichier de configuration

source: If you are not using an options dict as shown above, you include a configuration file containing an options dict. If you are using a configuration file containing an options dict, use the following code format.
de: Wenn Sie kein Options-Dict (wie oben gezeigt) verwenden, nehmen Sie eine Konfigurationsdatei auf, die ein Options-Dict enthält. Wenn Sie eine Konfigurationsdatei verwenden, die ein Options-Dict enthält, verwenden Sie das folgende Codeformat.
fr: Si vous n'utilisez pas d'objet 'options dict' comme indiqué ci-dessus, vous devez inclure un fichier de configuration contenant un objet 'options dict'. Si vous utilisez un fichier de configuration contenant un objet 'options dict', utilisez le format de code suivant :

source: The application configuration file must be in the following format:
de: Die Anwendungskonfigurationsdatei muss im folgenden Format vorliegen:
fr: Le fichier de configuration de l'application doit posséder le format suivant :

source: Subscribing to device events
de: Einheitenereignisse subskribieren
fr: Abonnement aux événements d'un terminal

source: Events are the mechanism by which devices publish data to the Internet of Things Foundation. The device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind die Mechanismen, mit denen Einheiten Daten bei Internet of Things Foundation publizieren. Die Einheit steuert den Inhalt des Ereignisses und ordnet einen Namen für jedes von der Einheit gesendete Ereignis zu.
fr: Les événements représentent le mécanisme par lequel les terminaux publient les données dans Internet of Things Foundation. Le terminal contrôle le contenu de l'événement et affecte un nom à chaque événement qu'il envoie.

source: When an event is received by the IoT Foundation the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
de: Wenn ein Ereignis von IoT Foundation empfangen wird, werden die Identifikationsdaten der Verbindung, mit der das Ereignis empfangen wurde, dazu verwendet, die Einheit zu ermitteln, von der das Ereignis gesendet wurde. Mit dieser Architektur ist es für eine Einheit unmöglich, die Identität einer anderen Einheit anzunehmen.
fr: Lorsqu'un événement est reçu par IoT Foundation, les données d'identification de la connexion sur laquelle l'événement a été reçu sont utilisées pour identifier le terminal qui a envoyé l'événement. Avec cette architecture, un terminal ne peut en aucun cas simuler les droits d'accès d'un autre terminal.

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
de: Standardmäßig subskribieren Anwendungen alle Ereignisse von allen verbundenen Einheiten. Verwenden Sie die Parameter type, id, event und msgFormat, um den Geltungsbereich der Subskription zu steuern. Ein einzelner Client kann mehrere Subskriptionen unterstützen. Die nachfolgenden Codebeispiele zeigen beispielhaft die Vorgehensweise beim Subskribieren bei Einheiten abhängig von den Einheitenparametern type, id, event und msgFormat.
fr: Par défaut, les applications sont abonnées à tous les événements de tous les terminaux connectés. Utilisez les paramètres type, id, event et msgFormat pour contrôler la portée de l'abonnement. Un même client peut prendre en charge plusieurs abonnements. Les exemples de code ci-après expliquent comment s'abonner à des terminaux en fonction des paramètres type, id, event et msgFormat.

source: To subscribe to all events from all devices
de: Zum Subskribieren aller Ereignisse von allen Einheiten
fr: Abonnement à tous les événements de tous les terminaux

source: To subscribe to all events from all devices of a specific type
de: Zum Subskribieren aller Ereignisse von allen Einheiten eines bestimmten Typs
fr: Abonnement à tous les événements de tous les terminaux d'un type donné

source: To subscribe to a specific event from all devices
de: Zum Subskribieren eines bestimmten Ereignisses von allen Einheiten
fr: Abonnement à un événement spécifique de tous les terminaux

source: To subscribe to a specific event from two or more different devices
de: Zum Subskribieren eines bestimmten Ereignisses von zwei oder mehr verschiedenen Einheiten
fr: Abonnement à un événement spécifique de plusieurs terminaux

source: To subscribe to all events published by a device in json format
de: Zum Subskribieren aller Ereignisse, die von einer Einheit im json-Format publiziert werden
fr: Abonnement à tous les événements publiés par un terminal au format json

source: Handling events from devices
de: Ereignisse von Einheiten verarbeiten
fr: Traitement des événements provenant des terminaux

source: To process the events received by your subscroptions you need to register an event callback method. The messages are returned as an instance of the Event class:
de: Zum Verarbeiten der Ereignisse, die von Ihren Subskriptionen empfangen wurden, müssen Sie eine Ereignis-Callback-Methode registrieren. Die Nachrichten werden als eine Instanz der Ereignisklasse zurückgegeben:

source: event.device - string (uniquely identifies the device across all types of devices in the organization)
de: event.device - Zeichenfolge (kennzeichnet eindeutig die Einheit über alle Typen von Einheiten in der Organisation)
fr: event.device - Chaîne (qui identifie de manière unique le terminal parmi tous les types de terminaux de l'organisation)

source: event.deviceType - string
de: event.deviceType - Zeichenfolge
fr: event.deviceType - Chaîne

source: event.deviceId - string
de: event.deviceId - Zeichenfolge
fr: event.deviceId - Chaîne

source: event.event - string
de: event.event - Zeichenfolge
fr: event.event - Chaîne

source: event.format - string
de: event.format - Zeichenfolge
fr: event.format - Chaîne

source: event.timestamp - datetime
de: event.timestamp - Datum/Uhrzeit
fr: event.timestamp - Objet datetime

source: Subscribing to device status
de: Einheitenstatus subskribieren
fr: Abonnement au statut des terminaux

source: By default, this will subscribe to status updates for all connected devices. Use the type and id parameters to control the scope of the subscription. A single client can support multiple subscriptions.
de: Standardmäßig werden hiermit Statusaktualisierungen für alle verbundenen Einheiten subskribiert. Verwenden Sie die Parameter type und id, um den Geltungsbereich der Subskription zu steuern. Ein einzelner Client kann mehrere Subskriptionen unterstützen.
fr: Par défaut, vous êtes abonné aux mises à jour du statut de tous les terminaux connectés. Utilisez les paramètres type et id pour contrôler la portée de l'abonnement. Un même client peut prendre en charge plusieurs abonnements.

source: Subscribe to status updates for all devices
de: Statusaktualisierungen für alle Einheiten subskribieren
fr: Abonnement aux mises à jour du statut de tous les terminaux

source: Subscribe to status updates for all devices of a specific type
de: Statusaktualisierungen für alle Einheiten eines bestimmten Typs subskribieren
fr: Abonnement aux mises à jour du statut de tous les terminaux d'un type donné

source: Subscribe to status updates for two different devices
de: Statusaktualisierungen für zwei verschiedene Einheiten subskribieren
fr: Abonnement aux mises à jour du statut de deux terminaux différents

source: Handling status updates from devices
de: Statusaktualisierungen von Einheiten verarbeiten
fr: Traitement des mises à jour du statut des terminaux

source: To process the status updates received by your subscriptions you need to register an event callback method. The messages are returned as an instance of the Status class:
de: Zum Verarbeiten der Statusaktualisierungen, die von Ihren Subskriptionen empfangen wurden, müssen Sie eine Ereignis-Callback-Methode registrieren. Die Nachrichten werden als eine Instanz der Statusklasse zurückgegeben:
fr: Pour traiter les mises à jour du statut reçues via vos abonnements, vous devez enregistrer une méthode de rappel d'événement. Les messages sont renvoyés sous la forme d'une instance de la classe Status :

source: The following properties are set for both "Connect" and "Disconnect" status events:
de: Die folgenden Eigenschaften werden für die Statusereignisse "Connect" und "Disconnect" gesetzt:
fr: Les propriétés suivantes sont définies pour les événements de statut "Connexion" (Connect) et "Déconnexion" (Disconnect) :

source: status.clientAddr - string
de: status.clientAddr - Zeichenfolge
fr: status.clientAddr - Chaîne

source: status.protocol - string
de: status.protocol - Zeichenfolge
fr: status.protocol - Chaîne

source: status.clientId - string
de: status.clientId - Zeichenfolge
fr: status.clientId - Chaîne

source: status.user - string
de: status.user - Zeichenfolge
fr: status.user - Chaîne

source: status.time - datetime
de: status.time - Datum/Uhrzeit
fr: status.time - Objet datetime

source: status.action - string
de: status.action - Zeichenfolge
fr: status.action - Chaîne

source: status.connectTime - datetime
de: status.connectTime - Datum/Uhrzeit
fr: status.connectTime - Objet datetime

source: status.port - integer
de: status.port - ganze Zahl
fr: status.port - Entier

source: The following properties are only set when the action is "Disconnect":
de: Die folgenden Eigenschaften werden nur dann gesetzt, wenn die Aktion "Disconnect" lautet:
fr: Les propriétés suivantes sont définies uniquement lorsque l'action est "Déconnexion" (Disconnect) :

source: status.writeMsg - integer
de: status.writeMsg - ganze Zahl
fr: status.writeMsg - Entier

source: status.readMsg - integer
de: status.readMsg - ganze Zahl
fr: status.readMsg - Entier

source: status.reason - string
de: status.reason - Zeichenfolge
fr: status.reason - Chaîne

source: status.readBytes - integer
de: status.readBytes - ganze Zahl
fr: status.readBytes - Entier

source: status.writeBytes - integer
de: status.writeBytes - ganze Zahl
fr: status.writeBytes - Entier

source: Publishing events from devices
de: Ereignisse von Einheiten publizieren
fr: Publication des événements provenant des terminaux

source: Applications can publish events as if they originated from a Device
de: Anwendungen können Ereignisse so publizieren, als ob sie von einer Einheit stammen
fr: Les applications peuvent publier des événements comme s'ils provenaient d'un terminal

source: Publishing commands to devices
de: Befehle für Einheiten publizieren
fr: Publication de commandes sur des terminaux

source: Applications can publish commands to connected devices
de: Anwendungen können Befehle an verbundene Einheiten publizieren
fr: Les applications peuvent publier des commandes sur des terminaux connectés

source: Retrieve device details
de: Einheitendetails abrufen
fr: Extraction des détails d'un terminal

source: Retrieve details of all registered devices
de: Details aller registrierten Einheiten abrufen
fr: Extraction des détails de tous les terminaux enregistrés

source: Retrieve details of a specific device
de: Details einer bestimmten Einheit abrufen
fr: Extraction des détails d'un terminal spécifique

source: Register a new device
de: Neue Einheit registrieren
fr: Enregistrement d'un nouveau terminal

source: Delete a device
de: Einheit löschen
fr: Suppression d'un terminal

source: Access historical event data
de: Auf historische Ereignisdaten zugreifen
fr: Accès aux données d'événement d'historique

source: Get historical event data for a specific device
de: Auf historische Ereignisdaten für eine bestimmte Einheit zugreifen
fr: Obtention des données d'événement d'historique d'un terminal spécifique

source: Get historical event data for all devices of a specific type
de: Auf historische Ereignisdaten für alle Einheiten eines bestimmten Typs zugreifen
fr: Obtention des données d'événement d'historique de tous les terminaux d'un type donné

source: Get historical event data for all devices of all types
de: Auf historische Ereignisdaten für alle Einheiten aller Typen zugreifen
fr: Obtention des données d'événement d'historique de tous les terminaux de tous types

source: This client library describes how to use applications with the python ibmiotf module. For help with getting started with this module, see `Python Client Library - Introduction <../libraries/python.html#/>`__.
fr: Cette bibliothèque client explique comment utiliser des applications avec le module Python ibmiotf. Pour obtenir de l'aide lors de la mise en route de ce module, reportez-vous à la section `Bibliothèque client Python - Introduction <../libraries/python.html#/>`__.

source: To process the events received by your subscriptions you need to register an event callback method. The messages are returned as an instance of the Event class:
fr: Pour traiter les événements reçus via vos abonnements, vous devez enregistrer une méthode de rappel d'événement. Les messages sont renvoyés sous la forme d'une instance de la classe Event :
