Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/operations/device_actions.po
Languages: de

source: Device Management Operations - Device Actions
de: Einheitenmanagementoperationen - Einheitenaktionen

source: Reboot
de: Neu starten

source: The Internet of Things Foundation can send this request to reboot a device. The action is considered complete when the device sends a Manage device request following its reboot.
de: Von Internet of Things Foundation kann diese Anforderung zum erneuten Starten einer Einheit gesendet werden. Die Aktion wird als abgeschlossen betrachtet, wenn die Einheit eine 'Einheit verwalten'-Anforderung nach dem Neustart sendet.

source: If this operation can be initiated immediately, set "rc" to 202, if reboot attempt fails, the "rc" is set to 500 and the "message" field should be set accordingly, if the reboot is not supported, set "rc" to 501 and optionally set "message" accordingly.
de: Wenn diese Operation sofort eingeleitet werden kann, stellen Sie für "rc" den Wert 202 ein; wenn der Neustart fehlschlägt, stellen Sie für "rc" den Wert 500 ein und nehmen im Feld "message" die entsprechenden Einstellungen vor; wenn der Neustart nicht unterstützt wird, stellen Sie für "rc" den Wert 501 ein und nehmen im Feld "message" die entsprechenden Einstellungen vor.

source: Topic
de: Thema

source: Message format
de: Nachrichtenformat

source: Request Format:
de: Anforderungsformat:

source: Response Format:
de: Antwortformat:

source: The Internet of Things Foundation can send this request to reset the device to factory settings, as part of this process, the device also reboots. The action is considered complete when the device sends a Manage device request following its reboot.
de: Von Internet of Things Foundation kann diese Anforderung zum Zurücksetzen der Einheit auf die Werkseinstellungen gesendet werden; im Verlauf dieses Prozesses wird die Einheit auch erneut gestartet. Die Aktion wird als abgeschlossen betrachtet, wenn die Einheit eine 'Einheit verwalten'-Anforderung nach dem Neustart sendet.

source: The response code should be 202 if this action can be initiated immediately. If the factory reset attempt fails, the "rc" should be 500 and the "message" field should be set accordingly, if the factory reset action is not supported, set "rc" to 501 and optionally set "message" accordingly.
de: Der Antwortcode muss 202 lauten, wenn diese Aktion sofort initiiert werden kann. Wenn die Factory-Reset-Aktion fehlschlägt, müssen für "rc" der Wert 500 eingestellt und im Feld "message" die entsprechenden Einstellungen vorgenommen werden; wenn die Factory-Reset-Aktion nicht unterstützt wird, muss für "rc" der Wert 501 eingestellt werden, im Feld "message" können optional die entsprechenden Einstellungen vorgenommen werden.
