Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/operations/diagnostics.po
Languages: es, zh_cn

source: Device Management Operations - Diagnostics
es: Operaciones de gestión de dispositivo - Diagnóstico
zh_cn: 设备管理操作 - 诊断

source: The device diagnostics operations are intended to provide information on device errors, and does not provide diagnostic information relating to the devices connection to the Internet of Things Foundation.
es: El diagnóstico de dispositivo está pensado para proporcionar información sobre errores de dispositivo y no proporciona información relacionada con la conexión de los dispositivos a Internet of Things Foundation.
zh_cn: 设备诊断操作用于提供有关设备错误的信息，而不提供与 Internet of Things Foundation 的设备连接相关的诊断信息。

source: Add Error Code
es: Añadir código de error
zh_cn: 添加错误代码

source: Devices can choose to notify the Internet of Things Foundation device management server about changes in their error status.
es: Los dispositivos pueden optar por notificar al servidor de gestión de dispositivos de Internet of Things Foundation los cambios producidos en sus estados de error.
zh_cn: 设备可以选择向 Internet of Things Foundation 设备管理服务器通知错误状态的更改。

source: Topic
es: Tema
zh_cn: 主题

source: Message Format
es: Formato del mensaje
zh_cn: 消息格式

source: The "errorCode" is a current device error code that needs to be added to the Internet of Things Foundation.
es: "errorCode" es un código de error de dispositivo que es necesario añadir a Internet of Things Foundation.
zh_cn: “errorCode”是需要添加到 Internet of Things Foundation 的当前设备错误代码。

source: Request Format:
es: Formato de solicitud:
zh_cn: 请求格式：

source: Response Format:
es: Formato de respuesta:
zh_cn: 响应格式：

source: Possible Response Codes:
es: Códigos de respuesta posibles:
zh_cn: 可能的响应代码：

source: 200: The operation was successful.
es: 200: La operación se realizó correctamente.
zh_cn: 200：操作成功。

source: 400: The input message does not match the expected format, or one of the values is out of the valid range.
es: 400: El mensaje de entrada no coincide con el formato esperado, o uno de los valores está fuera del rango válido.
zh_cn: 400：输入消息与期望的格式不匹配，或者其中一个值超出有效范围。

source: 404: The topic name is incorrect, or the device is not in the database.
es: 404: El nombre del tema no es correcto, o el dispositivo no está en la base de datos.
zh_cn: 404：主题名称不正确，或者此设备不在数据库中。

source: 409: A conflict occurred during the device database update. To resolve this, simplify the operation is necessary.
es: 409: Se ha producido un conflicto durante la actualización de base de datos del dispositivo. Para resolverlo, simplifique la operación si es necesario.
zh_cn: 409：在设备数据库更新期间发生冲突。要解决此问题，需要简化操作。

source: Clear Error Codes
es: Borrar códigos de error
zh_cn: 清除错误代码

source: Devices can request that the Internet of Things Foundation clear all of their error codes.
es: Los dispositivos pueden solicitar que Internet of Things Foundation borre todos sus códigos de error.
zh_cn: 设备可以请求 Internet of Things Foundation 清除其所有错误代码。

source: Add Log
es: Añadir registro
zh_cn: 添加日志

source: Devices can choose to notify IoTF device management support about changes a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data.
es: Los dispositivos pueden optar por notificar al servicio de soporte de gestión de dispositivos de IoTF los cambios en una entrada de registro nueva. La entrada de registro incluye mensajes de error, su marca de fecha y hora y gravedad, así como datos de diagnóstico binarios codificados en base 64.
zh_cn: 设备可以选择向 IoTF 设备管理支持人员通知新日志条目的更改。日志条目包括日志消息、消息的时间戳记和严重性，以及采用 base64 编码的二进制诊断数据（可选）。

source: "message" is a diagnostic message that needs to be added to IoTF. "timestamp" is a date and time of the log entry in ISO8601 format. "data" is an optional base64-encoded diagnostic data. "severity" is a severity of the message (0: informational, 1: warning, 2: error).
es: "message" es un mensaje de diagnóstico que es necesario añadir a IoTF. "timestamp" es la fecha y la hora de la entrada de registro en formato ISO8601. "data" son datos de diagnóstico opcionales codificados en base64. "severity" es la gravedad del mensaje (0: informativo, 1: aviso, 2: error).
zh_cn: “message”是需要添加到 IoTF 中的诊断消息。“timestamp”是日志条目的日期和时间（ISO8601 格式）。“data”是采用 base64 编码的诊断数据（可选）。“severity”是消息的严重性（0：参考，1：警告，2：错误）。

source: Clear Logs
es: Borrar registros
zh_cn: 清除日志

source: Devices can request that the Internet of Things Foundation clear all of their log entries.
es: Los dispositivos pueden solicitar que Internet of Things Foundation borre todas sus entradas de registro.
zh_cn: 设备可以请求 Internet of Things Foundation 清除其所有日志条目。

source: Message format
es: Formato de mensaje
zh_cn: 消息格式
