Repository: robert17/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/device_mgmt/operations/observations.po
Languages: es

source: Device Management Operations - Observations
es: Operaciones de gestión de dispositivo - Observaciones

source: Devices must implement observe, notify & cancel operations in order to support :ref:`firmware-actions-update`.
es: Los dispositivos deben implementar las operaciones de observación, notificación y cancelación para admitir :ref:`firmware-actions-update`.

source: Observe Attribute Changes
es: Observar cambios en atributos

source: The Internet of Things Foundation can send this request to a device to observe changes of one or more device attributes. When the device receives this request, it must send a notification request ("notify" message) to the Internet of Things Foundation whenever the observed attributes value changes.
es: Internet of Things Foundation puede enviar esta solicitud a un dispositivo para observar los cambios en uno o varios atributos de dispositivo. Cuando el dispositivo recibe esta solicitud, debe enviar una solicitud de notificación ("notify" message) a Internet of Things Foundation siempre que observe que haya algún cambio en los valores de atributo.

source: Topic
es: Tema

source: Message format
es: Formato de mensaje

source: The "fields" field is an array of the device attribute names from the device model. For example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state". If a complex field, such as "mgmt.firmware" is specified, it is expected that its underlying fields are updated at the same time, such that only a single notify message is generated.
es: El campo "fields" es una matriz de los nombres de atributo de dispositivo procedente del modelo de dispositivo. Por ejemplo, los valores podrían ser "location", "mgmt.firmware" o "mgmt.firmware.state". Si se especifica un campo complejo, por ejemplo, "mgmt.firmware", se espera que sus campos subyacentes se actualicen al mismo tiempo, ya que solo se genera un mensaje de notificación.

source: The "message" field used in the response can be specified if "rc" is not 200. If any field value which was to be observed could not be retrieved, "rc" should be set to 404 (if not found) or 500 (any other reason). When values for fields to be observed cannot be found, "fields" should contain an array of elements with "field" set to the name of each field that could not be read, "value" fields should be omitted. For the response code to be set to 200, both "field" and "value" must be specified, "value" is the current value of an attribute identified by "field" content.
es: El campo "message" utilizado en la respuesta se puede especificar si "rc" no es 200. Si algún valor de campo que es necesario observar no se ha podido recuperar, "rc" se debe establecer en 404 (si no se encuentra) o en 500 (cualquier otro motivo). Cuando los valores de los campos para observar no se encuentren, "fields" debe contener una matriz de elementos con "field" establecido en el nombre de cada campo que no se ha podido leer y deben omitirse los campos "value". Para poder establecer el código de respuesta en 200, es necesario especificar "field" y "value"; "value" es el valor actual de un atributo identificado mediante el contenido de "field".

source: Request Format:
es: Formato de solicitud:

source: Response Format:
es: Formato de respuesta:

source: Cancel Attribute Observation
es: Cancelar la observación de los atributos

source: The Internet of Things Foundation can send this request to a device to cancel the current observation of one or more device attributes. The "fields" is an array of the device attribute names from the device model, for example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state".
es: Internet of Things Foundation puede enviar esta solicitud a un dispositivo para cancelar la observación actual de los cambios en uno o varios atributos de dispositivo. El campo "fields" es una matriz de nombres de atributo de dispositivo procedentes del modelo de dispositivo; por ejemplo, los valores podrían ser "location", "mgmt.firmware" o "mgmt.firmware.state".

source: The "message" field must be specified if "rc" is not 200.
es: El campo "message" se debe especificar si "rc" no es 200.

source: Notify Attribute Changes
es: Notificar cambios en atributos

source: The Internet of Things Foundation can make an observation request referring to a specific attribute or set of values. When the value of the attribute or attributes changes, the device must send a notification containing the latest value.
es: Internet of Things Foundation puede realizar una solicitud de observación que se refiera a un atributo específico o conjunto de valores. Cuando el valor del atributo o los atributos cambie, el dispositivo debe enviar una notificación que contenga el valor más reciente.

source: The "field_name" value is the name of the attribute that has changed, the "field_value" is the current value of the attribute. The attribute can be a complex field, if multiple values in a complex field are updated as a result of a single operation, only a single notification message should be sent.
es: El valor "field_name" es el nombre del atributo que se ha modificado; "field_value" es el valor actual del atributo. El atributo puede ser un campo complejo, si varios valores de un campo complejo se actualizan como resultado de un sola operación, solo debe enviarse un mensaje de notificación.

source: If notify request is processed successfully, "rc" should be set to 200. If the request is not correct, "rc" should be set to 400. If the field specified in the notify request is not being observed, "rc" should be set to 404.
es: Si la solicitud de notificación se procesa correctamente, "rc" debe establecerse en 200. Si la solicitud no es correcta, "rc" debe establecerse en 400. Si no se ha observado el campo especificado en la solicitud de notificación, "rc" debe establecerse en 404.

source: Possible Response Codes:
es: Códigos de respuesta posibles:

source: 200: The operation was successful.
es: 200: La operación se realizó correctamente.

source: 400: The input message does not match the expected format, or one of the values is out of the valid range.
es: 400: El mensaje de entrada no coincide con el formato esperado, o uno de los valores está fuera del rango válido.

source: 404: The topic name is incorrect, the device is not in the database, or there is no observation for the field reported.
es: 404: El nombre del tema no es correcto, el dispositivo no está en la base de datos o no hay observación para el campo notificado.

source: 409: A conflict occurred during the device database update. To resolve this, simplify the operation is necessary.
es: 409: Se ha producido un conflicto durante la actualización de base de datos del dispositivo. Para resolverlo, simplifique la operación si es necesario.

source: 500: An internal error occurred, contact IBM Support.
es: 500: Se ha producido un error interno, póngase en contacto con el soporte de IBM.
