Repository: robert17/iotf-rtd
Catalog: docs/api/historical_events.po-*.po
Languages: es

source: Historical Event API
es: API de sucesos históricos

source: Authentication
es: Autenticación

source: The API is only accessible over HTTPS and is protected by HTTP Basic Authentication. You must provide a username and password with every request.
es: La API solo es accesible a través de HTTPS y está protegida por la autenticación básica HTTP. Debe proporcionar un nombre de usuario y una contraseña con cada solicitud.

source: Username
es: Nombre de usuario

source: A valid API key registered to the organization you want to work with.
es: Una clave de API válida registrada en la organización con la que desea trabajar.

source: Password
es: Contraseña

source: The authentication token corresponding to your API key.
es: Señal de autenticación correspondiente a la clave de API.

source: View all events
es: Ver todos los sucesos

source: View events across all devices registered to the organization
es: Ver sucesos en todos los dispositivos registrados en la organización

source: Request
es: Solicitud

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/historian/
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/historian/

source: Request Headers
es: Cabeceras de solicitud

source: cursorId
es: ID de cursor

source: Use the cursorId response header returned by the initial request to iterate through the list of historical records
es: Utilice la cabecera de respuesta cursorId devuelta por la solicitud inicial para iterar por la lista de registros históricos

source: Required when setting the cursorId header. Use the iotHistorianSessionId cookie returned by the initial request
es: Necesario al establecer la cabecera cursorId. Utilice el cookie iotHistorianSessionId devuelto por la solicitud inicial

source: Request Body
es: Cuerpo de solicitud

source: None
es: Ninguno

source: Query Parameters
es: Parámetros de consulta

source: evt_type - String
es: evt_type - Serie

source: Restrict results only to those events published under this event identifier
es: Restringir resultados sólo a los sucesos publicados bajo este identificador de suceso

source: start - Number of milliseconds since January 1, 1970, 00:00:00 GMT)
es: start - Número de milisegundos desde el 1 de enero de 1970, 00:00:00 GMT)

source: Restrict results to events published after this date
es: Restringir resultados a los sucesos publicados después de esta fecha

source: end - Number of milliseconds since January 1, 1970, 00:00:00 GMT)
es: end - Número de milisegundos desde el 1 de enero de 1970, 00:00:00 GMT)

source: Restrict results to events published before this date
es: Restringir resultados a los sucesos publicados antes de esta fecha

source: Response Headers
es: Cabeceras de respuesta

source: cursorId: use the cursorId response header returned by the initial request to iterate through the list of historical records
es: cursorId: utilice la cabecera de respuesta cursorId devuelta por la solicitud inicial para iterar por la lista de registros históricos

source: Set-Cookie: iotHistorianSessionId
es: Cookie establecido: iotHistorianSessionId

source: Response Body
es: Cuerpo de respuesta

source: Returns a list of historical data records sorted by timestamp in descending order
es: Devuelve una lista de registros de datos históricos clasificados por la indicación de fecha y hora en orden descendente

source: device_id (String)
es: id_dispositivo (Serie)

source: device_type (String)
es: tipo_dispositivo (Serie)

source: evt_type (String)
es: tipo_suceso (Serie)

source: timestamp (Date)
es: indicación de fecha y hora (Fecha)

source: evt (Complex object)
es: evt (Objeto complejo)

source: Example Response
es: Respuesta de ejemplo

source: Common Response Codes
es: Códigos de respuesta comunes

source: 200 (success)
es: 200 (éxito)

source: View events for a device type
es: Ver sucesos para un tipo de dispositivo

source: View events across all devices of a specific type
es: Ver sucesos en todos los dispositivos de un tipo específico

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/historian/**device_type**
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/historian/**tipo_dispositivo**

source: top - Number between 1 and 100
es: top - Número entre 1 y 100

source: Restrict the number of records returned (default=100)
es: Restringir el número de registros devueltos (valor predeterminado=100)

source: summarize - Array
es: summarize - Matriz

source: A list of fields from the JSON event payload on which to perform the aggregate function specified by the summarize_type parameter. The format for the parameter is {field1,field2,...,fieldN}
es: Una lista de campos de la carga útil de suceso JSON en la que realizar la función de agregación especificada por el parámetro summarize_type. El formato del parámetro es {campo1,campo2,...,campoN}

source: summarize_type - String
es: summarize_type - Serie

source: The aggregation to perform on the fields specified by the summarize parameter:
es: Agregación a realizar en los campos especificados por el parámetro summarize:

source: avg (default)
es: avg (valor predeterminado)

source: View events for a device
es: Ver sucesos para un dispositivo

source: View events for a specific device
es: Ver sucesos para un dispositivo específico

source: GET **org\_id**.internetofthings.ibmcloud.com/api/v0001/historian/**device_type**/**device_id**
es: GET **id\_org**.internetofthings.ibmcloud.com/api/v0001/historian/**tipo_dispositivo**/**ID_dispositivo**

source: Restrict the number of records returned (default=100).
es: Restringir el número de registros devueltos (valor predeterminado=100).
