Repository: robert17/iotf-rtd
Catalog: docs/reference/security.po-*.po
Languages: es, ko

source: Securing the Internet of Things
es: Seguridad de Internet of Things
ko: Internet of Things 보안

source: The IBM Internet of Things Foundation (IoT Foundation) is a fully managed, cloud-hosted service that makes it simple to derive value from Internet of Things (IoT) devices.
es: IBM Internet of Things Foundation (IoT Foundation) es un servicio alojado en nube totalmente gestionado que simplifica la derivación de valor desde dispositivos de Internet of Things (IoT).
ko: IBM IoT(Internet of Things) Foundation은 IoT(Internet of Things) 디바이스에서 단순하게 값을 파생시킬 수 있게 하는 완전히 관리되는 클라우드 호스팅 서비스입니다.

source: The following document aims to answer common questions about how your organization's data is protected. Focusing on specific areas:
es: El documento siguiente tiene la intención de proporcionar respuestas a preguntas comunes sobre cómo se protegen los datos de la organización. Centrándose en áreas específicas:
ko: 다음 문서의 목적은 조직의 데이터를 보호하는 방법에 대한 일반적인 질문에 답하는 것입니다. 다음과 같은 특정 영역에 초점을 둡니다.

source: Authentication: assuring the identity of users, devices or applications attempting to access your organization's information.
es: Autenticación: asegurar la identidad de los usuarios, los dispositivos o las aplicaciones que intentan acceder a la información de la organización.
ko: 인증: 조직의 정보에 액세스를 시도하는 사용자, 디바이스 또는 애플리케이션의 ID를 보증합니다.

source: Authorization: assuring that users, devices and applications have permission to access your organization's information.
es: Autorización: asegurar que los usuarios, los dispositivos y las aplicaciones tienen permiso para acceder a la información de la organización.
ko: 권한: 사용자, 디바이스 및 애플리케이션이 조직의 정보에 액세스하는 데 필요한 권한을 가지고 있음을 보증합니다.

source: Encryption: assuring that data is only readable by authorized parties and cannot be intercepted.
es: Cifrado: asegurar que los datos solo son legibles para personas autorizadas y que no se pueden interceptar.
ko: 암호화: 권한 부여된 당사자만 데이터를 읽을 수 있고 데이터를 인터셉트할 수 없음을 보증합니다.

source: Terminology
es: Terminología
ko: 용어

source: How do we secure management of your organization?
es: ¿Cómo proporcionamos seguridad en la gestión de la organización?
ko: 조직 관리에 보안을 설정하는 방법

source: The browser-based GUI and REST APIs are fronted by HTTPS, with a certificate signed by DigiCert enabling you to trust that you're connecting to the genuine IoT Foundation.
es: La GUI basada en navegador y las API REST están lideradas por HTTPS, con un certificado firmado por DigiCert lo que le permite confiar que se está conectando a la IoT Foundation genuina.
ko: 브라우저 기반 GUI 및 REST API는 HTTPS와 마주하고 있으며 진짜 IoT Foundation에 연결하고 있다는 믿음을 줄 수 있는 DigiCert에 의해 서명된 인증서를 가지고 있습니다.

source: GUI: authenticated via your IBM ID.
es: GUI: autenticada mediante el ID de IBM.
ko: GUI: IBM ID를 통해 인증됩니다.

source: REST API: once you create an API key through the GUI, you can use this to make authenticated REST calls against your organization.
es: API REST: una vez que ha creado una clave de API mediante la GUI, puede utilizarla para realizar llamadas REST autenticadas para la organización.
ko: REST API: GUI를 통해 API 키를 작성하고 나면 이를 사용하여 조직에 대해 인증된 REST 호출을 작성할 수 있습니다.

source: How do we secure your device and application credentials?
es: ¿Cómo aseguramos las credenciales de dispositivo y aplicación?
ko: 디바이스 및 애플리케이션 신임 정보에 보안을 설정하는 방법

source: When devices are registered or API keys are generated, the authentication token is salted and hashed. This means your organization's credentials can never be recovered from our systems - even in the unlikely event that the IoT Foundation is compromised.
es: Cuando se registran dispositivos o se generan claves de API, se utilizan sal y hash para la señal de autenticación. Esto significa que las credenciales de la organización no se pueden recuperar nunca de nuestros sistemas, incluso en el caso improbable de que se comprometa IoT Foundation.
ko: 디바이스가 등록되거나 API 키가 생성되면 인증 토큰이 솔트(salt)되고 해시됩니다. 이는 IoT Foundation의 안전을 위협하는 예상 밖의 이벤트에서도 사용자 조직의 신임 정보를 당사의 시스템에서 복구할 수 없음을 의미합니다.

source: Device credentials and API keys can be individually revoked if they are compromised.
es: Las credenciales de dispositivo y las claves de API se pueden revocar individualmente si están comprometidos.
ko: 디바이스 신임 정보 및 API 키는 위태롭게 되는 경우 개별적으로 취소될 수 있습니다.

source: How do we ensure your devices connect securely to the IoT Foundation?
es: ¿Cómo aseguramos que nuestros dispositivos pueden conectarse de forma segura a IoT Foundation?
ko: 당사가 사용자 디바이스가 IoT Foundation에 안전하게 연결되도록 보장하는 방법

source: Devices connect through a unique combination of clientId and authentication token that only you know.
es: Los dispositivos se conectan mediante una combinación exclusiva de Id de cliente y señal de autenticación que sólo el usuario conoce.
ko: 디바이스는 사용자만 알고 있는 클라이언트 ID 및 인증 토큰의 고유 조합을 통해 연결됩니다.

source: Full support for connectivity over TLS (v1.2) is provided.
es: Se proporciona soporte completo para la conectividad sobre TLS (v1.2).
ko: TLS(v1.2)를 통한 연결에 대한 전체 지원이 제공됩니다.

source: Open standards are used (MQTT v3.1.1) to allow easy interop across many platforms and languages.
es: Se utilizan estándares abiertos (MQTT v3.1.1) para permitir la interoperación fácil en muchas plataformas e idiomas.
ko: 많은 플랫폼 및 언어에서 쉽게 상호 운영될 수 있도록 개방형 표준이 사용됩니다(MQTT v3.1.1).

source: How do we prevent data leaking between devices?
es: ¿Cómo impedimos la fuga de datos entre dispositivos?
ko: 디바이스 간 데이터 유출을 방지하는 방법

source: Secure messaging patterns are baked in. Once authenticated, devices are only authorized to publish and subscribe to a restricted topic space:
es: Los patrones de mensajería segura se hornean. Una vez autenticados, los dispositivos solo están autorizados a publicarse y suscribirse en un espacio de tema restringido:
ko: 보안 메시징 패턴이 빌드됩니다. 인증되고 나면 디바이스에는 제한된 주제 공간을 공개하고 구독할 수 있는 권한만 부여됩니다.

source: All devices work with the same topic space. The authentication credentials provided by the client connecting dictate to which device this topic space will be scoped by the IoT Foundation. This prevents devices from being able to impersonate another device.
es: Todos los dispositivos funcionan con el mismo espacio de tema. Las credenciales de autenticación proporcionadas por el cliente que se conecta dictan el ámbito de qué dispositivo en el que IoT Foundation incluirá este espacio de tema. Esto impide que los dispositivos puedan suplantar a otro dispositivo.
ko: 모든 디바이스가 동일한 주제 공간에 대해 작업합니다. 연결하는 클라이언트에 의해 제공된 인증 신임 정보는 IoT Foundation에 의해 이 주제 공간의 범위가 지정될 디바이스를 지시합니다. 이를 수행하면 디바이스가 다른 디바이스를 위장하는 것이 방지됩니다.

source: The only way to impersonate another device is by obtaining compromised security credentials for the device.
es: La única manera de suplantar a otro dispositivo consiste en obtener credenciales de seguridad comprometidas para el dispositivo.
ko: 다른 디바이스를 위장하는 유일한 방법은 해당 디바이스에 대해 안전을 위협하는 보안 신임 정보를 얻는 것입니다.

source: Applications can subscribe and publish on both the event and command topics for all devices in the organization. Applications can analyse data from many devices simultaneously, and can also simulate or proxy devices in addition to forming the complementary side of a full duplex communication loop.
es: Las aplicaciones se pueden suscribir y publicar en los temas de sucesos y mandatos para todos los dispositivos de la organización. Las aplicaciones pueden analizar datos de muchos dispositivos simultáneamente y también pueden simular dispositivos o realizar proxy para los mismos además de formar el lado complementario de un bucle de comunicación dúplex.
ko: 애플리케이션은 조직의 모든 디바이스에 대한 이벤트 및 명령 주제 모두에서 구독하고 공개할 수 있습니다. 애플리케이션은 많은 디바이스의 데이터를 동시에 분석할 수 있으며 전이중 통신 루프의 보완 측을 형성하는 것 외에도 디바이스를 시뮬레이션하거나 프록시 설정할 수도 있습니다.

source: How do we prevent data leaking between organizations?
es: ¿Cómo impedimos la fuga de datos entre organizaciones?
ko: 조직 간 데이터 유출을 방지하는 방법

source: The topic space in which devices and applications operate is scoped within a single organization. When authenticated, the IoT Foundation transforms the topic structure using an organization ID based on the client authentication, making it impossible for data from one organization to be accessed from another.
es: El espacio de tema en el que los dispositivos y las aplicaciones operan tiene un ámbito de una única organización. Cuando se ha realizado la autenticación, IoT Foundation transforma la estructura de tema utilizando un ID de organización basándose en la autenticación de cliente, haciendo que sea imposible acceder a los datos de una organización desde otra.
ko: 디바이스 및 애플리케이션이 작동하는 주제 공간은 단일 조직 내에서 범위가 지정됩니다. 인증된 경우 IoT Foundation은 클라이언트 인증을 기반으로 조직 ID를 사용하여 한 조직의 데이터에 다른 조직이 액세스하지 못하게 할 수 있습니다.
